[ { "experience" : "NOVICE",
    "id" : 404,
    "room" : "Room 9",
    "speaker" : "Andres Almiray",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/5",
    "speakers" : [ { "speaker" : "Andres Almiray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/5"
        } ],
    "summary" : "Groovy is the fastest growing JVM language out there. It might be because it is so easy for Java developers to pick it up, but also because there's an increasing number of projects and libraries that make use of Groovy as the starting point. In this session we'll cover the following topics:\r\n- Frameworks\r\n    Grails, Griffon, Gaelyk\r\n- Build Systems\r\n    Gant, Gradle\r\n- Testing\r\n    Easyb, Spock\r\n- Code Quality\r\n    CodeNarc, GMetrics\r\n- Libraries\r\n    GPars, GContracts",
    "tags" : [ { "name" : "grails" },
        { "name" : "griffon" },
        { "name" : "Gaelyk" },
        { "name" : "GPars" }
      ],
    "title" : "The Groovy Ecosystem",
    "track" : "New Languages on the JVM",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 407,
    "room" : "Room 6",
    "speaker" : "Andres Almiray",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/5",
    "speakers" : [ { "speaker" : "Andres Almiray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/5"
        } ],
    "summary" : "Building a desktop application is a hard task, there are some many things to keep track of that many projects simply fail to meet their goals. Setting up the project structure keeping each artifact on a well identified location given its responsibility and type, defining the base schema for managing the application's life cycle, making sure the build is properly setup, and more. These are recurring tasks that should be handled by a tool or better yet, a framework.\r\nGriffon is such a framework. Inspired by the Grails framework Griffon aims to bring the same productivity gains to desktop development.",
    "tags" : [ { "name" : "grails" },
        { "name" : "griffon" }
      ],
    "title" : "Fyling with Griffon",
    "track" : "New Languages on the JVM",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 408,
    "room" : "Room 9",
    "speaker" : "Gerrit Grunwald",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/394",
    "speakers" : [ { "speaker" : "Gerrit Grunwald",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/394"
        } ],
    "summary" : "Short overview of what you have be aware of when you try to create a HTML5 port of your custom Java Swing components. Unfortunately one could not simply convert the Swing component to HTML5 but with a little knowledge and fortune one could port most of the Java2D code to HTML5 Canvas. As an example a gauge from the Java Swing library \"SteelSeries\" will be ported to HTML5 Canvas.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "Swing" }
      ],
    "title" : "From Java Swing to HTML5 Canvas",
    "track" : "Web",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 415,
    "room" : "Room 6",
    "speaker" : "Václav Pech",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/69",
    "speakers" : [ { "speaker" : "Václav Pech",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/69"
        } ],
    "summary" : "Low-level concurrency handling is usually hard to get right. And it's not much fun either. Now, when parallel systems are the norm in the mainstream, it has become obvious that the common shared-memory multithreading causes more troubles than it solves. In this hands-on session we will go through the concurrency options that GPars (http://gpars.codehaus.org), an open-source concurrency library for Groovy and Java, gives to your Groovy/Grails/Griffon or Java applications. We'll cover parallel collection processing, fork/join, asynchronous closures, actors, dataflow concurrency and other concepts, which aim to make your code concurrent with little effort.\r\nIf you want to learn how to safely harness all the cores in modern processors, this session is for you.",
    "tags" : [ { "name" : "multicore" },
        { "name" : "GPars" },
        { "name" : "groovy" }
      ],
    "title" : "Groovy actors and concurrent dataflow with GPars",
    "track" : "New Languages on the JVM",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 438,
    "room" : "Room 5",
    "speaker" : "Jonas Bonér",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/807",
    "speakers" : [ { "speaker" : "Jonas Bonér",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/807"
        } ],
    "summary" : "We believe that one should never have to choose between productivity and scalability, which has been the case with traditional approaches to concurrency and distribution. The cause of that has been the wrong tools and the wrong layer of abstraction — and Akka is here to change that. Akka is using the Actors together with Software Transactional Memory (STM) to create a unified runtime and programming model for scaling both UP (utilizing multi-core processors) and OUT (utilizing the grid/cloud). Akka provides location and network transparency by abstracting away both these tangents of scalability by turning them into an operations and configuration task. This gives the Akka runtime freedom to do adaptive automatic load-balancing, cluster rebalancing, replication and partitioning. In this talk you will learn what Akka is and how it can be used to solve hard scalability problems. Akka is available at http://akka.io (under Apache 2 license).",
    "tags" : [ { "name" : "scala" },
        { "name" : "scalable" },
        { "name" : "multicore" },
        { "name" : "actors" },
        { "name" : "STM" }
      ],
    "title" : "Above the Clouds: Introducing Akka",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 442,
    "room" : "Room 5",
    "speaker" : "Sanne Grinovero",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1234",
    "speakers" : [ { "speaker" : "Sanne Grinovero",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1234"
        },
        { "speaker" : "Pete Muir",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295"
        },
        { "speaker" : "Mircea Markus",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/814"
        }
      ],
    "summary" : "In this talk, Infinispan founder and project lead Manik Surtani, along with core Infinispan committers Mircea Markus and Pete Muir, takes the audience through a deep dive into Infinispan.  This code-centric talk will cover:\r\n\r\n* Configuring and setting up a data grid\r\n* Making use of eviction and expiry to control how much is stored in memory\r\n* Making use of write-through and write-behind persistence, as well as passivation/overflow\r\n* The eventing API to figure out what's going on in your grid\r\n* Using JMX hooks to manage and monitor your grid\r\n* Using the Group API to ensure entries are colocated\r\n* Making use of distributed code execution and map/reduce APIs\r\n* Interacting with Infinispan from Spring and CDI\r\n* Benchmarking Infinispan using RadarGun, and using RadarGun to tune your Infinispan setup\r\n\r\nAll in the context of building, testing and deploying a real application.",
    "tags" : [ { "name" : "performance" },
        { "name" : "scalable" },
        { "name" : "caching" },
        { "name" : "Infinispan" },
        { "name" : "NoSQL" },
        { "name" : "cloud" }
      ],
    "title" : "Real-world deep-dive into Infinispan - the open source data grid platform",
    "track" : "Java EE",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 447,
    "room" : "Room 5",
    "speaker" : "Matt Raible",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/20",
    "speakers" : [ { "speaker" : "Matt Raible",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/20"
        } ],
    "summary" : "This session shows you how to use some of the hottest technologies today to build a webapp, an API and a mobile application to track fitness workouts. Using HTML5 technologies (specifically geo and local storage), I’ll show you how you can track the time, distance and music you listened to while exercising. Play with Scala is used for the backend and services, while CoffeeScript and Jade are used for the front-end templating and Ajax communication.\r\n\r\nThis session will explain limitations encountered with HTML5 and discuss when native apps might work better.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "scala" },
        { "name" : "javascript" },
        { "name" : "Play!" }
      ],
    "title" : "HTML5 with Play/Scala, CoffeeScript and Jade",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 448,
    "room" : "Room 4",
    "speaker" : "Guillaume Laforge",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/6",
    "speakers" : [ { "speaker" : "Guillaume Laforge",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/6"
        } ],
    "summary" : "With the recent release of Groovy 1.8, the latest major milestone of the popular and successful dynamic language for the JVM, it is a great opportunity to discover and discuss its latest features!\r\n\r\nIn the spotlight: improved syntax for readable Domain-Specific Languages with \"command chains\", new runtime performance improvements for primitive calculations, support for concurrency and parallelism, built-in support for parsing and producing JSON payloads. And we'll finish the journey with the newest boilerplate code busters with the \"AST Transformations\" that will help you further streamline your code, and make it more concise and more powerful.",
    "tags" : [ { "name" : "DSL" },
        { "name" : "groovy" }
      ],
    "title" : "What's new in Groovy 1.8 and beyond?",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 453,
    "room" : "BOF 1",
    "speaker" : "Regina ten Bruggencate",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/219",
    "speakers" : [ { "speaker" : "Regina ten Bruggencate",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/219"
        },
        { "speaker" : "Anna Gos",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1020"
        }
      ],
    "summary" : "A discussion on the role of women in Java and IT in general. With a meet and greet moment for women and a short talk about  jDuchess (http://jduchess.org). Duchess is a global organization for women in Java technology. Duchess provides a platform through which women who work with Java can connect with each other and get involved in the greater Java community. It aims to make women's role and the individual women's contributions visible in the Java community and to teach the benefits of diversity in any team environment - whether corporate or open-source.",
    "tags" : [ { "name" : "JUG" },
        { "name" : "Duchess" }
      ],
    "title" : "Women in Java an unconference",
    "track" : "Methodology",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 459,
    "room" : "Room 5",
    "speaker" : "Lincoln Baxter III",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/71",
    "speakers" : [ { "speaker" : "Lincoln Baxter III",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/71"
        },
        { "speaker" : "Dan Allen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244"
        }
      ],
    "summary" : "How many times have you wanted to start a new project in Java EE, but struggled to put all the pieces together? Has the Maven archetype syntax left you scratching your head? Everyone else is talking about Rails, Grails, and Roo, and you're left thinking, \"I wish it were that easy for me.\" Well, there's good news: You don't have to leave Java EE just to find a developer tool that makes starting out simple. Seam Forge is heating up Java EE, and is ready to work it into a full-fledged project.\r\n\r\nIt's also an incremental enhancement tool that lets you to take an existing Java EE projects and safely work-in new functionality. Seam Forge comprehends your entire project, including the abstract structure of the files, and can make intelligent decisions of how and what to change.\r\n\r\nWhether you want to get your startup going today, or make your big customers happy tomorrow, Seam Forge is a tool you should be looking at. Attend this session and get started - today!",
    "tags" : [ { "name" : "javaee" },
        { "name" : "jboss" },
        { "name" : "seam" },
        { "name" : "Tools" }
      ],
    "title" : "Forge new Ground in Rapid Enterprise Java Development",
    "track" : "Java EE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 469,
    "room" : "Room 6",
    "speaker" : "Lars Vogel",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/99",
    "speakers" : [ { "speaker" : "Lars Vogel",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/99"
        } ],
    "summary" : "Getting started with Android is simple. This session presents the basic architecture of Android, demonstrates the Android Development Tools (ADT) for Eclipse, and guides the audience through the base concepts like Activities, Services, Broadcast Receiver and ContentProvider.\r\n\r\nDuring this presentation an Android application is live developed. This application demonstrates the creation of a simple drawing program and how to track the current device position \r\nvia incoming calls.\r\n\r\nAfter this session the audience should feel comfortable to start developing own Android Applications.",
    "tags" : [ { "name" : "android" },
        { "name" : "Eclipse" }
      ],
    "title" : "Android Jumpstart - Introduction to Android App development",
    "track" : "Mobile",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 471,
    "room" : "Room 5",
    "speaker" : "Chris Richardson",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/55",
    "speakers" : [ { "speaker" : "Chris Richardson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/55"
        } ],
    "summary" : "Relational databases have long been considered the one true way to persist enterprise data. But today, NoSQL databases are emerging as a viable alternative for many applications. They can simplify the persistence of complex data models and offer significantly better scalability, and performance. But NoSQL databases are very different than the ACID/SQL/JDBC/JPA world that we have become accustomed to. In this presentation, you will learn about our experience implementing a use case from POJOs in Action using popular NoSQL databases: Redis, MongoDB, and Neo4j. We will compare and contrast each database’s data model and Java API. You will learn about the benefits and drawbacks of using NoSQL.",
    "tags" : [ { "name" : "Redis" },
        { "name" : "MongoDB" },
        { "name" : "POJO" },
        { "name" : "NoSQL" }
      ],
    "title" : "NoSQL for Java developers",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 480,
    "room" : "Room 8",
    "speaker" : "Bert Ertman",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/845",
    "speakers" : [ { "speaker" : "Bert Ertman",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/845"
        },
        { "speaker" : "Paul Bakker",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/847"
        }
      ],
    "summary" : "Java EE 6 contains new APIs that revolutionary change the way you can build enterprise level applications with an even stronger focus on ease-of-development and further reducing the need of boilerplate code and configuration. The result is a strongly simplified programming model, while still keeping enterprise features such as transactions, security, load-balancing and fail-over.\r\n\r\nIn this session we'll demonstrate how to use the APIs together to build a portable, full stack enterprise application and solve real-world problems. We'll not only focus on the APIs but we'll also show you how to set up a vanilla Maven build from scratch and do unit and integration testing going into almost all parts of the Java EE 6 specs.\r\n\r\nAt the end we'll discuss the architectural consequences of this simplified programming model. Do we still need business delegates, transfer objects or DAOs? And what about separation of concerns?\r\n\r\nThe session is fun and very interactive while still showing the technology in depth.",
    "tags" : [ { "name" : "AJAX" },
        { "name" : "JSF2" },
        { "name" : "EJB31" },
        { "name" : "CDI" },
        { "name" : "JAX-RS" },
        { "name" : "Maven" },
        { "name" : "javaee6" }
      ],
    "title" : "Building Next-generation Enterprise Applications in Java a.k.a. Duke’s Duct Tape Adventures",
    "track" : "Java EE",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 482,
    "speaker" : "David Pollak",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/850",
    "speakers" : [ { "speaker" : "David Pollak",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/850"
        } ],
    "summary" : "The Lift Web Framework powers high volume, interactive web sites including Novell Vibe, Foursquare and the UK Guardian.  The philosophy behind Lift is different from the MVC norm and that difference leads to more secure, more interactive, more maintainable and highly scalable web sites.\r\n\r\nJoin David Pollak, the founder of Lift as he explores software paradigms and how they lead to user paradigms... how CRUD leads to a particular user experience while event models and declarative dependencies lead to another kind of user experience... and how all of this grows beyond the browser into tablet devices.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "RIA" }
      ],
    "title" : "Building interactive stuff for real people",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 484,
    "room" : "Room 9",
    "speaker" : "Roland Huss",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/767",
    "speakers" : [ { "speaker" : "Roland Huss",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/767"
        } ],
    "summary" : "Jolokia is a JMX-HTTP bridge giving an alternative to JSR-160 connectors. It is an agent based approach \r\nfor remote JMX access with support for many platforms. In contrast to standard JSR 160 connectors, the communication between client and agent goes over HTTP where the payload is represented in JSON. In addition to basic JMX operations Jolokia enhances JMX remoting with unique features like bulk requests or fine grained security policies. Several client libraries for various programming languages already exist out of the box but writing an own client binding is not difficult.\r\n\r\nThis talk focus on an overview of Jolokia, its features and highlights.",
    "tags" : [ { "name" : "JMX" },
        { "name" : "JSON" },
        { "name" : "HTTP" }
      ],
    "title" : "Jolokia - JMX on Capsaicin",
    "track" : "Java EE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 486,
    "room" : "Room 6",
    "speaker" : "Michael Hüttermann",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/238",
    "speakers" : [ { "speaker" : "Michael Hüttermann",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/238"
        } ],
    "summary" : "An essential aspect of Agile Application Lifecycle Management (ALM) is task-based development. With a task-based approach, the team can monitor which build artifacts and releases implement which requirements as well as which requirements are implemented by which artifacts, or are available in which release respectively. This session puts Agile ALM and task-based development into context. It shows how traceable reproducibility of work items can streamline the development and makes it even more concise and determined. With concrete examples, this session illustrates lightweight tool chains consisting of Eclipse, Mylyn, Maven, JIRA, FishEye, Jenkins and Artifactory.",
    "tags" : [ { "name" : "ALM" } ],
    "title" : "Pimp your ALM, with task-based development",
    "track" : "Methodology",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 487,
    "room" : "BOF 2",
    "speaker" : "Michael Hüttermann",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/238",
    "speakers" : [ { "speaker" : "Michael Hüttermann",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/238"
        },
        { "speaker" : "René Gielen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/237"
        }
      ],
    "summary" : "Agile ALM is the comprehensive approach for software engineering along the complete software lifecycle, starting with requirements management and ending with the delivery. Agile ALM comprises integrating project roles, artifact types and project phases as well as Agile strategies (like Continuous Integration) and lightweight tools. In this BOF, we'll discuss building blocks of Agile ALM, its current status and its future. Beside the author of the book \"Agile ALM\", contributors to the book, ALM community, vendors of ALM tools, and friends, we'll join the BOF.",
    "tags" : [ { "name" : "ALM" } ],
    "title" : "Meet Agile ALM: Agile Application Lifecycle Management",
    "track" : "Methodology",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 497,
    "room" : "Room 6",
    "speaker" : "David Geary",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/231",
    "speakers" : [ { "speaker" : "David Geary",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/231"
        } ],
    "summary" : "Video games are fun to play, but they are much more fun to develop. Taking an idea for a game to fruition in the browser is one of the most gratifying experiences for a software developer. And it makes testing the best part of your day!\r\n\r\nIn this talk, you'll see how to implement a game using HTML5 APIs such as Canvas, Audio, and Local Storage. With the Canvas API you can implement static games, such as board games or puzzles, with relative ease. But in this talk, we'll tackle the more difficult realm of the game spectrum by looking at the implementation of a full-blown arcade game, complete with smooth animation, sprites, and yes, explosions.",
    "tags" : [ { "name" : "HTML5" } ],
    "title" : "HTML5 Game Development: The most fun you can have in a browser",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 519,
    "room" : "Room 9",
    "speaker" : "Henri Muurimaa",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/874",
    "speakers" : [ { "speaker" : "Henri Muurimaa",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/874"
        } ],
    "summary" : "The Scala toolset lacks a RIA platform allowing the developer to create the user interface in pure Scala. This presentation demonstrates how Vaadin fills that gap. We create a Vaadin Scala project using the corresponding Eclipse plugins, and build a beautiful, ajax-enabled application from scratch. In addition, we show how to leverage HTML5 using Vaadin add-ons. Everything is done in Scala only - no XML, HTML or JavaScript are needed.\r\n\r\n* Get introduced to Vaadin Framework\r\n* Find out best practices on how to use Vaadin APIs from Scala\r\n* Learn how to start writing beautiful web applications in no time leveraging the power of Scala\r\n\r\nThe session will include two parts. First we present the used tools and concepts. Then we build an application step-by-step to demonstrate how to use the tools.\r\n\r\nAll developers interested in writing rich desktop-like user interfaces for the web should attend - no experience of web technologies is needed.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "scala" },
        { "name" : "Eclipse" },
        { "name" : "vaadin" }
      ],
    "title" : "Using Vaadin to create HTML5-enabled web apps in pure Scala",
    "track" : "Web",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 532,
    "room" : "Room 9",
    "speaker" : "Pierre-Antoine Grégoire",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/622",
    "speakers" : [ { "speaker" : "Pierre-Antoine Grégoire",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/622"
        } ],
    "summary" : "Javascript is a very powerful language, sadly seen by most people as doodleware allowing to make popups appear, and to annoy developers with its untyped-DOM-incoherence crazyness.\r\nThough Javascript is most likely to be tomorrow's language, being the most used language of all, having plenty of very nice frameworks (jQuery being the most famous) and now reaching the server-side.\r\nThis quick presentation will make a quick tour of Javascript's specifics and run a few demos of Javascript server-side using node.js.\r\nIt is meant as an appetizer for people who want to investigate Javascript further on.",
    "tags" : [ { "name" : "javascript" } ],
    "title" : "Javascript REDUX",
    "track" : "Web",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 540,
    "room" : "Room 9",
    "speaker" : "James Williams",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/114",
    "speakers" : [ { "speaker" : "James Williams",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/114"
        } ],
    "summary" : "There was once a time where gaming in the browser meant Flash. That time is no more. Based on OpenGL ES, WebGL brings the 3D world to the browser without any plugins. For the first time, the browser has access to a powerful graphics pipeline comparable to what is available on the desktop and in some cases can leverage the GPU. Innovations like requestAnimationFrame which helps the browser to intelligently and efficiently redraw the canvas helps to blur the line between desktop and browser based casual games. \r\nIn this session, you’ll learn the basics of game programming, WebGL, and how to create games using libraries from the WebGL ecosystem.",
    "tags" : [ { "name" : "HTML5" } ],
    "title" : "Intro to HTML5 Game Programming - WebGL Edition",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 542,
    "room" : "Room 8",
    "speaker" : "Emmanuel Bernard",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117",
    "speakers" : [ { "speaker" : "Emmanuel Bernard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117"
        } ],
    "summary" : "PaaS, Cloud. How to store data is the real challenge. In a NoSQL store? Could we do that with familiar APIs?\r\n\r\nThe goal of Hibernate OGM is to explore how we could reuse Java Persistence (known domain model centric API) to store entities in NoSQL stores. It offers a JPA front end (object manipulation and JP-QL query) to applications while storing and querying data from a key/value grid (and other NoSQL later). That includes trying to support existing applications using JPA.\r\n\r\nIn this presentation, we will:\r\n- see an overview of the (No)SQL landscape and how a JPA front end can fit some interesting use cases.\r\n- explore how to store entities and associations into a key/value store and what compromise has to be made.\r\n- explore the trade-offs between schema vs schema-less, what can be translated from the relational model and what cannot\r\n- see how one can implement JP-QL queries on top of a non queryable technology (key/value store)\r\n\r\nThis presentation will contains live demos.",
    "tags" : [ { "name" : "Infinispan" },
        { "name" : "Hibernate" },
        { "name" : "NoSQL" }
      ],
    "title" : "JPA on NoSQL: an approach with Hibernate OGM",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 544,
    "room" : "Room 8",
    "speaker" : "Oliver Gierke",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/54",
    "speakers" : [ { "speaker" : "Oliver Gierke",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/54"
        } ],
    "summary" : "Domain driven design has become a ubiquitous approach to tackle complex problem domains and build a rich object model. Furthermore JPA has become the standard and widely accepted way of object persistence in the Java world.\r\n\r\nThe talk introduces the the Spring Data project in general with a focus on the JPA module that allows developers to easily implement JPA based repositories in a sophisticated way. We start with a brief analysis of a plain JPA based repository implementation and outline pain points esp. regarding the domain driven approach (lack of abstraction, tediousness of executing queries, pagination and so on). The main part of the talk then takes a look at how Spring Data JPA provides solutions to those problems.\r\n\r\nThe presentation is 80% hands on - less slides, more code :).",
    "tags" : [ { "name" : "JPA2" },
        { "name" : "spring" }
      ],
    "title" : "Spring Data JPA - Repositories done right",
    "track" : "Architecture",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 554,
    "room" : "Room 6",
    "speaker" : "Steffen Pingel",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/918",
    "speakers" : [ { "speaker" : "Steffen Pingel",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/918"
        } ],
    "summary" : "In under four years, Mylyn’s task-focused interface has gone from a university whiteboard to a tool with over a million monthly downloads.  Not long ago, the notion of a tool that re-aligns the IDE around Agile collaboration and hides more of the program than it shows seemed radical.  But as the task-focused interface continues its adoption, the next big step in the evolution of developer tools is becoming clear. In order to get the full benefits of Agile, the planning loop must be connected to development activities across the application lifecycle. This talk will showcase Mylyn and the broad ecosystem which encompasses over 50 different integrations for ALM systems. We will demonstrate how tasks, source code and builds can be managed effectively with Mylyn, and examine how re-aligning collaboration around a unified notion of tasks not only accelerates developer’s adoption of Agile project management tools, but also yields a measurable productivity benefit when deployed in teams.",
    "tags" : [ { "name" : "ALM" },
        { "name" : "Eclipse" },
        { "name" : "Tools" }
      ],
    "title" : "Eclipse Mylyn: Connecting Agile, ALM and the IDE",
    "track" : "Methodology",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 556,
    "room" : "Room 4",
    "speaker" : "Josh Long",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921",
    "speakers" : [ { "speaker" : "Josh Long",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921"
        } ],
    "summary" : "Today's applications don't exist in a vacuum - they are are increasingly more valuable because of their users. One way to capitalize on this is to make it easy for your applications to integrate with their users. Make them social. Today, social networks like Facebook, Twitter, LinkedIn, TripIt, and protocols like XMPP, e-mail, and RSS/ATOM represent the easiest way to make applications valuable to users and the easiest way to give your application the in-depth awareness of its users. In this talk, Josh Long will introduce the support for social applications using Spring Integration and Spring Social. Spring Social is an abstraction that provides a generic authentication and authorization framework for OAuth2 clients, as well as several platform abstractions for popular providers like Facebook, Twitter, and LinkedIn. Spring Integration is an integration framework.",
    "tags" : [ { "name" : "spring" } ],
    "title" : "Socializing Your Spring Applications",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 560,
    "room" : "Room 9",
    "speaker" : "Josh Long",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921",
    "speakers" : [ { "speaker" : "Josh Long",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921"
        } ],
    "summary" : "It's one thing to talk about technologies during a Devoxx \"Quickie,\" but it's quite another to get a useful application working entirely in a \"Quickie!\" In this talk, Josh Long will introduce Spring Roo, and employ some of the powerful Roo addons to build a good looking, powerful application that can be easily developed, tested, and deployed in almost no time at all! Once the prototype's done, it can be turned over to the Java developers in-house and maintained using existing enterprise Java skills.",
    "tags" : [ { "name" : "spring" } ],
    "title" : "The Quickie Prototype, or, Getting the Job Done Before Lunch",
    "track" : "Web",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 561,
    "room" : "Room 8",
    "speaker" : "Mattias Karlsson",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/617",
    "speakers" : [ { "speaker" : "Mattias Karlsson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/617"
        } ],
    "summary" : "Code Reviews increase code quality and reduce defect rate. But not necessarily for the reasons you might think. In this talk Mattias will share his experience regarding Code Reviews with a different approach\nand how that increases code quality and team spirit.",
    "tags" : [ { "name" : "collaboration" },
        { "name" : "agile" }
      ],
    "title" : "Code Reviews - One Thing Every Programmer Should Know",
    "track" : "Methodology",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 562,
    "room" : "Room 8",
    "speaker" : "Josh Long",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921",
    "speakers" : [ { "speaker" : "Josh Long",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921"
        },
        { "speaker" : "Chris Richardson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/55"
        }
      ],
    "summary" : "Let's face it, the cloud's here to stay. Spring's always been about portability and choice, and the cloud is no different. CloudFoundry, introduced to rave reviews and massive enthusiasm in the NOSQL, Node.js, Ruby, Scala and Java communities, represents the most promising, most open cloud platform for Java and Spring applications today, and tomorrow. In this talk, Josh Long will introduce CloudFoundry, it's architecture, and how it can be used with existing Spring applications and new ones, leveraging Spring 3.1.",
    "tags" : [ { "name" : "CloudFoundry" },
        { "name" : "cloud" },
        { "name" : "spring" }
      ],
    "title" : "Spring into the Cloud",
    "track" : "Architecture",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 568,
    "room" : "Room 4",
    "speaker" : "Johan Haleby",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/928",
    "speakers" : [ { "speaker" : "Johan Haleby",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/928"
        } ],
    "summary" : "Testing asynchronous systems is hard. Not only does it require handling threads, timeouts and concurrency issues, but the intent of the test code can be obscured by all these details. Awaitility is a small Java based DSL that allows you to express expectations of an asynchronous system in a concise and easy to read manner. Come and see how easily fragile time consuming tests can be transformed into its more robust and elegant counterpart.",
    "tags" : [ { "name" : "javase" },
        { "name" : "asynchronous" },
        { "name" : "Testing" },
        { "name" : "scala" },
        { "name" : "groovy" }
      ],
    "title" : "Stop sleeping, start awaiting!",
    "track" : "Java SE",
    "type" : "Quickie"
  },
  { "experience" : "SENIOR",
    "id" : 569,
    "room" : "Room 4",
    "speaker" : "Alex Soto",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/859",
    "speakers" : [ { "speaker" : "Alex Soto",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/859"
        } ],
    "summary" : "Due to the advent of mobile Internet, a variety of devices have connection to the world (mobiles, pads, ...), keeping web pages as lightweight as possible is a must. Improving design of a web application should be the primary goal. With the right design, secondary strategies can be followed.\r\nHTML5 is the latest revision of HTML. In particular adds many new Javascript and CSS features like Web Storage, Native Drag&Drop, Animations, Text Effects, … JS and CSS files should be kept as small as possible; aggregation and minification is a strategy to get this goal.\r\nAggregation and minification can be achieved using a Maven plugin during package phase. This approach has some disadvantages (rerunning for each change and duplication of code). For avoiding them a runtime approach would be better, and Jawr provides this capability. Jawr bundles all JS and CSS files together and compresses result files at runtime.\r\nWe’ll dive into Jawr architecture providing quick examples on various Java web frameworks.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "performance" },
        { "name" : "javaee" },
        { "name" : "CSS3" },
        { "name" : "javascript" },
        { "name" : "SpringMVC" }
      ],
    "title" : "Speeding Up Javascript & CSS Download Times With Aggregation and Minification",
    "track" : "Web",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 571,
    "room" : "BOF 1",
    "speaker" : "Martijn Verburg",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405",
    "speakers" : [ { "speaker" : "Martijn Verburg",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405"
        },
        { "speaker" : "Ben Evans",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/930"
        }
      ],
    "summary" : "With reinvigorated processes for Java standards, and a desire for greater end-user participation and feedback into the standards process, this is a great time to get involved in the future direction of Java.  In particular JSR-348 (aka JCP.next) is making great strides towards openness and transparency in the Java standards process.  But is it enough?\r\n\r\nBoth Oracle and community leaders have identified a significant under-participation by end-users and ordinary developers in the standards process. This leads to standards that sometimes could have been better thought-out or more easily applicable to developers use cases.\r\n\r\nThis BoF aims to provide panel and audience discussion which leads to raw feedback for the standards process as to what is currently wrong with existing standards. In addition, we want to motivate greater participation by end-users and developers in the standards process.",
    "tags" : [ { "name" : "javase" },
        { "name" : "JUG" },
        { "name" : "javaee" },
        { "name" : "jcp" },
        { "name" : "JSR" },
        { "name" : "javame" }
      ],
    "title" : "Less annoying Java standards",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 572,
    "room" : "Room 8",
    "speaker" : "Martijn Verburg",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405",
    "speakers" : [ { "speaker" : "Martijn Verburg",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405"
        },
        { "speaker" : "Ben Evans",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/930"
        }
      ],
    "summary" : "What makes a Java developer “well-grounded”?\r\n\r\nWe believe that in the coming years, one of the most important skills a developer needs is a sense of perspective. Perspective is what enables a developer to relate their day-to-day work and self-development to the large-scale trends in Java, other JVM languages and the wider industry. Perspective is what allows a developer to distinguish between what's hype and what's important to get involved with. It's the development of this perspective that truly makes a developer well-grounded.\r\n\r\nIn this talk, we discuss the five major themes within the core of programming languages which we believe are in the midst of a renaissance. Whilst external aspects such as cloud, NoSQL, etc, etc have been grabbing more than their share of the headlines, these topics are what are reinventing the day to day practice of coding for many developers.\r\n\r\n* Polyglot programming\r\n* Concurrency\r\n* Type Systems\r\n* Functional Programming\r\n* Modularity",
    "tags" : [ { "name" : "javase" },
        { "name" : "scala" },
        { "name" : "modules" },
        { "name" : "polyglot" },
        { "name" : "Methodology" },
        { "name" : "multicore" },
        { "name" : "Clojure" },
        { "name" : "JVM" },
        { "name" : "groovy" }
      ],
    "title" : "The Well-Grounded Java Developer",
    "track" : "Methodology",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 590,
    "room" : "Room 8",
    "speaker" : "Rafael Liu",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/818",
    "speakers" : [ { "speaker" : "Rafael Liu",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/818"
        } ],
    "summary" : "With the JSR-299 for Context and Dependency Injection released as final, a few ways to deal with this subject have emerged. More than an API, CDI enforces IoC, a known best practice in software engineering, and enhances it with a rich API. To use CDI means obey to some principles which, together with a powerful API, can be used to leverage test creation. We'll see how, properly using CDI concepts and CDI extensions, we can ease the creation of tests and promote test-driven development.",
    "tags" : [ { "name" : "Testing" },
        { "name" : "CDI" },
        { "name" : "TDD" }
      ],
    "title" : "Make it test-driven with CDI!",
    "track" : "Java EE",
    "type" : "Quickie"
  },
  { "experience" : "SENIOR",
    "id" : 597,
    "room" : "Room 8",
    "speaker" : "John Smart",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/268",
    "speakers" : [ { "speaker" : "John Smart",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/268"
        } ],
    "summary" : "Continuous Delivery is the highest form of Continuous Integration. More than just automated deployment, Continuous Delivery involves a mindset change - *any* build that passes the necessary quality gates can be deployed into production on demand.\r\n\r\nIn this talk, 'Jenkins: The Definitive Guide' author John Ferguson Smart discusses strategies enabling you to turn your Jenkins server into a Continuous Delivery platform, including:\r\n\t- Ways to ensure your builds are always production-ready - automatically!\r\n\t- Parameterizing your builds with style!\r\n\t- Using build pipelines and build promotion in Jenkins to filter out poor builds and streamline the build process.\r\n\t- Reusing artifacts across builds\r\n\t- Rolling back and redeploying previous builds\r\n\t- Database update strategies\r\n\t- Deploying to app servers and to the cloud\r\n\r\nThis talk is aimed at developers and build engineers with some previous experience with Hudson/Jenkins.",
    "tags" : [ { "name" : "CI" } ],
    "title" : "Jenkins: From Continuous Integration to Continuous Delivery",
    "track" : "Java EE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 606,
    "room" : "Room 6",
    "speaker" : "Roy van Rijn",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/284",
    "speakers" : [ { "speaker" : "Roy van Rijn",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/284"
        } ],
    "summary" : "Roy always wants to know how things work, to the smallest detail. This session will focus on music recognition like Shazam and SoudHound. Those \"magic\" programs that identify songs by listening to it. After this session you'll not only know how to implement this in Java. You'll also have learned how a microphone works, how the human ear works, how to capture and analyse sound in Java SE, what the Fourier Transformation does, and of course how those music recognition algorithms do their magic. Also, after publishing this information on my blog I've received a couple of patent infringement claims from Shazam's patent holders. Can you really be sued after a weekend of programming and releasing the source code?",
    "tags" : [ { "name" : "javase" } ],
    "title" : "What Shazam doesn't want you to know",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 622,
    "room" : "BOF 2",
    "speaker" : "Pete Muir",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295",
    "speakers" : [ { "speaker" : "Pete Muir",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295"
        },
        { "speaker" : "Emmanuel Bernard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117"
        }
      ],
    "summary" : "In this BOF Pete (JSR-346: CDI 1.1 Spec Lead) will be joined by other CDI and Java EE experts to discuss with the audience their experiences with CDI and the Java EE development model. This session is a chance for you to share any frustrations you may have and get the experts opinion. It's also a great chance to understand and influence the future of the specification.\r\n\r\nGet your questions ready!",
    "tags" : [ { "name" : "javaee" },
        { "name" : "CDI" }
      ],
    "title" : "CDI, what comes next?",
    "track" : "Java EE",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 627,
    "room" : "Room 5",
    "speaker" : "Aslak Knutsen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/166",
    "speakers" : [ { "speaker" : "Aslak Knutsen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/166"
        } ],
    "summary" : "Arquillian is the missing link in Java EE development. Developers have long had to fend for themselves in the testing stage, burdened with bootstrapping the infrastructure on which the test depends. That's time lost, and it places a high barrier to entry on integration testing. Arquillian tears down that barrier. \r\n\r\nArquillian is a container-oriented test framework. It picks up where unit tests leave off, targeting the integration of application code inside a real runtime environment. Just as Java EE 5 simplified the server programming model by providing declarative services for POJOs, Arquillian equips tests with container lifecycle management and enrichment.\r\n\r\nThis talk will go behind the scenes of Arquillian, lift up the curtain and unveil the Extendable Enterprise Test Platform:\r\n\r\n- Give your test classes new capabilities\r\n- Manipulate the packaging process\r\n- Hide testing framework integration complexity\r\n- Integrate into the test runners lifecycle",
    "tags" : [ { "name" : "javaee" },
        { "name" : "Testing" }
      ],
    "title" : "Arquillian - The Extendable Enterprise Test Platform",
    "track" : "Java EE",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 630,
    "room" : "Room 7",
    "speaker" : "Frederik Heremans",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/978",
    "speakers" : [ { "speaker" : "Frederik Heremans",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/978"
        },
        { "speaker" : "Petter Holmström",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/980"
        }
      ],
    "summary" : "This year, the Devoxx registration application has been revamped by the guys from Activiti and Vaadin. This session will shortly introduce both frameworks, before diving into the detailed story\r\non how the Devoxx registration project was architected, build, deployed and served\r\nall of the Devoxx visitors. \r\n\r\nBoth Activiti and Vaadin are projects that offer high productivity, and their combination\r\nis a match made in heaven.\r\n\r\nThe whole UI of the Devoxx registration application is written in Vaadin using the MVP approach. Vaadin is an an open source web framework built on top of GWT for writing rich applications without\r\nthe need for writing any HTML or Javascript.The session will cover the details and will learn you a lot of Vaadin best-practices.\r\n\r\nThe back-end processing is done with Activiti, an open source, rock-solid \r\nand performant Java BPM framework, by Alfresco. Activiti has excellent Spring\r\nand unit testing capibilities, making it easy for developers to implement processes\r\nthe way they like it.",
    "tags" : [ { "name" : "Activiti" },
        { "name" : "spring" },
        { "name" : "vaadin" }
      ],
    "title" : "Activiti and Vaadin, A match made in heaven",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 632,
    "room" : "Room 6",
    "speaker" : "Laurent Guerin",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/961",
    "speakers" : [ { "speaker" : "Laurent Guerin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/961"
        } ],
    "summary" : "This talk explains how to build a data-centric Web App from scratch with the Telosys Tools Eclipse plugin.\r\n\r\nIt shows how a « lightweight model » (built from the database metadata) can be used as a customizable repository in order to generate different kinds of files (Java, JSP, JavaScript, etc…) and to produce a standard Java EE application deployable via a war file.\r\n\r\nThe presentation covers the following points :\r\n\r\n. the tools principles ( “in praise of simplicity”, how the programmer’s life could be easier)\r\n. Telosys Framework (open source “full-stack” framework)\r\n. “database first” approach (MDD without UML)\r\n. Telosys Tools Eclipse plugin\r\n. few use cases\r\n\r\nA demo illustrates how to\r\n\r\n. generate the repository from an existing database\r\n. customize the repository\r\n. generate SCRUD screens\r\n. customize the generator’s templates\r\n. extend the generation targets (documentation, other languages, etc…)",
    "tags" : [ { "name" : "javaee" },
        { "name" : "REST" },
        { "name" : "POJO" },
        { "name" : "JPA" }
      ],
    "title" : "A pragmatic scaffolding approach to build Java Web Applications in few minutes",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 634,
    "room" : "Room 8",
    "speaker" : "Alan Bateman",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/241",
    "speakers" : [ { "speaker" : "Alan Bateman",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/241"
        } ],
    "summary" : "JDK 7 provides a new and easy to use API to the file system that addresses many of the long standing issues and short comings that existed in previous releases. Finally the platform gets support for basic things such as file permissions, symbolic links, scalable access to large directories, bulk access to file attributes, methods to copy or move files, file change notification, path manipulation, an API for doing recursive operations and much more. This session will provide a tour of the API with examples to aid the busy developer quickly digest and appreciate the useful things that are now possible with JDK 7.",
    "tags" : [ { "name" : "JDK7" } ],
    "title" : "The File System API in JDK 7",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 640,
    "room" : "Room 4",
    "speaker" : "Andrey Breslav",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/861",
    "speakers" : [ { "speaker" : "Andrey Breslav",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/861"
        } ],
    "summary" : "Project Kotlin\" is the codename for a statically-typed object-oriented JVM-targeted programming language developed by JetBrains and intended for industrial use. \r\n\r\nThe main design goals behind this project are\r\n* to create a Java-compatible language,\r\n* that compiles at least as fast as Java,\r\n* make it safer than Java, i.e. statically check for common pitfalls such as null pointer dereference, etc., \r\n* make it more concise than Java by supporting variable type inference, higher-order functions (closures), extension functions, mixins and first-class delegation, etc;\r\n* and, keeping the useful level of expressiveness (see above), make it way simpler than the most mature competitor – Scala.\r\n\r\nIn this talk we present the key features of Kotlin and discuss the advantages of the language. \r\nWe will focus on type-safety guarantees and classes of errors common in Java that Kotlin eliminates.",
    "tags" : [ { "name" : "JVM" } ],
    "title" : "The Kotlin Programming Language",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 648,
    "room" : "Room 5",
    "speaker" : "Guilherme Silveira",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/123",
    "speakers" : [ { "speaker" : "Guilherme Silveira",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/123"
        },
        { "speaker" : "Lucas Cavalcanti",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1076"
        }
      ],
    "summary" : "Type safety is a desirable characteristic of both Java and Scala, but querying database objects in a type safe way in Java has always been clumsy. Scala helps us create type safe DSLs and this talk will go through how to use the Hibernate DSL api to create queries and criterias.\r\n\r\nNavigating between relationships is also improved both in Java and in Scala as functional programming style features\r\nare added to the APIs: now Hibernate's and JPAs lazy support becomes even stronger than its extra-lazy feature.\r\n\r\nThe session will show how to use the DSL in several examples and do a simple overview to show how the code is implemented behind the scenes.",
    "tags" : [ { "name" : "JPA2" },
        { "name" : "javaee" },
        { "name" : "scala" },
        { "name" : "Hibernate" },
        { "name" : "JPA" },
        { "name" : "DSL" }
      ],
    "title" : "Hibernate/JPA type safe query in Scala: an implicit help from the language",
    "track" : "New Languages on the JVM",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 664,
    "room" : "Room 6",
    "speaker" : "Dan Allen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244",
    "speakers" : [ { "speaker" : "Dan Allen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244"
        },
        { "speaker" : "Andrew Rubinger",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/7"
        }
      ],
    "summary" : "Fast, fast, fast. Blazing fast! No doubt, that's the main reason to love JBoss AS 7. This talk dispells a long-standing misconception that Java EE application servers are inherently slow. With AS 7, you get to keep more memory for your applications AND you experience a 10-fold reduction in startup time over previous revisions.\r\n\r\nIn this talk, we'll dive into how this performance boost has been achieved through a clever use of parallelism and concurrency, how its modular design saves you from classloader hell and why it's such a pleasure to administer. It's everything you've wanted in an application server: blazing fast startup, a lightweight footprint, completely modular, testable, elegant administration and multi-server management mode. Under all that is a server powered by first class components developed in the JBoss Community (JBoss Modules, Hibernate, Weld, RESTEasy, Infinispan, HornetQ, etc). It's even a (J)Ruby server!\r\n\r\nCome get your cake and eat it too.",
    "tags" : [ { "name" : "performance" },
        { "name" : "Testing" },
        { "name" : "multicore" },
        { "name" : "osgi" },
        { "name" : "javaee6" }
      ],
    "title" : "Death of the Slow: 7 Reasons to Love JBoss AS 7",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 667,
    "room" : "BOF 1",
    "speaker" : "Nicolas Leroux",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/39",
    "speakers" : [ { "speaker" : "Nicolas Leroux",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/39"
        },
        { "speaker" : "Nicolas Martignole",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1089"
        }
      ],
    "summary" : "The Play! framework is more than just yet another web framework in the Scala eco-system: it is also another way of developing web applications. Like RoR, Django, it encourages fast and expressive development, with a clean and pragmatic API. Most importantly, perhaps, it brings simplicity and fun to the Scala world. However, simplicity does not mean being limited to simple web applications. The framework gives you enough power to actually create just anything you can think of: with continuation, web socket support, asynchronous call it is one of the first framework to empower you. We will dive into details on how to use those features and realize that it is actually quite simple... Infinity and beyond are now reachable to Scala Web developers! In this presentation we will briefly see the main framework feature and live code a chat application with the help of HTML5 and websockets, but not any chat: A VIDEO chat room.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "scala" },
        { "name" : "websockets" },
        { "name" : "Play!" }
      ],
    "title" : "Let's Play! with Scala",
    "track" : "New Languages on the JVM",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 678,
    "room" : "BOF 1",
    "speaker" : "Dimitris Andreadis",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/999",
    "speakers" : [ { "speaker" : "Dimitris Andreadis",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/999"
        },
        { "speaker" : "Lincoln Baxter III",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/71"
        },
        { "speaker" : "Pete Muir",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295"
        },
        { "speaker" : "Aslak Knutsen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/166"
        },
        { "speaker" : "Andrew Rubinger",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/7"
        },
        { "speaker" : "Emmanuel Bernard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117"
        },
        { "speaker" : "Kabir Khan",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1031"
        },
        { "speaker" : "Manik Surtani",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/120"
        }
      ],
    "summary" : "JBoss Application Server 7 marks an important milestone in the development of the popular application server series. Besides its modular architecture JBoss AS 7 introduces a simplified configuration model and the ability to manage complex multi-server environments.\r\n\r\nCome to discuss the present and future of the JBoss Application Server project with members of the JBoss Core Development Team.",
    "tags" : [ { "name" : "jboss" },
        { "name" : "javaee6" }
      ],
    "title" : "JBoss Application Server 7 - Community BOF",
    "track" : "Java EE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 681,
    "room" : "BOF 2",
    "speaker" : "Filip Van Laenen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1004",
    "speakers" : [ { "speaker" : "Filip Van Laenen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1004"
        } ],
    "summary" : "This tutorial will give an introduction to Scalable Vector Graphics (SVG), a part of the HTML5 standard. It will start by placing SVG in the standards landscape, and how it compares to other imaging technologies. It will then present some of the tools and techniques to create SVG images manually or programmatically, and some pointers to libraries where SVG images can be found.\r\n\r\nAfter the introduction, the tutorial will continue as a code-along with exercises. The code-alongs, during which I will program an SVG file on-screen, will be used to introduce new concepts. Small exercises will be used to let the participants explore more of the concept, and experiment on their own.\r\n\r\nSubjects covered:\r\n• Overall document structure and basic concepts\r\n• Basic shapes\r\n• Text\r\n• Groups\r\n• Filling, stroke, markers\r\n• Color\r\n• Gradients, patterns\r\n• Animation\r\n\r\nParticipants should bring their laptop, but no other software than a browser (Firefox, Chrome, Opera, IE 9, ...) and a simple text editor are needed.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "XML" }
      ],
    "title" : "Introduction to Scalable Vector Graphics (SVG)",
    "track" : "Web",
    "type" : "Hands-on Labs"
  },
  { "experience" : "SENIOR",
    "id" : 682,
    "room" : "Room 5",
    "speaker" : "Costin Leau",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/37",
    "speakers" : [ { "speaker" : "Costin Leau",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/37"
        } ],
    "summary" : "The latest release of Spring Framework provides several features and improvements in next-generation application design. The session will give a practical tour of the new enhancements in Spring, exploring the environment profile mechanism, the new @Enable annotations for pure Java-based configurations, the declarative caching abstraction, the XML-free Servlet 3.0 and JPA support and the dedicated integration with the recently released Java 7.\r\n\r\nThe talk will focus on the role of Spring 3 as a modern annotation-oriented application framework in the world of RIA, Java EE 6, the upcoming EE 7 and the emerging technologies in the enterprise space.",
    "tags" : [ { "name" : "annotations" },
        { "name" : "REST" },
        { "name" : "Java7" },
        { "name" : "spring" },
        { "name" : "SpringMVC" },
        { "name" : "javaee6" }
      ],
    "title" : "Productivity Enhancements in Spring 3.1",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 683,
    "room" : "BOF 2",
    "speaker" : "Costin Leau",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/37",
    "speakers" : [ { "speaker" : "Costin Leau",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/37"
        },
        { "speaker" : "Stefan Schmidt",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/294"
        }
      ],
    "summary" : "The informal Spring BOF.",
    "tags" : [ { "name" : "spring" } ],
    "title" : "Spring BOF",
    "track" : "Architecture",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 686,
    "room" : "Room 6",
    "speaker" : "Max Andersen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/170",
    "speakers" : [ { "speaker" : "Max Andersen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/170"
        } ],
    "summary" : "OpenShift from Red Hat provides free and for-pay options to easily deploy and scale your existing PHP, Python, Ruby and even Java applications into a cloud based infrastructure.\r\n\r\nThis quickie will show you how to easy it is to setup, deploy and start developing on.",
    "tags" : [ { "name" : "cloud" },
        { "name" : "jboss" },
        { "name" : "javaee6" }
      ],
    "title" : "Deploy JEE applications to OpenShift",
    "track" : "Java EE",
    "type" : "Quickie"
  },
  { "experience" : "SENIOR",
    "id" : 692,
    "room" : "Room 7",
    "speaker" : "Michael Heinrichs",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008",
    "speakers" : [ { "speaker" : "Michael Heinrichs",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008"
        } ],
    "summary" : "Two of the most important and appreciated innovations of JavaFX Script were properties, and the ability to bind them to arbitrary expressions. In JavaFX 2.0 this functionality is provided by JavaFX Properties and the Binding API.\r\n\r\nIn this session we will take an in-depth look at properties, their functionality, and how you can define them in your own classes. We will take a look at the High Level Binding API, which provides a simple way to assemble binding expressions. The last section will cover the Low Level Binding API, which allows you to define your own arbitrary bindings, thus unleashing the full power of the Binding API. \r\n\r\nAfter this talk you will know everything there is to know about JavaFX 2.0 Properties and the Binding API.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "JavaFX Properties & Bindings for Experts (and those who want to become experts)",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 693,
    "room" : "Room 7",
    "speaker" : "Michael Heinrichs",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008",
    "speakers" : [ { "speaker" : "Michael Heinrichs",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008"
        },
        { "speaker" : "John Yoon",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1074"
        }
      ],
    "summary" : "Animation is an essential part of modern user interfaces. It can make an application much more fun and engaging. In addition, well-placed animation can help guide the user through the user interface, increasing overall usability.\r\n\r\nThis session takes an in-depth look at the animation API in JavaFX 2.0 and its possibilities. We will present techniques that can help add a little extra spice to the animation in your user interfaces.\r\n\r\nAfter this session, you will have a detailed knowledge of the animation API that is part of JavaFX 2.0, and you will have heard a number of ideas for improving the animation in your applications.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "Animation: Bringing your User Interfaces to Life",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 694,
    "room" : "Room 5",
    "speaker" : "Michael Heinrichs",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008",
    "speakers" : [ { "speaker" : "Michael Heinrichs",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1008"
        } ],
    "summary" : "The JavaFX 2.0 Binding API provides a convenient way to bind properties to complex expressions. The property will contain the result, if one of the operands of the expression changes, the property is updated automatically. The Binding API contains a lot of powerful functionality to define binding-expressions, but its full power is unleashed once you are able to write custom bindings and use them with the rest of the API.\r\n\r\nIn this lightning talk we will look at an implementation of a custom binding and discuss every aspect in detail. After this presentation you will know everything there is to know about writing custom bindings of your own.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "Complete guide to writing custom bindings in JavaFX 2.0",
    "track" : "Java SE",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 696,
    "room" : "Room 5",
    "speaker" : "Chris Aniszczyk",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/9",
    "speakers" : [ { "speaker" : "Chris Aniszczyk",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/9"
        },
        { "speaker" : "Matthias Sohn",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1010"
        }
      ],
    "summary" : "Many open source projects these days use Git or some other form of distributed version control. This presentation will take you through a brief introduction of Git with an emphasis on code review. We will introduce you to the code review tool Gerrit which was first used by the Android project but being used in a variety of places now, from commercial to open source areas. The authors will also share their experience deploying Git and Gerrit across large organizations such as eclipse.org and SAP. At the end of the presentation, attendees will walk away with improved knowledge of Git and how to effectively use Gerrit for code reviews.",
    "tags" : [ { "name" : "Git" },
        { "name" : "Tools" }
      ],
    "title" : "Code Review with Git and Gerrit",
    "track" : "Methodology",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 699,
    "room" : "Room 4",
    "speaker" : "Alex Miller",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/15",
    "speakers" : [ { "speaker" : "Alex Miller",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/15"
        } ],
    "summary" : "One of the greatest benefits of Clojure is its ability to create simple, powerful abstractions that operate at the level of the problem while also operating at the level of the language.  \r\n\r\nThis talk discusses a query processing engine built in Clojure that leverages this abstraction power to combine streams of data for efficient concurrent execution. The first part of the talk will discuss the representation and manipulation of query execution plans:\r\n* Representing processing trees as s-expressions\r\n* Streams as sequences of data\r\n* Optimizing processing trees by manipulating s-expressions\r\n\r\nThe second part will discuss simple and concurrent execution of query execution plans:\r\n* Direct execution of s-expression trees\r\n* Compilation of s-expressions into nodes and pipes\r\n* Concurrent processing nodes and pipes using a fork/join pool",
    "tags" : [ { "name" : "Fork/Join" },
        { "name" : "Clojure" }
      ],
    "title" : "Stream Execution with Clojure and Fork/Join",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 703,
    "room" : "BOF 1",
    "speaker" : "Adrian Cole",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/254",
    "speakers" : [ { "speaker" : "Adrian Cole",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/254"
        },
        { "speaker" : "Andrew Phillips",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/937"
        }
      ],
    "summary" : "You may have heard about cloud storage offerings such as Amazon S3, OpenStack or Microsoft Azure.  While conceptually similar, these offerings have different apis and behaviour that place the \"write once (run|test) anywhere\" mantra at risk. The jclouds open source java and clojure library aims to eliminate cloud vendor lock-in, exposing easy to use, portable, and powerful APIs.  Bring your laptop, armed with latest revs of Eclipse, git, and maven, and we'll walk through getting you setup to hack jclouds java or clojure BlobStore applications in a collaborative fashion.",
    "tags" : [ { "name" : "cloud" } ],
    "title" : "Hands on Cloud Storage",
    "track" : "Architecture",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 704,
    "room" : "Room 9",
    "speaker" : "Adrian Cole",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/254",
    "speakers" : [ { "speaker" : "Adrian Cole",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/254"
        } ],
    "summary" : "Key/value stores are the most common storage offerings in the cloud today.  While conceptually similar, BlobStores present different programming models and consistency models that must be considered in application design.  After this session, you'll understand these differences, and know how to use jclouds to avoid cloud lock-in and increase testability without restricting access to cloud-specific features.\r\n\r\nWe'll start by comparing public cloud services like Amazon S3 or Microsoft Azure and private cloud software like OpenStack Swift or Eucalyptus Walrus from a feature and code/API level.  We'll then review java and clojure calls to the open source jclouds BlobStore API, abstracting away these differences.  We'll finish with a review of integration patterns in production today you can consider while designing your cloud architecture.",
    "tags" : [ { "name" : "cloud" } ],
    "title" : "Portable Cloud Storage with jclouds",
    "track" : "Architecture",
    "type" : "Tools in Action"
  },
  { "experience" : "EXPERT",
    "id" : 705,
    "room" : "Room 9",
    "speaker" : "Michael Barker",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/62",
    "speakers" : [ { "speaker" : "Michael Barker",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/62"
        } ],
    "summary" : "LMAX (http://www.lmaxtrader.com) has open-sourced a framework which can give 4-10X throughput improvements over what is available in java.util.concurrent.*. The currently libraries, particularly queue implementations, did not allow LMAX to build a financial exchange capable of >100K TPS with less than 1ms latency. It was not possible to get predictable latency, or sufficient throughput, using lock-based data structures. The first part of this session covers the design of the LMAX Disruptor framework using lock-free data structures and an understanding of modern CPUs.  The second part will will be a live coding session demonstrating how to use the Disruptor.",
    "tags" : [ { "name" : "javase" },
        { "name" : "multicore" }
      ],
    "title" : "The Disruptor, High Performance Inter-Thread Messaging",
    "track" : "Java SE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 708,
    "room" : "Room 9",
    "speaker" : "George Reese",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/153",
    "speakers" : [ { "speaker" : "George Reese",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/153"
        } ],
    "summary" : "Dasein Cloud is an Open Source cloud abstraction API for Java designed around the same principles behind JDBC. This session is an introduction to the API and shows how to write once and run against any cloud. It addresses provisioning, de-provisioning, and managing all kinds of cloud infrastructure and platform elements from within Java code.",
    "tags" : [ { "name" : "cloud" } ],
    "title" : "Dasein Cloud: The JDBC for Cloud Programming",
    "track" : "Architecture",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 711,
    "room" : "Room 4",
    "speaker" : "Hirotsugu Asari",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/877",
    "speakers" : [ { "speaker" : "Hirotsugu Asari",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/877"
        } ],
    "summary" : "Java developers wear a lot of hats these days: they manage builds, develop applications, write command-line scripts, and must master all tiers. If only there were a way to make these tasks simple and fun.\r\n\r\nEnter JRuby.\r\n\r\nBuild engineers can write or enhance builds with Ruby, never losing a thing they depend on from Ant or Maven. Ruby offers several elegant testing options that work great with JRuby. Web developers can create Rails applications in minutes, effortlessly incorporating the latest Web technologies while taking advantage of the existing Java libraries. JRuby supports binding native libraries with FFI (foreign function interface). Command-line scripts? They're easy with JRuby's system-level features.\r\n\r\nCome to this session to learn how JRuby makes you a happy developer.",
    "tags" : [ { "name" : "Testing" },
        { "name" : "jruby" },
        { "name" : "polyglot" },
        { "name" : "Maven" },
        { "name" : "Rails" }
      ],
    "title" : "JRuby: Enhancing Java Developers' Lives",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 712,
    "room" : "BOF 2",
    "speaker" : "Hirotsugu Asari",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/877",
    "speakers" : [ { "speaker" : "Hirotsugu Asari",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/877"
        } ],
    "summary" : "This is the JRuby BOF session.\r\n\r\nWe will facilitate communication among JRuby users worldwide by gathering them in one room.\r\n\r\n* Welcome new JRuby users to the community.\r\n* Provide a platform for JRuby users to share their successes with their peers.\r\n* As a JRuby committer, I would like to hear from the end user what successes JRuby users have had, and what areas JRuby should improve to make it even more useful for them.",
    "tags" : [ { "name" : "jruby" },
        { "name" : "polyglot" },
        { "name" : "Maven" },
        { "name" : "web20" },
        { "name" : "Rails" }
      ],
    "title" : "JRuby Birds of a Feather",
    "track" : "New Languages on the JVM",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 714,
    "room" : "BOF 2",
    "speaker" : "Dan Allen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244",
    "speakers" : [ { "speaker" : "Dan Allen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244"
        } ],
    "summary" : "The annual informal, yet always eventful, gathering of the Seam community to talk about the current status, migration, future direction and anything else that comes along.",
    "tags" : [ { "name" : "seam" },
        { "name" : "javaee6" }
      ],
    "title" : "Seam Gathering",
    "track" : "Java EE",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 719,
    "room" : "Room 8",
    "speaker" : "Geertjan Wielenga",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/208",
    "speakers" : [ { "speaker" : "Geertjan Wielenga",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/208"
        } ],
    "summary" : "With JDK 7, you're going to be coding in new & different ways. What are those ways, exactly, and do you have the appropriate applications in your toolbox? In this session, you'll be taken on a tour of all the tools that have been adapted for usage with JDK 7. You'll see demos highlighting the steps you'll need to take to migrate your code, a procedure will be outlined for doing so, and you'll see all the tools you'll need in action!",
    "tags" : [ { "name" : "Tools" } ],
    "title" : "What's In Your Toolbox for JDK 7?",
    "track" : "Java SE",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 734,
    "room" : "Room 6",
    "speaker" : "Jevgeni Kabanov",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/142",
    "speakers" : [ { "speaker" : "Jevgeni Kabanov",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/142"
        } ],
    "summary" : "Email overload for developers can be so aggravating that we spend hours every week just figuring out which emails can be safely ignored. At ZeroTurnaround we use Twitter to keep tabs on the product, app, team and business activity using an OSS solution/approach.  It took us less than a week to put it together and it improved background communication sharing and helped spike conversations. Twaves has stopped several failures from happening already, and we’d like to share our experience and code so that you could deploy a similar solution in less than two days.",
    "tags" : [ { "name" : "Twitter" } ],
    "title" : "Too much email? Track your project, app and team with Twitter!",
    "track" : "Methodology",
    "type" : "Quickie"
  },
  { "experience" : "NOVICE",
    "id" : 741,
    "room" : "Room 6",
    "speaker" : "Richard Bair",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264",
    "speakers" : [ { "speaker" : "Richard Bair",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264"
        },
        { "speaker" : "Jasper Potts",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/317"
        }
      ],
    "summary" : "JavaFX 2.0 reboots the Java rich client story by bringing the graphics, animation, controls, layouts, styling, tools, and developer productivity developed over the past three years to the Java community. A significant refresh, JavaFX 2.0 delivers a full set of Java APIs for building GUIs in Java. Redesigned to appeal to Java and web developers, supporting alternative languages on the JVM, and for multiple deployment environments and operating systems. This session will describe in detail APIs and capabilities of this new rich client platform, discussing topics such as threading, performance, layout, controls, tools, styling, deployment, and more.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "Java Rich Clients with JavaFX 2.0",
    "track" : "Java SE",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 743,
    "room" : "Room 5",
    "speaker" : "Sven Peters",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/841",
    "speakers" : [ { "speaker" : "Sven Peters",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/841"
        } ],
    "summary" : "Once upon a time there was a green field project with fresh new technologies and well written source code. But some month or years later the code doesn’t look that fancy anymore. New features have been added, some rock star programmers have left the team for a new shiny project and a lot of bugs have just been fixed in a fast and dirty way.\r\n\r\nThis talk will show why code has the tendency to get messy over time and what to do about it. You will learn some clean code techniques and how to use them on a day to day basis! Get back the fun into your maintenance project!",
    "tags" : [ { "name" : "agile" } ],
    "title" : "When code gets older – Tips for keeping maintenance projects alive and kicking",
    "track" : "Methodology",
    "type" : "Quickie"
  },
  { "experience" : "SENIOR",
    "id" : 745,
    "room" : "Room 7",
    "speaker" : "Richard Bair",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264",
    "speakers" : [ { "speaker" : "Richard Bair",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264"
        } ],
    "summary" : "As professional software engineers, we like to take things apart and put them back together. In this technical session we will describe and dissect the inner workings and architecture of JavaFX 2.0, covering topics such as properties, threading, rendering, porting to other platforms, and web integration.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "JavaFX Under The Hood",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 748,
    "room" : "Room 7",
    "speaker" : "Richard Bair",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264",
    "speakers" : [ { "speaker" : "Richard Bair",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264"
        },
        { "speaker" : "Jasper Potts",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/317"
        }
      ],
    "summary" : "With the release of JavaFX 2.0 several real-world JavaFX applications were also released with the SDK, including Ensemble and Artifex as BSD to encourage discovery of how to build real world JavaFX applications. In this session we will describe the patterns and practicalities when developing Java rich clients with the JavaFX platform, including how to get started, basic concepts and idioms, developer / designer workflow, and more.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "Practical Experience Building JavaFX Rich Clients",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 762,
    "room" : "BOF 1",
    "speaker" : "Richard Bair",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264",
    "speakers" : [ { "speaker" : "Richard Bair",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264"
        },
        { "speaker" : "Jasper Potts",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/317"
        }
      ],
    "summary" : "Its an open mic with the JavaFX architects at Devoxx. We will present some of the strategy and rationale behind JavaFX 2.0, as well as answer any questions you may have.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "JavaFX Open Mic",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 764,
    "room" : "BOF 1",
    "speaker" : "Richard Bair",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264",
    "speakers" : [ { "speaker" : "Richard Bair",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/264"
        },
        { "speaker" : "Jasper Potts",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/317"
        }
      ],
    "summary" : "Come try out the new JavaFX 2.0. Download the SDK and write your first JavaFX apps. You can try your own experiments, or one of ours and we'll help guide you through using the platform.",
    "tags" : [ { "name" : "javafx" } ],
    "title" : "JavaFX 2.0 Hands On",
    "track" : "Java SE",
    "type" : "Hands-on Labs"
  },
  { "experience" : "SENIOR",
    "id" : 767,
    "room" : "Room 5",
    "speaker" : "Jan Lahoda",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1024",
    "speakers" : [ { "speaker" : "Jan Lahoda",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1024"
        },
        { "speaker" : "Anton Chechel",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1021"
        }
      ],
    "summary" : "Many projects suffer when an upgrade to a new version of a library is needed. Such upgrades would be much easier if usages of deprecated methods would be replaced automatically. The Jackpot 3.0 project comes to help in such cases. It allows to specify refactorings using a domain specific language with Java-like syntax and apply these refactorings on vast amounts of code. It can be also used to perform one-off refactorings, corrections of common anti-patterns and structural search.\r\n\r\nIntended Audience: people working on mid size to large java systems, tech leads, library developers, managers.",
    "tags" : [ { "name" : "javase" } ],
    "title" : "Jackpot 3.0 - Large scale custom refactorings made easy",
    "track" : "Java SE",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 771,
    "room" : "BOF 2",
    "speaker" : "Nikolche Mihajlovski",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/111",
    "speakers" : [ { "speaker" : "Nikolche Mihajlovski",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/111"
        } ],
    "summary" : "JAnnocessor is a new open-source framework for powerful, flexible, yet easy annotation-driven source code generation. It is built on top of Java APT, encapsulating the Java source code model in a rich and convenient high-level domain model that serves as a good target for expressive matching and transformation. Finally, a template engine is used for customizable source code generation. Having simplicity and productivity in mind, JAnnocessor offers many features that make it enjoyable: smart imports organization, logging delegation, graphical UI for real-time debug, hot swap of processors and templates, as well as out-of-the-box common annotations, processors and templates.\nIn this talk, the author of JAnnocessor will show you how easily you can boost your productivity by simply annotating your code to generate: domain model, builders, DAOs, services, facades, DTOs, mappers, views, etc. The customization of annotations, patterns and templates will also be covered, so you will be able to generate anything!\n",
    "tags" : [ { "name" : "annotations" } ],
    "title" : "JAnnocessor - Innovative Annotation-Based Code Generator",
    "track" : "Methodology",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 772,
    "room" : "Room 5",
    "speaker" : "Dick Wall",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/272",
    "speakers" : [ { "speaker" : "Dick Wall",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/272"
        },
        { "speaker" : "Carl Quinn",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/297"
        },
        { "speaker" : "Tor Norbye",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062"
        },
        { "speaker" : "Joe Nuxoll",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/298"
        }
      ],
    "summary" : "Join the Java Posse as we record a situation report live from Devoxx 2011. The usual elements will be included: banter, geek humour, the Spanish inquisition, some Java news, beer, fun!",
    "tags" : [ { "name" : "javase" } ],
    "title" : "Java Posse Live",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 773,
    "room" : "BOF 2",
    "speaker" : "Arun Gupta",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/23",
    "speakers" : [ { "speaker" : "Arun Gupta",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/23"
        } ],
    "summary" : "The Java EE 6 platform allows you to write enterprise Java applications using much lesser code from its earlier versions. It breaks the “one size fits all” approach with Profiles and extensively improves on the Java EE 5 developer productivity features. Several specifications like CDI, JSF 2, EJB 3.1, JAX-RS, JPA 2, Servlets 3, and Bean Validation make the platform more powerful. It also enables extensibility by embracing open source libraries and frameworks such that they are treated as first class citizens of the platform. NetBeans, Eclipse, and IntelliJ provide extensive tooling for Java EE 6. This hands-on lab builds a complete end-to-end application using all different technologies of Java EE 6 with NetBeans. You'll learn the tips and tricks to be more effective in your development and deployment cycles. And you'll also learn how to monitor your Java EE 6 applications more effectively. A quick preview of Eclipse and IntelliJ tooling will also be shown.",
    "tags" : [ { "name" : "Glassfish" },
        { "name" : "javaee6" }
      ],
    "title" : "Building an end-to-end application using Java EE 6 and NetBeans",
    "track" : "Java EE",
    "type" : "Hands-on Labs"
  },
  { "experience" : "SENIOR",
    "id" : 775,
    "room" : "Room 4",
    "speaker" : "Dick Wall",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/272",
    "speakers" : [ { "speaker" : "Dick Wall",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/272"
        } ],
    "summary" : "We all experience the desire to better ourselves. However, deadlines, accountability, mixed ability teams, and a level of maturity in Object Oriented Development, and more specifically in the Java language, have led to a conservative approach to software development where risks are largely frowned upon, engineers and managers tend to stick with what they know, and bettering oneself often means arguing over best practices or concentrating on the details of our trade, the software craftsmanship movement is an example of this. \r\n\r\nThis approach also leads to wasted effort, wasted engineers and wasted opportunities. Writing a new web or app framework is predictable, and often easily justified. It's also often a misguided effort, and we will discuss why. \r\n\r\nThis talk will present a different viewpoint, based on careful courage as opposed to risk aversion at all costs, aimed at moving the world forward rather than avoiding failure to meet a deadline. It was first presented as the opening keynote for DevNexus 2011.",
    "tags" : [ { "name" : "Methodology" } ],
    "title" : "Courage in Software Development",
    "track" : "Methodology",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 787,
    "room" : "BOF 2",
    "speaker" : "nicolas loof",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/998",
    "speakers" : [ { "speaker" : "nicolas loof",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/998"
        } ],
    "summary" : "Open Meeting for Jenkins developers, contributors and users to exchange about Jenkins state & future.\r\nDevoxx attracts a lot of people from all over the world, and this BOF session would like to welcome all the users and developers from the Jenkins community to discuss where we are and what we should be working on. The BOF highlights various efforts from the community and includes a Q&A period.",
    "tags" : [ { "name" : "Hudson" },
        { "name" : "FOSS" }
      ],
    "title" : "Jenkins user meeting",
    "track" : "Methodology",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 813,
    "room" : "Room 8",
    "speaker" : "Olivier Gaudin",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1032",
    "speakers" : [ { "speaker" : "Olivier Gaudin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1032"
        } ],
    "summary" : "Continuous Inspection is an emerging practice to manage source code quality. This practice has a single objective : keep the technical debt associated to source code under control throughout time.\r\n\r\nThe requirements relate to unit tests, duplications, complexity, design, coding standards... \r\nIn this workshop, you will learn how to use Sonar and its ecosystem of plugins to support this practice.",
    "tags" : [ { "name" : "analysis" } ],
    "title" : "Continuous Inspection with Sonar",
    "track" : "Methodology",
    "type" : "Tools in Action"
  },
  { "experience" : "SENIOR",
    "id" : 820,
    "room" : "Room 7",
    "speaker" : "Patrycja Wegrzynowicz",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/136",
    "speakers" : [ { "speaker" : "Patrycja Wegrzynowicz",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/136"
        } ],
    "summary" : "Hibernate is an elegant, straightforward, and easy to use library. This is undeniably true for simple domain models. What about more complex ones? It turns out that in case of complex domain models we usually run into interesting performance issues.\r\n\r\nThis talk discusses performance anti-patterns on both levels the code of hibernate itself as well as the usage of hibernate in custom applications. First, we present several places in hibernate code that negatively impact performance of object-relational mappings. Then, we explain common mistakes or omissions related to mappings of complex structures. The focus is on efficient retrieval of collections and their sub-objects along with fetching strategies and efficient queries. The presented real code examples illustrate how the anti-patterns can decrease performance and how to implement the mappings to speed up execution times.",
    "tags" : [ { "name" : "performance" },
        { "name" : "Hibernate" }
      ],
    "title" : "Performance Anti-Patterns in Hibernate",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 836,
    "room" : "Room 7",
    "speaker" : "Stephen Chin",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/98",
    "speakers" : [ { "speaker" : "Stephen Chin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/98"
        },
        { "speaker" : "Kevin Nilson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1060"
        }
      ],
    "summary" : "The Web revolution has moved logic from the server to the client. Advanced applications are now utilizing technologies such as JavaFX and HTML5 to build immersive customer experiences for consumer and enterprise markets. This session explains how to utilize the features and capabilities of the JavaFX 2.0 platform and the latest HTML5 advances.\r\n\r\nIn this session we will cover the new JavaFX 2.0 release which includes pure Java APIs, Swing integration, an an embeddable browser component. We will also showcase HTML5 technologies such as jQuery and WebGL. To bring these technologies together we will show an interactive example of JavaFX 2.0 and HTML5 content working together to create a unified application.",
    "tags" : [ { "name" : "javafx" },
        { "name" : "HTML5" },
        { "name" : "jQuery" },
        { "name" : "javascript" },
        { "name" : "GUI" }
      ],
    "title" : "Moving to the Client - JavaFX and HTML5",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 837,
    "room" : "Room 6",
    "speaker" : "Stephen Chin",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/98",
    "speakers" : [ { "speaker" : "Stephen Chin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/98"
        },
        { "speaker" : "Peter Pilgrim",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1106"
        }
      ],
    "summary" : "JavaFX 2.0 is the future of RIA development. It takes the power of a modern scene graph, adds rich animation and multimedia capabilities, and extends to the web and beyond with seamless portability. At the same time, it leverages the power and breadth of the Java language and platform, allowing full access to existing Java libraries and integration with Java client technologies like Swing.\r\n\r\nThis session will introduce you to the JavaFX 2.0 platform from the perspective of a seasoned Java developer. The breadth of JavaFX APIs will be explained through several examples that we will build out during the course of the session.\r\n\r\nIf you have heard about JavaFX before, but were not sure about taking the plunge, now is the time to see what you have been missing out on.",
    "tags" : [ { "name" : "javafx" },
        { "name" : "Swing" },
        { "name" : "RIA" },
        { "name" : "GUI" }
      ],
    "title" : "JavaFX 2.0 - A Java Developer's Guide",
    "track" : "Java SE",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 858,
    "room" : "Room 5",
    "speaker" : "Greg Luck",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/380",
    "speakers" : [ { "speaker" : "Greg Luck",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/380"
        },
        { "speaker" : "Ludovic Orban",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1061"
        }
      ],
    "summary" : "In this session Greg Luck, founder of Ehcache and spec lead for JSR107, will walk you through this new caching standard that is important part of Java EE 7. You will learn how to:\r\n\r\nAbstract your caching implementation much like JDBC \r\nUse the rich and modern API\r\nUse the new caching annotations\r\nUse the API before Java EE 7 is released with in the Java SE, Java EE 6 and Spring environments\r\nApply JCache to common caching scenarios",
    "tags" : [ { "name" : "caching" } ],
    "title" : "JSR107—What the New Java Caching Standard Has in Store For You",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 862,
    "room" : "Room 9",
    "speaker" : "Fabrizio Giudici",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/229",
    "speakers" : [ { "speaker" : "Fabrizio Giudici",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/229"
        } ],
    "summary" : "Android has got its own \"official\" build tools, provided by Google. They are good for a quickstart, but what happens when you engage with a larger application? What about your software factory practices, such as Continuous Integration, static analysis, test coverage? A possibile solution is to use Maven: just set up your Android project like any other Java project you manage with Maven. The maven-android-plugin provides whatever you need for creating and testing Android apps - and you'll be able to use your favourite IDE (Eclipse, NetBeans, IDEA).\r\n\r\nThe talk will quickly introduce some Maven concepts, then move on to describe the maven-android-plugin. Some practical examples about how to build a complex, modular Android app will be given, based on the experience of the author with an open source application, completely managed with a state-of-the-art software factory featuring Hudson, Cobertura, automatic release and so on.",
    "tags" : [ { "name" : "Maven" },
        { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Building Android apps with Maven",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 866,
    "room" : "Room 5",
    "speaker" : "Dion Almaer",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/290",
    "speakers" : [ { "speaker" : "Dion Almaer",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/290"
        },
        { "speaker" : "Ben Galbraith",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/291"
        }
      ],
    "summary" : "Today's browsers sport amazing capabilities, truly graduating from markup renderers to sophisticated app run-times. We're sure to see some amazing new web applications just over the horizon that take advantage of these new capabilities. At the same time, the mobile ecosystem is white hot and we're seeing a range of start-ups pursue an \"app-only\" strategy. What relationship do mobile \"apps\" have with the web and how will these two communities co-exist into the future? Also, how do developers target all of these different platforms? Which should they embrace and which should they ignore? Join Ben and Dion as they explore these issues.",
    "tags" : [ { "name" : "HTML5" } ],
    "title" : "Web vs. Apps",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 868,
    "room" : "Room 5",
    "speaker" : "Brian LeRoux",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1063",
    "speakers" : [ { "speaker" : "Brian LeRoux",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1063"
        } ],
    "summary" : "There's a storm brewing between Web-based and native app developers\r\nand it's time to pick a side... or is it? In this session, Brian\r\nLeRoux will show how a hybrid approach to mobile app development\r\nspeeds up and improves the native development process. He'll\r\ndemonstrate the benefits of prototyping with HTML, CSS and JavaScript;\r\nhe'll compare Web-based and native app development pitfalls; and he'll\r\nshare top tips for building successful hybrid apps that marry native\r\ncode with the web.\r\n\r\nUsing the PhoneGap open source framework, Brian will also demonstrate\r\nhow to work with native extensions using platform features, and will\r\nshow you how to turn a w3c widget into a native app for 6 platforms in\r\n5 minutes or less. Join Brian to learn how you can reduce app\r\ndevelopment headaches by going hybrid!",
    "tags" : [ { "name" : "iPhone" },
        { "name" : "javascript" },
        { "name" : "blackberry" },
        { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "PhoneGap for Hybrid App Development",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 869,
    "room" : "Room 8",
    "speaker" : "Joe Darcy",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/282",
    "speakers" : [ { "speaker" : "Joe Darcy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/282"
        },
        { "speaker" : "Maurizio Cimadamore",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/326"
        }
      ],
    "summary" : "Project Coin is a suite of language and library changes to make things programmers do everyday easier.\nThe language changes introduced in JDK 7 include:\n\n* binary literals\n* strings in switch\n* try-with-resources\n* diamond operator\n* multi-catch with final rethrow\n* safe varargs annotation\n\nThis talk will provide a comprehensive retrospect of the language  features added in JDK 7, with particular focus on design constraints,  design/testing methodologies, compiler implementation strategies and  unexpected language feature interactions. Additionally, the possible  inclusion of further small languages changes in JDK 8 (or later) will also be discussed.",
    "tags" : [ { "name" : "javase" },
        { "name" : "JDK7" },
        { "name" : "JDK8" }
      ],
    "title" : "The Heads and Tails of Project Coin",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 870,
    "room" : "Room 9",
    "speaker" : "James Williams",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/114",
    "speakers" : [ { "speaker" : "James Williams",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/114"
        } ],
    "summary" : "There was once a time where gaming in the browser meant Flash and the canvas was something that artists used. That time is no more. HTML5 has quickly blazed a trail from being an Internet curiosity to a viable platform for creating games. The canvas tag, capable of rendering 2D and 3D, is quickly becoming an alternative to Flash. Hardware accelerated rendering as provided in WebGL closes the gap between HTML5 and native games. HTML5 also includes new audio and video tags allow you to create a more immersive experience.\n\nIn this session, you'll learning the basics of game programming and Canvas(2D), WebGL, and SVG which are the most common rendering technologies to create HTML5 games. We will also cover the tools and utilities that make programming easier as well as some popular game libraries and deployment strategies.",
    "tags" : [ { "name" : "HTML5" } ],
    "title" : "Intro to HTML5 Game Development",
    "track" : "Web",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 872,
    "room" : "Room 5",
    "speaker" : "Martin Odersky",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/304",
    "speakers" : [ { "speaker" : "Martin Odersky",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/304"
        } ],
    "summary" : "Tba",
    "tags" : [ { "name" : "scala" } ],
    "title" : "Scala Update",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 873,
    "room" : "Room 8",
    "speaker" : "Jerome Dochez",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/50",
    "speakers" : [ { "speaker" : "Jerome Dochez",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/50"
        } ],
    "summary" : "In this session, we will present the efforts to bring cloud computing both to the Java EE platform specifications and to the Reference Implementation (GlassFish). Whether you are looking to use an internal cloud deployment or leverage a public Java EE PAAS offering, applications will need to be modified to be able to leverage multi-tenancy, automatic provisioning and deployment elasticity. Although these modifications are expected to be an evolution of the Java EE APIs, this session will provide a concise view of the complete changes and how it relates to an application server like GlassFish. To help see the forthcoming features, we will demonstrate how the Java EE developer experience will be impacted in terms of Java EE components programming as well as development/runtime environments.",
    "tags" : [ { "name" : "Glassfish" },
        { "name" : "javaee" },
        { "name" : "cloud" }
      ],
    "title" : "Pragmatic Cloud and PaaS with Java EE 7 (and GlassFish)",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 877,
    "room" : "Room 7",
    "speaker" : "Cambell Murray",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1069",
    "speakers" : [ { "speaker" : "Cambell Murray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1069"
        } ],
    "summary" : "This talk will go into practical demonstrations on the dangers of XSS and some of the open source frameworks available to both black and white hat hackers out there today.  Prepare to leave this talk scared.",
    "tags" : [ { "name" : "security" } ],
    "title" : "Meh!  It's only cross site scripting what's the big deal?",
    "track" : "Security",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 878,
    "room" : "Room 6",
    "speaker" : "Chet Haase",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129",
    "speakers" : [ { "speaker" : "Chet Haase",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129"
        },
        { "speaker" : "Romain Guy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/132"
        },
        { "speaker" : "Philip Milne",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1221"
        }
      ],
    "summary" : "Come hear Romain Guy and Chet Haase from the Android team at Google as they explore techniques for creating great Android applications. This talk will also cover the latest developments in the Android SDK.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Android Awesomeness",
    "track" : "Mobile",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 879,
    "room" : "Room 9",
    "speaker" : "Chet Haase",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129",
    "speakers" : [ { "speaker" : "Chet Haase",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129"
        },
        { "speaker" : "Romain Guy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/132"
        },
        { "speaker" : "Philip Milne",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1221"
        }
      ],
    "summary" : "This talk will cover techniques for making UIs your users will love. From reasonable layout decisions to performance techniques to useful animations, this talk will cover tips to help you make better Android applications.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Sticky GUIs",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 880,
    "room" : "Room 5",
    "speaker" : "Chet Haase",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129",
    "speakers" : [ { "speaker" : "Chet Haase",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129"
        },
        { "speaker" : "Romain Guy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/132"
        }
      ],
    "summary" : "Come hear about the latest features in the Android platform for writing great graphics applications. From GPU acceleration to Renderscript to layers, Android continues to offer great graphics goodies for developers.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Graphics Goodies in Android",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 890,
    "room" : "Room 8",
    "speaker" : "Nigel Deakin",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1071",
    "speakers" : [ { "speaker" : "Nigel Deakin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1071"
        },
        { "speaker" : "Masoud Kalali",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/26"
        }
      ],
    "summary" : "JMS is a key part of Java EE, despite its not having been updated since 2002. There is therefore no shortage  of ideas for updating it, which is why in 2011 the JMS community has come together in JSR 343 to define JMS 2.0. JMS 2.0  will define new facilities to support Java EE 7 and the needs of the cloud. It will also include features to improve  ease of use, updates to clarify the relationship with other Java EE specifications, a mandatory API for integration with  application servers, and many other changes that that have been proposed following nearly a decade of use. Come and hear what is in the early draft of JMS 2.0, and join the subsequent discussion.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "JMS" }
      ],
    "title" : "What's Coming in Java Message Service 2.0",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 891,
    "room" : "Room 8",
    "speaker" : "Mark Reinhold",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279",
    "speakers" : [ { "speaker" : "Mark Reinhold",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279"
        } ],
    "summary" : "tba",
    "tags" : [ { "name" : "JDK7" },
        { "name" : "openjdk" },
        { "name" : "JDK8" }
      ],
    "title" : "JDK 7, 8 and 9",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 895,
    "room" : "Room 8",
    "speaker" : "Andrew Swan",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1064",
    "speakers" : [ { "speaker" : "Andrew Swan",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1064"
        },
        { "speaker" : "James Tyrrell",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1065"
        }
      ],
    "summary" : "Getting the most of out the time spent building applications is important to every developer, and with Spring Roo, being ultra productive is easy. Join us as we show you how you can improve your Java productivity and quality today by using Spring Roo, and enjoy a preview of how Spring Roo’s next major release will make this even more compelling.\r\n\r\nIn this demonstration-focused presentation we will cover:\r\n\t•\tScaffolded UIs using frameworks like JSF, Google Web Toolkit (GWT) and Spring MVC\r\n\t•\tTransparently reverse-engineering and synchronizing changing database schema\r\n\t•\tSupport for Java standards such as JPA, Servlets, JSP, JSF, JavaBean, JMS, JavaMail, Bean Validation and MORE!\r\n\t•\tRemoving Roo from your project in four clicks\r\n\t•\tUpcoming features in Spring Roo 1.2, including service and repository layers, JSF support etc\r\n\r\nPresented by Spring Roo engineers Andrew Swan and James Tyrrell, come and learn how Spring Roo can simplify development and help take your productivity to the next level.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "ROO" }
      ],
    "title" : "Spring Roo: Instant Productivity",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 896,
    "room" : "BOF 1",
    "speaker" : "Stephan Janssen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/2",
    "speakers" : [ { "speaker" : "Stephan Janssen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/2"
        } ],
    "summary" : "The annual Java User Group leaders networking BOF",
    "tags" : [ { "name" : "JUG" },
        { "name" : "bejug" }
      ],
    "title" : "The annual Java User Group BOF",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 897,
    "room" : "Room 9",
    "speaker" : "Tor Norbye",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062",
    "speakers" : [ { "speaker" : "Tor Norbye",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062"
        },
        { "speaker" : "Xavier Ducrohet",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1079"
        }
      ],
    "summary" : "This talk provides an in-depth look at the Android development tools, along with tips & tricks for getting the most out of them. From project support, to source editing and visual editors, to emulator execution and debugging and profiling, this talk will help you get more productive with Android development. The main focus is on Eclipse, but we will discuss other complementary tools as well. This is a demo-oriented talk, and our goal is to show the available features, and how they fit into the workflow.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" },
        { "name" : "Tools" }
      ],
    "title" : "Android Development Tools",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 898,
    "room" : "Room 6",
    "speaker" : "Tor Norbye",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062",
    "speakers" : [ { "speaker" : "Tor Norbye",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062"
        },
        { "speaker" : "Xavier Ducrohet",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1079"
        }
      ],
    "summary" : "This talk provides a quick introduction to and demo of the Android development processs, showing how to create, edit, build and debug Android phone and tablet applications, and how to analyze memory and performance issues.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" },
        { "name" : "Tools" }
      ],
    "title" : "Android Tools in Action",
    "track" : "Mobile",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 899,
    "room" : "Room 8",
    "speaker" : "Patrick Chanezon",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/870",
    "speakers" : [ { "speaker" : "Patrick Chanezon",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/870"
        },
        { "speaker" : "Guillaume Laforge",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/6"
        },
        { "speaker" : "Ludovic Champenois",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/195"
        }
      ],
    "summary" : "There is a profound architecture transition happening in software in 2011, like we see every 15 years: html5 browsers and powerful mobile platforms (android, iphone) bring new capabilities on the client side of apps, and the switch from vertical to horizontal scalability gave birth to powerful cloud platforms that allow fast development of scalable backends.\r\n\r\nThis talk will focus on the server side, explaining the opportunities and challenges that the Cloud represents for developers, in 4 areas: Delivery/Monetization/Marketing, Infrastructure, Platform and Development.\r\n\r\nI will give an overview of several product and services in these areas: Amazon (AWS, Beanstalk), Google (App Engine), Joyent (Node.js), Salesforce (Heroku), VMWare (Cloud Foundry), GitHub, Cloudbees, Exo, Cloud9, Eclipse Orion.\r\n\r\nThe Cloud is an opportunity for developers to embrace agility and change, reinvent themselves, make money and have fun. It's time to start building your dreams on it!",
    "tags" : [ { "name" : "google" },
        { "name" : "Amazon" },
        { "name" : "cloud" }
      ],
    "title" : "Cloud is such stuff as dreams are made on",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 900,
    "room" : "Room 5",
    "speaker" : "Neil Richards",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1070",
    "speakers" : [ { "speaker" : "Neil Richards",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1070"
        } ],
    "summary" : "It's been a year since IBM and Oracle announced their intention to collaborate in the OpenJDK community to develop the leading open source Java environment. This talk will outline the progress of that collaboration and review the continuing challenges and opportunities ahead. IBM brings long and extensive experience with Java - hear about IBM's unique perspective on what makes Java successful and how that success can be maintained and improved within the OpenJDK community. \r\n\r\nIts not all talk - details of IBM's contribution to OpenJDK and Java SE will be also be covered, including such topics as the technical challenges faced in sharing technology and how the solutions benefit both the OpenJDK community and Java SE.",
    "tags" : [ { "name" : "JDK7" },
        { "name" : "openjdk" },
        { "name" : "JDK8" }
      ],
    "title" : "OpenJDK experiences",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 901,
    "room" : "Room 8",
    "speaker" : "Mark Reinhold",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279",
    "speakers" : [ { "speaker" : "Mark Reinhold",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279"
        } ],
    "summary" : "Project Jigsaw aims to create a simple, friendly, and scalable standard module system for the Java Platform. This presentation will explain its key goals and design choices, demonstrate its use, and show its application to the Java Platform itself.",
    "tags" : [ { "name" : "modules" },
        { "name" : "jigsaw" }
      ],
    "title" : "Jigsaw: Putting It Together",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 904,
    "room" : "Room 8",
    "speaker" : "Brian Goetz",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283",
    "speakers" : [ { "speaker" : "Brian Goetz",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283"
        } ],
    "summary" : "The big new language feature of Java SE 8 may be closures, but the real power will be in the library abstractions they enable. In this talk, we'll look at the new language features for Java SE 8 (lambda expressions, method references, and extension methods), and the upgrades that are under development in the Collections framework to take advantage of these new features.  We'll explore how these language features enable the development of more powerful libraries, and how these library improvements in turn enable more expressive and less error-prone programs. ",
    "tags" : [ { "name" : "closures" },
        { "name" : "Lambda" }
      ],
    "title" : "Language / Library co-evolution in Java SE 8",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 906,
    "room" : "BOF 2",
    "speaker" : "Tor Norbye",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062",
    "speakers" : [ { "speaker" : "Tor Norbye",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1062"
        },
        { "speaker" : "Xavier Ducrohet",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1079"
        }
      ],
    "summary" : "Meet developers from the Android tools team at Google for an extended Q&A.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" },
        { "name" : "Tools" }
      ],
    "title" : "Android Tools BOF",
    "track" : "Mobile",
    "type" : "BOF"
  },
  { "experience" : "SENIOR",
    "id" : 907,
    "room" : "Room 4",
    "speaker" : "Addy Osmani",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1078",
    "speakers" : [ { "speaker" : "Addy Osmani",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1078"
        } ],
    "summary" : "jQuery is rapidly becoming the most widely used JavaScript library for DOM manipulation, Ajax, events and effects in the world. For developers who work on the front-end but could use better JavaScript skills, it's an essential piece of your toolkit that will almost certainly make your job more easy. In this talk, jQuery core [bugs/docs/learning site] team member Addy Osmani will guide you through the essentials of jQuery, showing you some best practices and performance tips and tricks along the way. If you're looking for a crash course in the library, this talk is a must.",
    "tags" : [ { "name" : "jQuery" },
        { "name" : "javascript" }
      ],
    "title" : "The jQuery Essentials",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 908,
    "room" : "BOF 1",
    "speaker" : "Sonya Barry",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1080",
    "speakers" : [ { "speaker" : "Sonya Barry",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1080"
        } ],
    "summary" : "This presentation will cover the highlights of the planning process, the migration itself, and analysis of the current disposition of the community. Though most communities will never have to go through an intentional transition this big, there were many useful lessons that can be applied to smaller changes within a community as well. The process starts with a lot of questions:\r\n\r\nWhat were we trying to accomplish with this change? What impact would this have on the community as a whole and on individual members? How do you break down any change into manageable pieces of work? How much disruption is acceptable? How transparent should this be to the community? How do we define success when we are finished?\r\n\r\nWith answers to those questions we put together a process. Some things worked, some things didn’t. We learned a lot and would do a few things quite differently if we ever had to do this again. Were we successful? Across the board, I’d say yes, but with a list of caveats.",
    "tags" : [ { "name" : "jcp" } ],
    "title" : "Lessons from the Java.net Migration: Managing an Open Source Community through Major Change",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 909,
    "room" : "Room 9",
    "speaker" : "Richard Hyndman",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1081",
    "speakers" : [ { "speaker" : "Richard Hyndman",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1081"
        } ],
    "summary" : "Android Market is undergoing continuous revisions to improve the experience for developers and endusers.\r\nThis talk covers recent developments, and goes into depth on techniques for using Android Market to leverage new monetization models, deliver optimized content, minimize piracy, and maximize application visibility.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Android Market for Developers",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 910,
    "room" : "Room 9",
    "speaker" : "Richard Hyndman",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1081",
    "speakers" : [ { "speaker" : "Richard Hyndman",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1081"
        },
        { "speaker" : "Nick Butcher",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1082"
        }
      ],
    "summary" : "This talk covers the highlights, from a developer centric viewpoint, of the most recent releases of the Android software.",
    "tags" : [ { "name" : "android" },
        { "name" : "mobile" }
      ],
    "title" : "Whatʼs new and important in Android",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 912,
    "room" : "Room 9",
    "speaker" : "Paul Kinlan",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1083",
    "speakers" : [ { "speaker" : "Paul Kinlan",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1083"
        } ],
    "summary" : "You may have heard of HTML5, but what's new?  This session will cover some of the bleeding edge features in Chrome and the open web platform. Digging into performance, real-time communication, and system integration, we'll cover WebSockets, messaging, and rich media APIs like the Web Audio API.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "websockets" },
        { "name" : "Chrome" }
      ],
    "title" : "Bleeding Edge HTML5",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "EXPERT",
    "id" : 913,
    "room" : "Room 9",
    "speaker" : "Sam Dutton",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1084",
    "speakers" : [ { "speaker" : "Sam Dutton",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1084"
        } ],
    "summary" : "Giving users a flawless offline experience is tough.  This session will discuss advanced offline capabilities like IndexedDB, FileSystem, AppCache, WebSQL, and online events for building great apps that work seamlessly offline.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "WebSQL" },
        { "name" : "IndexedDB" },
        { "name" : "AppCache" }
      ],
    "title" : "Working Off the Grid: HTML5 Offline",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "EXPERT",
    "id" : 914,
    "room" : "Room 9",
    "speaker" : "Paul Kinlan",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1083",
    "speakers" : [ { "speaker" : "Paul Kinlan",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1083"
        } ],
    "summary" : "With recent announcement that Google and Mozilla will build in support for Web Intents directly into your browser, this talk will show why it is the future of web application development and how you can build apps today to support this technology.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "google" },
        { "name" : "Mozilla" }
      ],
    "title" : "Next-gen web apps with Web Intents",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 915,
    "room" : "Room 4",
    "speaker" : "Alexis Moussine-Pouchkine",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/182",
    "speakers" : [ { "speaker" : "Alexis Moussine-Pouchkine",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/182"
        } ],
    "summary" : "This session will start with a status of the open source GlassFish project (community and product) as it flourishes now under the new Oracle sun. It will discuss GlassFish 3.x, a second-generation full Java EE 6 product and the plans going forward en route for Java EE 7 and more cloud and PaaS innovations.\r\n\r\nThe second part of the presentation will highlight production use of a number of high-profile and demanding GlassFish users, featuring Java EE 6, clustering, embedded and more unique features. Whenever possible the speakers for these use-cases will be the developers themselves.",
    "tags" : [ { "name" : "Glassfish" },
        { "name" : "javaee" },
        { "name" : "javaee6" }
      ],
    "title" : "GlassFish, 2 years into Java EE 6 at Oracle (real-world use-cases included)",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 916,
    "room" : "Room 6",
    "speaker" : "Kirk Pepperdine",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/355",
    "speakers" : [ { "speaker" : "Kirk Pepperdine",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/355"
        } ],
    "summary" : "If you wanna know what your garbage collector is up to the best place to look is in the GC logs. That said, the GC logs are like any other ascii log file in that they can be full of 1000s of cryptic entries which make trying to figure out what the logs are saying without any tooling, a daunting task. In this session I will introduce Censum, a free tool designed to help you make sense out of your log files. Some of what Censum can tell you is if your JVM's heap is misconfigured. For example, a large number of applications currently running in products systems are starved for memory in at least one of their internal memory pools. But it’s not only starvation that can a cause of poor performance or long GC pauses. Too much memory can be equally as problematic. Or your problem could be as simple as your application calling System.gc(). WIth Censum sort out what your GC logs are telling you so that you can go on to solve your Java heap rooted performance problems.",
    "tags" : [ { "name" : "performance" },
        { "name" : "JVM" },
        { "name" : "Tools" }
      ],
    "title" : "Are your GC logs speaking to you?",
    "track" : "Java SE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 917,
    "room" : "BOF 2",
    "speaker" : "Joonas Lehtinen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/240",
    "speakers" : [ { "speaker" : "Joonas Lehtinen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/240"
        } ],
    "summary" : "Come and see what is going on in the Vaadin community, hear  the latest news, and meet other Vaadin developers and people behind  Vaadin. This is also the place to present your Vaadin related work. \r\nWhether it is an application, component or just an idea for Vaadin, you are welcome to present it to an audience that understands it.",
    "tags" : [ { "name" : "GWT" },
        { "name" : "RIA" },
        { "name" : "vaadin" }
      ],
    "title" : "Vaadin Meetup",
    "track" : "Web",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 918,
    "room" : "Room 8",
    "speaker" : "James Gosling",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/306",
    "speakers" : [ { "speaker" : "James Gosling",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/306"
        },
        { "speaker" : "Cameron Purdy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1087"
        },
        { "speaker" : "Ben Forta",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1086"
        },
        { "speaker" : "Tim Bray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1085"
        }
      ],
    "summary" : "Forward looking informal Devoxx keynote.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "javase" },
        { "name" : "javaee" },
        { "name" : "android" }
      ],
    "title" : "Fireside Chat",
    "track" : "Java SE",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 919,
    "room" : "Room 8",
    "speaker" : "Bruno Oliveira",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1088",
    "speakers" : [ { "speaker" : "Bruno Oliveira",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1088"
        } ],
    "summary" : "Good user experience and performance are crucial to any mobile application. In this session we will show you some of the important areas you should be attentive of when building your application: compatibility (handling multiple screen sizes, orientation), economy (use of alarms, passive location providers, using C2DM instead of server polling, using broadcast receivers), convenience (general UI tips for phones and tablets to improve user experience), and will show some techniques to build Android applications that are smooth, fast and responsive. Also, we will show some of the tools and techniques we use to track down and fix performance problems.",
    "tags" : [ { "name" : "google" },
        { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Building Android Applications for Performance and Usability",
    "track" : "Mobile",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 921,
    "room" : "Room 3",
    "speaker" : "David Farley",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1104",
    "speakers" : [ { "speaker" : "David Farley",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1104"
        } ],
    "summary" : "This talk introduces the ideas of Continuous Delivery as a practical everyday process, using some of the techniques and technologies that LMAX employ in their development environment as an example.",
    "tags" : [ { "name" : "Methodology" } ],
    "title" : "Continuous Delivery",
    "track" : "Methodology",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 922,
    "room" : "BOF 2",
    "speaker" : "Alexis Moussine-Pouchkine",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/182",
    "speakers" : [ { "speaker" : "Alexis Moussine-Pouchkine",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/182"
        },
        { "speaker" : "Pete Muir",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295"
        },
        { "speaker" : "Dan Allen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/244"
        },
        { "speaker" : "Nigel Deakin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1071"
        },
        { "speaker" : "Emmanuel Bernard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117"
        },
        { "speaker" : "Werner Keil",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/962"
        }
      ],
    "summary" : "Informal meeting with Java EE spec. leads and enthusiasts.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "javaee6" }
      ],
    "title" : "Java EE Gathering",
    "track" : "Java EE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 923,
    "room" : "Room 8",
    "speaker" : "Cameron Purdy",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1087",
    "speakers" : [ { "speaker" : "Cameron Purdy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1087"
        } ],
    "summary" : "TBA",
    "tags" : [ { "name" : "javaee" },
        { "name" : "javaee6" }
      ],
    "title" : "Java EE Keynote",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 924,
    "room" : "Room 8",
    "speaker" : "Henrik Ståhl",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1091",
    "speakers" : [ { "speaker" : "Henrik Ståhl",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1091"
        } ],
    "summary" : "TBA",
    "tags" : [ { "name" : "javase" },
        { "name" : "JDK7" },
        { "name" : "JDK8" }
      ],
    "title" : "Java SE Keynote",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 925,
    "room" : "Room 8",
    "speaker" : "Stephan Janssen",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/2",
    "speakers" : [ { "speaker" : "Stephan Janssen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/2"
        } ],
    "summary" : "Welcome to the 10th edition of Devoxx by founder Stephan Janssen.  He'll also share some exciting announcements during this welcome keynote.",
    "tags" : [ { "name" : "Devoxx" },
        { "name" : "parleys" }
      ],
    "title" : "Welcome and Announcements",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 926,
    "room" : "Room 9",
    "speaker" : "Stephen Colebourne",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/335",
    "speakers" : [ { "speaker" : "Stephen Colebourne",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/335"
        } ],
    "summary" : "Fantom is a production-ready programming language that compiles to the JVM and Javascript. On occasion, I've described Fantom as being 'in some ways light years ahead of Scala'. But how do I justify that? Why do I consider the ideas and direction of Fantom to be a more appealing view of the future than Scala? In this talk I'll summarize the features of Fantom and try to explain my opinion of why its strengths are important.",
    "tags" : [ { "name" : "scala" },
        { "name" : "Fantom" }
      ],
    "title" : "Is Fantom light years ahead of Scala?",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 927,
    "room" : "Room 9",
    "speaker" : "David Chandler",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1093",
    "speakers" : [ { "speaker" : "David Chandler",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1093"
        } ],
    "summary" : "Modern Web apps are rich, snappy, and work offline and mobile, too. In this talk, we’ll look at the frameworks and HTML5 features that make these possible, including support in GWT and Chrome: \n- MVC / MVP \n- File handling / FileSystem API \n- Offline (AppCache) \n- LocalStorage \n- Determining form factor \nIn addition, we’ll give an introduction to DART, a new language for structured Web programming.",
    "tags" : [ { "name" : "HTML5" } ],
    "title" : "Building Modern Web Apps with HTML5 and DART",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 928,
    "room" : "Room 8",
    "speaker" : "Marian Muller",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1094",
    "speakers" : [ { "speaker" : "Marian Muller",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1094"
        } ],
    "summary" : "Once an application is running in production, upgrading it without loss of availability becomes tricky and can quickly give you headaches. You have to perform a manual rolling upgrade: setting up a cluster, replicating application and its sessions, then juggling with the load-balancer and server instances each time you do an upgrade.\r\n\r\nCurrent application-versioning feature combined with early-preview of the rolling upgrade feature in GlassFish make it easy to perform rolling upgrade in a single stand-alone GlassFish instance.\r\n\r\nIn this session, you will be presented these features and how to use them to upgrade a production application with no loss of availability, using exclusively GlassFish built-in features.",
    "tags" : [ { "name" : "Glassfish" },
        { "name" : "javaee" },
        { "name" : "Tools" }
      ],
    "title" : "GlassFish :  Application versioning and high-availability rolling upgrade",
    "track" : "Java EE",
    "type" : "Tools in Action"
  },
  { "experience" : "NOVICE",
    "id" : 929,
    "room" : "BOF 2",
    "speaker" : "Van Riper",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1096",
    "speakers" : [ { "speaker" : "Van Riper",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1096"
        } ],
    "summary" : "Google Technology User Groups (GTUGs) are user groups for people who are interested in Google's developer technology; everything from the Android and App Engine platforms, to product APIs like the Maps API and the Google Calendar API, to initiatives like Chrome OS. A GTUG can take many forms — from just a few people getting together to watch tech talk videos, to large gatherings with demos and lectures, to events like code sprints and hackathons.\r\n\r\nThis BOF is an opportunity to meet with Googlers that support the GTUG program. If you already run a local GTUG or you are interested in starting a new GTUG where you live, then this BOF should be of interest to you.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "google" },
        { "name" : "android" }
      ],
    "title" : "Google Technology User Group BOF",
    "track" : "Mobile",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 930,
    "room" : "Room 8",
    "speaker" : "Tim Bray",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1085",
    "speakers" : [ { "speaker" : "Tim Bray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1085"
        } ],
    "summary" : "TBA",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Android Keynote",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 931,
    "room" : "BOF 1",
    "speaker" : "Charles Moulliard",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/902",
    "speakers" : [ { "speaker" : "Charles Moulliard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/902"
        },
        { "speaker" : "Gert Vanthienen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1098"
        }
      ],
    "summary" : "Get your hands dirty with the FuseSource distributions for the following Apache projects: ActiveMQ, ServiceMix, Camel and CXF.",
    "tags" : [ { "name" : "ServiceMix" },
        { "name" : "CXF" },
        { "name" : "camel" },
        { "name" : "ActiveMQ" }
      ],
    "title" : "Hands on with Apache ActiveMQ, ServiceMix, Camel and CXF",
    "track" : "Java EE",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 932,
    "room" : "Room 5",
    "speaker" : "Charles Moulliard",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/902",
    "speakers" : [ { "speaker" : "Charles Moulliard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/902"
        },
        { "speaker" : "Gert Vanthienen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1098"
        }
      ],
    "summary" : "This presentation will give an overview of the features and functions of the FuseSource distributions for the following Apache projects: ActiveMQ, ServiceMix, Camel and CXF. It will also feature demonstrations on the architectures that can be designed around ActiveMQ and ServiceMix.",
    "tags" : [ { "name" : "ServiceMix" },
        { "name" : "CXF" },
        { "name" : "camel" },
        { "name" : "ActiveMQ" }
      ],
    "title" : "Introduction to Apache ActiveMQ, ServiceMix, Camel and CXF",
    "track" : "Java EE",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 933,
    "room" : "Room 9",
    "speaker" : "Brendan McAdams",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1099",
    "speakers" : [ { "speaker" : "Brendan McAdams",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1099"
        } ],
    "summary" : "In this workshop, one of the core MongoDB committers will present the fundamental principles of MongoDB, how to set up and interact with the database, and what to consider when building applications using a document-based data model. We'll contrast MongoDB with relational databases and with some NoSQL counterparts. \r\n\r\nThis workshop will cover:\r\n* How to install and configure MongoDB\r\n* Basic administration via MongoDB's JavaScript console\r\n* How the MongoDB drivers work, and how to use them to build applications\r\n* Data modeling with MongoDB documents\r\n* Scaling with MongoDB (master/slave configurations, replica sets, and auto-sharding)\r\n* Unique database features, including capped collections, large file storage, and atomic updates",
    "tags" : [ { "name" : "MongoDB" },
        { "name" : "NoSQL" }
      ],
    "title" : "Building Web Applications with MongoDB",
    "track" : "Architecture",
    "type" : "University"
  },
  { "experience" : "SENIOR",
    "id" : 934,
    "room" : "Room 9",
    "speaker" : "Jean-Francois Arcand",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1100",
    "speakers" : [ { "speaker" : "Jean-Francois Arcand",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1100"
        } ],
    "summary" : "The Atmosphere Framework allow the creation of portable Comet and\r\nWebSocket applications across browser and server. In this session we\r\nwill first introduce the new WebSocket technology and how easy it is\r\nto write such application using the Atmosphere Framework. Next we will\r\nintroduce Atmosphere's Websocket clients' library: JQuery and GWT. We\r\nwill then demonstrate how WebSocket applications can be highly scaled\r\nusing the Redis's data structure server, the XMPP protocol or\r\nActiveMQ. We will conclude the session by deploying our WebSocket\r\napplication into environments that doesn't support the protocol and\r\nhow Atmosphere can transparently emulate WebSocket support. The Scala\r\nprogramming language will be used for all our WebSocket demonstration.",
    "tags" : [ { "name" : "comet" },
        { "name" : "scala" },
        { "name" : "websockets" }
      ],
    "title" : "Writing highly scalable WebSocket using the Atmosphere Framework in Scala",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 935,
    "room" : "BOF 1",
    "speaker" : "Brian Goetz",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283",
    "speakers" : [ { "speaker" : "Brian Goetz",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283"
        },
        { "speaker" : "Mark Reinhold",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279"
        },
        { "speaker" : "Neil Richards",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1070"
        }
      ],
    "summary" : "Informal BOF session on the next release of the JDK.",
    "tags" : [ { "name" : "openjdk" },
        { "name" : "JDK8" }
      ],
    "title" : "JDK 8",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 936,
    "room" : "BOF 1",
    "speaker" : "Renato Guerra Cavalcanti",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1101",
    "speakers" : [ { "speaker" : "Renato Guerra Cavalcanti",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1101"
        },
        { "speaker" : "Tim Romberg",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/853"
        },
        { "speaker" : "Louis Jacomet",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/459"
        }
      ],
    "summary" : "BeScala, the Belgium Scala Enthusiasts group, would like to invite all Scala users and fans coming to Devoxx for an informal meet-up.\n\nCome and exchange on all things about Scala and its community: organizing and animating a vibrant local user group, supporting and promoting adoption in the enterprise and any other topic around this exciting language.",
    "tags" : [ { "name" : "scala" },
        { "name" : "JVM" }
      ],
    "title" : "Scala Enthusiasts Gathering",
    "track" : "New Languages on the JVM",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 939,
    "room" : "Room 4",
    "speaker" : "James Ward",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/993",
    "speakers" : [ { "speaker" : "James Ward",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/993"
        } ],
    "summary" : "Heroku is a Polyglot Cloud Application Platform that makes it easy to  deploy Java & Play! apps on the cloud. Deployment is as simple as doing  a \"git push\". This session will teach you how to deploy and scale Java  & Play! apps on Heroku.",
    "tags" : [ { "name" : "PlayFramework" },
        { "name" : "Heroku" },
        { "name" : "cloud" }
      ],
    "title" : "Deploying Java & Play Framework Apps to the Cloud",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 940,
    "room" : "Room 9",
    "speaker" : "Frank Kim",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/919",
    "speakers" : [ { "speaker" : "Frank Kim",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/919"
        } ],
    "summary" : "Learn how to exploit security vulnerabilities that are commonly found in the arsenal of malicious attackers. We won't simply talk about issues like XSS, CSRF and SQL Injection, but will have live demos showing how hackers exploit these potentially devastating defects using freely available tools. You'll see how to hack a real world open source application and explore bugs in commonly used open source frameworks. \r\n\r\nWe also look at the source code and see how to fix these issues using secure coding principles. We will also discuss best practices that can be used to build security into your SDLC. Java developers and architects will learn how to find and fix security issues in their applications before hackers do.",
    "tags" : [ { "name" : "security" },
        { "name" : "javaee" }
      ],
    "title" : "Securing Java EE Web Apps",
    "track" : "Security",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 941,
    "room" : "Room 9",
    "speaker" : "Michael Chaize",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331",
    "speakers" : [ { "speaker" : "Michael Chaize",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331"
        } ],
    "summary" : "Join the Adobe experts to discover how to develop RIAs and mobile applications for Windows, MAC OS, Linux, iOS, Android and QNX. We'll present the last features on Adobe Flex, the open-source framework to build first-class applications connected to your JAVA services. You'll learn how to quickly develop cross-platform mobile and tablet applications within Eclipse. For the first, we'll also explain how to develop mobile native extensions with the Android SDK, and how to communicate with your Flex application. A lot of innovation for Enterprise JAVA developers. We'll also spend some time on HTML5 and Enterprise websites. Get your hands on Adobe's Web Experience Management solution to learn how to build a full-featured editable HTML5 website from ground up. Understand the inner mechanics of the Adobe Digital Enterprise Platform, and how powerful this RESTful framework is to build web sites.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "adobe" },
        { "name" : "RIA" },
        { "name" : "android" },
        { "name" : "FLEX" }
      ],
    "title" : "Cross-platform RIAs and Mobile Applications connected to a Java back-end",
    "track" : "Web",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 942,
    "room" : "BOF 1",
    "speaker" : "Michael Chaize",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331",
    "speakers" : [ { "speaker" : "Michael Chaize",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331"
        } ],
    "summary" : "Join Adobe Technical Evangelists  for a hands on 3 hours code camp working with Adobe Flex and AIR, including mobile development.. During the course, topics will begin with introductions to Flex 4.5 and AIR 2.7 with simple development, becoming increasingly complex. We'll quickly build classic and then complex mobile applications and cover several topics: pushing data between views, manipulating the view navigator, accessing the camera and microphone, accessing the precision accelerometer, retrieving remote data from a JAVA backend, architectural best practices and which component sets to use for cross compiling to Android, iOS and BlackBerry Playbook. Students will receive intensive knowledge of desktop development and where mobile development architecture differs as well as how to utilize a three tier architecture to gain the best from both worlds.",
    "tags" : [ { "name" : "AIR" },
        { "name" : "adobe" },
        { "name" : "iOS" },
        { "name" : "android" },
        { "name" : "FLEX" }
      ],
    "title" : "Learn how to develop Flex Mobile applications for iOS, Android and QNX",
    "track" : "Web",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 943,
    "room" : "BOF 1",
    "speaker" : "Michael Chaize",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331",
    "speakers" : [ { "speaker" : "Michael Chaize",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331"
        } ],
    "summary" : "Join Adobe Technical Evangelists  for a hands on 3 hours code camp working with Adobe Flex and AIR, including mobile development.. During the course, topics will begin with introductions to Flex 4.5 and AIR 2.7 with simple development, becoming increasingly complex. We'll quickly build classic and then complex mobile applications and cover several topics: pushing data between views, manipulating the view navigator, accessing the camera and microphone, accessing the precision accelerometer, retrieving remote data from a JAVA backend, architectural best practices and which component sets to use for cross compiling to Android, iOS and BlackBerry Playbook. Students will receive intensive knowledge of desktop development and where mobile development architecture differs as well as how to utilize a three tier architecture to gain the best from both worlds.",
    "tags" : [ { "name" : "AIR" },
        { "name" : "adobe" },
        { "name" : "iOS" },
        { "name" : "android" },
        { "name" : "FLEX" }
      ],
    "title" : "Learn how to develop Flex Mobile applications for iOS, Android and QNX",
    "track" : "Web",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 944,
    "room" : "Room 7",
    "speaker" : "Michael Chaize",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331",
    "speakers" : [ { "speaker" : "Michael Chaize",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/331"
        },
        { "speaker" : "christophe coenraets",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/285"
        }
      ],
    "summary" : "With the rise of smartphone and tablet devices, a new class of application is emerging to work across multiple kinds of devices. Java developers are now faced with new challenges to provide the most engaging user experiences on any screen. New device input methods like touch and gestures require developers to rethink interaction models. Screen size constraints also require developers to optimize real estate usage. With so many different mediums for delivering rich Internet applications code, reuse becomes incredibly important. Adobe technical evangelists will present how Java developers can leverage the new Flex 4.5 framework to solve this actual challenge and deliver first-class smartphone and tablet applications connected to Java services using Spring or POJO. One codebase and one language to target Android, iOS and BlackBerry devices.",
    "tags" : [ { "name" : "adobe" },
        { "name" : "iOS" },
        { "name" : "blackberry" },
        { "name" : "android" },
        { "name" : "FLEX" }
      ],
    "title" : "How to develop cross-platform mobile applications connected to your Java back-end",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 945,
    "room" : "Room 7",
    "speaker" : "Gabriel Walt",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1103",
    "speakers" : [ { "speaker" : "Gabriel Walt",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1103"
        } ],
    "summary" : "Building for the web by respecting the fundamental design principles of the web sounds like an obvious design decision. But few web frameworks offer such a radical approach on that topic as does Apache Sling. This innovative open source project is architectured from ground up following the REST principles, it is content-driven with it's standardized JCR content repository (using the Apache Jackrabbit implementation) and powered by OSGi for modularity (using Apache Felix).\r\n\r\nFirst, understand in-depth what makes Sling (including Felix and Jackrabbit) such a fun and powerful web framework. Then learn more about how Adobe made it a central part of it's Digital Enterprise Platform and see how the Adobe Web Experience Management solution makes use of it for it's modern enterprise-scale web content management",
    "tags" : [ { "name" : "REST" },
        { "name" : "adobe" },
        { "name" : "JCR" },
        { "name" : "JackRabbit" },
        { "name" : "osgi" }
      ],
    "title" : "How Open Web Standards shape Adobe's Web Experience Management",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 946,
    "room" : "Room 5",
    "speaker" : "David Farley",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1104",
    "speakers" : [ { "speaker" : "David Farley",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1104"
        } ],
    "summary" : "This talk introduces the ideas of Continuous Delivery as a practical everyday process, using some of the techniques and technologies that LMAX employ in their development environment as an example.",
    "tags" : [ { "name" : "Methodology" },
        { "name" : "CI" }
      ],
    "title" : "Continuous Delivery",
    "track" : "Methodology",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 947,
    "room" : "Room 6",
    "speaker" : "Pete Muir",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295",
    "speakers" : [ { "speaker" : "Pete Muir",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/295"
        } ],
    "summary" : "In this session Pete demonstrates how to develop Java EE 6 applications for OpenShift, running JBoss AS 7. Pete will create an application from scratch, explain how it works, and then deploy it to Red Hat's free PaaS, OpenShift Express. Pete will then show you how to deploy the same application to Red Hat's auto-scalable, cluster-enabled PaaS, OpenShift Flex. Finally, Pete will outline what's coming in Java EE 7 to make developing for the cloud easier.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "OpenShift" },
        { "name" : "cloud" },
        { "name" : "jboss" }
      ],
    "title" : "Java EE in the Cloud: JBoss AS 7 on OpenShift",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 948,
    "room" : "Room 7",
    "speaker" : "Maudrit Martinez",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/347",
    "speakers" : [ { "speaker" : "Maudrit Martinez",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/347"
        },
        { "speaker" : "Birgitta Boeckeler",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1108"
        }
      ],
    "summary" : "Open Source code generation tools have made a huge jump in the last 10 years. The time to build a customized code generator for a project has significantly decreased, making way for powerful opportunities to speed up development and enhance productivity and quality.\r\n\r\nAccenture has been applying a number of different modeling and code generation techniques and technologies on their large Enterprise Java projects over the years. This session will showcase two of those approaches, one that uses Eclipse Xtext and Xpand, and one that builds on Spring Roo. It will cover introductions on how to use each of these technologies, including lessons learned, and how they can be applied to tackle challenges in Enterprise development projects.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "Xtext" },
        { "name" : "Xpand" },
        { "name" : "ROO" }
      ],
    "title" : "Code generation at large - techniques and lessons learned",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 949,
    "room" : "BOF 1",
    "speaker" : "Dalibor Topic",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/345",
    "speakers" : [ { "speaker" : "Dalibor Topic",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/345"
        } ],
    "summary" : "Informal gathering with OpenJDK committers and enthusiasts.",
    "tags" : [ { "name" : "javase" },
        { "name" : "openjdk" },
        { "name" : "JDK8" }
      ],
    "title" : "The OpenJDK Community BOF",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 950,
    "room" : "Room 5",
    "speaker" : "Scott Kovatch",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1130",
    "speakers" : [ { "speaker" : "Scott Kovatch",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1130"
        } ],
    "summary" : "Ever since the first version of Mac OS X was released, you could always assume that a version of Java would always be there, ready to use. Well, Mac OS X 10.7 changed all of that. What does that mean for you as a developer, and for your users? In this session we will talk about how Java on Mac OS X is changing and what you need to do to be ready for it. We'll also provide a road map for Java and JavaFX on the Mac, and Oracle's role in the Mac OS X port project of OpenJDK.",
    "tags" : [ { "name" : "javase" },
        { "name" : "openjdk" },
        { "name" : "Apple" }
      ],
    "title" : "Java on Mac OS X: Now What?",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 951,
    "room" : "Room 8",
    "speaker" : "Brian Goetz",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283",
    "speakers" : [ { "speaker" : "Brian Goetz",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/283"
        },
        { "speaker" : "Mark Reinhold",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/279"
        },
        { "speaker" : "Ben Evans",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/930"
        },
        { "speaker" : "Dion Almaer",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/290"
        },
        { "speaker" : "Joshua Bloch",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/314"
        },
        { "speaker" : "Brian H. Prince",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1264"
        }
      ],
    "summary" : "A technical discussion panel handling moderated questions posted by the Java Community.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "javase" },
        { "name" : "javaee" },
        { "name" : "scala" },
        { "name" : "android" }
      ],
    "title" : "Technical Discussion Panel",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 952,
    "room" : "BOF 1",
    "speaker" : "Bruno Oliveira",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1088",
    "speakers" : [ { "speaker" : "Bruno Oliveira",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1088"
        } ],
    "summary" : "In this lab, we will cover some of the basic principles of user experience in Android such as providing different layouts for multiple screen sizes and orientations, making flexible layouts, using background threads to perform computations, persisting user preferences, using progress dialogs, applying styles, using UI elements correctly, and other UI/UX tips that will help your application's overall usability and improve user satisfaction.\r\n\r\nRequirements: bring a laptop with the Android SDK and Eclipse fully configured for Android development. You can find instructions on installing Eclipse and the Android SDK here: [ http://goo.gl/z710b ]. To make sure your environment is working, try compiling and running \"Hello World\" (for more information, follow the Hello World Tutorial [ http://goo.gl/jLXuo ]).",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Android User Experience Lab",
    "track" : "Mobile",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 953,
    "room" : "Room 3",
    "speaker" : "Giorgio Sardo",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1131",
    "speakers" : [ { "speaker" : "Giorgio Sardo",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1131"
        } ],
    "summary" : "HTML5 has already changed the way we think about the web. But it’s no longer simply the preferred language for building websites; it is quickly becoming the language for building applications that can be distributed to a large number of users and devices connected through the cloud. But what about the future? What’s coming next from the W3C standards world? This session will explore the significant role Microsoft will play in helping to create this future.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "W3C" },
        { "name" : "Microsoft" }
      ],
    "title" : "HTML5 and Beyond",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 954,
    "room" : "Room 5",
    "speaker" : "Kevin Wright",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/780",
    "speakers" : [ { "speaker" : "Kevin Wright",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/780"
        },
        { "speaker" : "Mario Fusco",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/831"
        }
      ],
    "summary" : "Part 1: Scala: where objects and functions meet \r\n\r\nThe purpose of this talk is to give an introductionary overview of the most important Scala idioms and features that make it unique, together with the ones of its Java-ish, Haskell-ish and Groovy-ish sides, and how it is possible to mix them in order to leverage the strengths of each one.\r\n\r\nPart 2:  Scala as an Agile Enabler\r\n\r\nAgile has now truly hit the mainsteam as a development methodology, spawning a range of practices such as refactoring, spikes, BDD, continuous integration, and a strong focus on improved communication; all intended to help you be more productive and to create more robust systems on time.  I cover ways in which Scala seems almost custom-designed for the needs of agile teams, and how it can help you take the already well-documented benefits of the methodology to the next level.",
    "tags" : [ { "name" : "scala" },
        { "name" : "Methodology" },
        { "name" : "agile" }
      ],
    "title" : "Crash Course into Scala",
    "track" : "New Languages on the JVM",
    "type" : "University"
  },
  { "experience" : "NOVICE",
    "id" : 955,
    "room" : "Room 8",
    "speaker" : "Emmanuel Bernard",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117",
    "speakers" : [ { "speaker" : "Emmanuel Bernard",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/117"
        },
        { "speaker" : "Stephane Epardaud",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1135"
        }
      ],
    "summary" : "Ceylon is a new programming language designed to execute on the JVM. We're fans of Java and its ecosystem. However, we think that the language and class libraries, designed more than 15 years ago, are no longer the best foundation for a range of today's business computing problems.\r\n\r\nCeylon's design goals include:\r\n\r\n- easy to learn and understand for Java and C# developers,\r\n- eliminate some of Java's verbosity, but keep its readability,\r\n- improve upon Java's typesafety,\r\n- provide a declarative syntax for expressing hierarchical information (user interface, external data, system configuration)\r\n- support and encourage a more functional style of programming with immutable objects and higher-order functions,\r\n- great support for meta-programming,\r\n- built-in modularity.\r\n\r\nCome and join us for this introduction to Ceylon where we will show you its main features as well as the ongoing progress of the compiler, IDE, tools and the community behind it.",
    "tags" : [ { "name" : "scala" },
        { "name" : "Ceylon" },
        { "name" : "JVM" }
      ],
    "title" : "The Ceylon programming language",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 956,
    "room" : "BOF 2",
    "speaker" : "Chet Haase",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129",
    "speakers" : [ { "speaker" : "Chet Haase",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/129"
        },
        { "speaker" : "Romain Guy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/132"
        }
      ],
    "summary" : "In this lab, we'll take you through the steps of converting a phone application to one that works well on tablets. We'll explore various aspects of the Honeycomb release (Android 3.0) that make tablet and multiple-device development easier and more powerful, including fragments, multi-resolution layouts, the action bar, and property animation.\r\n\r\nPrerequisites\r\nWe will be developing for Android tablets, so it would be useful if you had one. If not, you can make do with the emulator or by watching our attempts at live-coding on the projectors. Everyone should benefit from the presentation, but if you have a tablet you might get slightly more out of it.\r\nBesides that hardware issue, you should also bring a laptop that is configured to build SDK applications. In particular, you should download at least SDK version 11 (Honeycomb). \r\n\r\nFinally, the code projects that we will work with are here: http://goo.gl/Q1mRg - download and unzip that content before you get in the room.",
    "tags" : [ { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Android Tabletization",
    "track" : "Mobile",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 957,
    "room" : "BOF 2",
    "speaker" : "Hamlet D'Arcy",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/151",
    "speakers" : [ { "speaker" : "Hamlet D'Arcy",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/151"
        },
        { "speaker" : "Hans Dockter",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/958"
        },
        { "speaker" : "Stephen Chin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/98"
        },
        { "speaker" : "Andres Almiray",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/5"
        }
      ],
    "summary" : "This session is your chance to contribute to the open source projects you've been learning about. Instead of a presentation, we will come together with several open source experts and write a plugin, a small feature, or a bug fix for a project that interests you. This is your chance to get involved with opens source and learn how to make a difference for the projects you're passionate about. Bring your laptop and your ideas; everyone is welcome. \r\n\r\nHere are just some of the experts coming to help: Hans Dockter (Gradle Lead), Andres Almiray (Java Champion, Griffon Lead, and Groovy Committer), Stephen Chin (Java Champion, JavaFX and Android Expert), and Hamlet D'Arcy (CodeNarc and Groovy Committer).",
    "tags" : [ { "name" : "javafx" },
        { "name" : "android" },
        { "name" : "groovy" }
      ],
    "title" : "Hackergarten Hands-On Coding Event",
    "track" : "Java SE",
    "type" : "Hands-on Labs"
  },
  { "experience" : "NOVICE",
    "id" : 958,
    "room" : "BOF 1",
    "speaker" : "Friedger Müffke",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1138",
    "speakers" : [ { "speaker" : "Friedger Müffke",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1138"
        },
        { "speaker" : "Pieter-Jan Vandormael",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1242"
        }
      ],
    "summary" : "Come to meet organizers and members of the Google Technology User Groups (GTUG) from all over the world. During the session you will have the possiblity to get to know GTUGs as well as the so called Google Technologies. After an overview of the existing Google APIs, the open source project on Java AppEngine for the site gtugs.org will be presented and you are invite to contribute your ideas and code to the project in a relaxed atmosphere. That could be an Android client, a chrome extension or a fancy HTML5 page. In the spirit of GTUG, the session will also be about sharing. We will show how to ask and answer good questions on StackOverflow and exercise with some open ones.",
    "tags" : [ { "name" : "JUG" },
        { "name" : "google" },
        { "name" : "GTUG" }
      ],
    "title" : "Social Coding with GTUGs",
    "track" : "Java SE",
    "type" : "Hands-on Labs"
  },
  { "experience" : "SENIOR",
    "id" : 959,
    "room" : "BOF 1",
    "speaker" : "Lilli Thompson",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1213",
    "speakers" : [ { "speaker" : "Lilli Thompson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1213"
        } ],
    "summary" : "Aren't you tired of rewriting the same game code for multiple platforms? PlayN is an open source game library that allows developers to write and debug in Java via the Google Web Toolkit and simultaneously create WebGL / HTML5 canvas, Android, and Flash builds. Learn to use the framework to create new games or to port existing game code and libraries.",
    "tags" : [ { "name" : "webgl" },
        { "name" : "HTML5" },
        { "name" : "android" }
      ],
    "title" : "Cross Platform Game Programming with PlayN",
    "track" : "Web",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 960,
    "room" : "Room 3",
    "speaker" : "James Pearce",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1214",
    "speakers" : [ { "speaker" : "James Pearce",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1214"
        } ],
    "summary" : "The premise and the promise of using web technologies for building mobile apps is well understood. But are we there yet? This presentation takes an honest look at the state of the art of mobile standards and implementations. We discuss what can be built, what has been built - and of course what will soon be possible - with these exciting tools and approaches.",
    "tags" : [ { "name" : "HTML5" },
        { "name" : "mobile" }
      ],
    "title" : "A snapshot of the mobile HTML5 revolution",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "EXPERT",
    "id" : 961,
    "room" : "Room 6",
    "speaker" : "Jevgeni Kabanov",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/142",
    "speakers" : [ { "speaker" : "Jevgeni Kabanov",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/142"
        } ],
    "summary" : "Making changes to running Java applications is hard. So hard, in fact, that the majority of organizations just stop the application in the off-hours and run the update offline. We are talking about code changes, state changes, databases changes, remote dependency changes, configuration changes, environment changes and elasticity changes -- all of them as invisible to the end user as possible.\r\n\r\nThis talk is a journey through the world of production changes, both from a developer and administrator point of view. We draw on the survey of over 700 respondents from organizations around the globe to reveal why making changes to Java apps is so darn hard, from both a technical and process point of view. \r\n\r\nWe will then discuss and demonstrate some possible solutions for these issues, both already available and technology improvements that can be expected soon. We will demonstrate some best of breed solutions, including Tomcat's rolling updates, Amazon BeanStalk, LiveRebel from ZeroTurnaround, and others.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "CI" }
      ],
    "title" : "How Can We Fix Production Updates?",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 962,
    "room" : "Room 6",
    "speaker" : "Emmanuel Tissandier",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1218",
    "speakers" : [ { "speaker" : "Emmanuel Tissandier",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1218"
        } ],
    "summary" : "As sales for smart phones, tablets and other connected devices have eclipsed the sales of laptops and traditional PCs, Mobile has  become the primary method by which people access networks and computing.  In this session we will guide you through technologies available to developers for building Mobile Web applications in the latest Dojo Toolkit 1.7, with a particular focus on the new Mobile web capabilities.\r\nThe session will then dive into more technical details and demonstrate step by step how to build a Dojo Toolkit based Web Application connecting to a Java back-end.\r\nFinally, we will see what IBM offers for building Web 2.0 and Mobile applications as part of WebSphere Application Server and Rational developer tools.",
    "tags" : [ { "name" : "dojo" },
        { "name" : "ibm" },
        { "name" : "mobile" }
      ],
    "title" : "Building Mobile Web application with Open Web standards and the Dojo Toolkit",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 963,
    "room" : "Room 6",
    "speaker" : "Jeff Potts",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1225",
    "speakers" : [ { "speaker" : "Jeff Potts",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1225"
        } ],
    "summary" : "When it comes to building solutions that are heavy on content, a relational back end typically just isn't enough. Attend this session to find out how a Java-based rich content repository such as Alfresco can be used as a core building block in your architecture to provide functionality—such as versioning, security, metadata management, search, check-in/checkout, likes/ratings, and workflow—that's fully standards-compliant and open-source. Don't worry. This isn't a sales pitch. The goal is to explore different patterns of implementation for these types of applications and get you pointed in the right direction so that you can begin to leverage this type of technology in your next project.",
    "tags" : [ { "name" : "Alfresco" },
        { "name" : "javaee" },
        { "name" : "CMS" }
      ],
    "title" : "Relational Won't Cut It: Architecting Content-Centric Applications for Java",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 964,
    "room" : "Room 3",
    "speaker" : "Joe Nuxoll",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/298",
    "speakers" : [ { "speaker" : "Joe Nuxoll",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/298"
        } ],
    "summary" : "What separates a good user experience from a bad one? How do you make sure that your customers' experience with your software leaves them feeling good about you? We will go over some rules, tips, and tricks for designing a good user experience that will hopefully lead you to building better and more usable applications in the future.",
    "tags" : [ { "name" : "graphics" },
        { "name" : "Design" }
      ],
    "title" : "Rules for Good U/X Design",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 965,
    "room" : "Room 6",
    "speaker" : "Dirk Deridder",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1229",
    "speakers" : [ { "speaker" : "Dirk Deridder",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1229"
        },
        { "speaker" : "Koen Vanderkimpen",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1235"
        }
      ],
    "summary" : "Building a life saving eHealth information exchange platform with strong cryptography, on Java. Does it look like a challenge already? Add an extensible data model, add extremely high availability requirements, add scaleability from thousands to millions of users, add heavy-duty cryptography and… make it run fast. \r\nWhen extremely tough non-functional requirements are seemingly impossible to meet, it’s time for an XTP architecture. Smals, the preferred ICT partner of social security and healthcare institutions in Belgium, will be sharing best practices and hands-on experience from a large-scale project using XTP technology and patent protected threshold encryption technology from Smals. \r\n\r\nDirk Deridder and Koen Vanderkimpen are both research consultants at Smals. They have been researching XTP technologies and applying them in innovative large-scale projects serving Belgian citizens, employers and publics administrations.",
    "tags" : [ { "name" : "security" },
        { "name" : "scalable" },
        { "name" : "Transactions" }
      ],
    "title" : "Extreme Transaction Processing",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 966,
    "room" : "Room 5",
    "speaker" : "Shaun Smith",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1005",
    "speakers" : [ { "speaker" : "Shaun Smith",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1005"
        } ],
    "summary" : "One of the major themes of Java EE 7 and JPA 2.1 is multi-tenancy and EclipseLink, the JPA 2.1 reference implementation, has blazed the trail by shipping support for both multi-tenancy and tenant specific extensions in the Eclipse Indigo release.   EclipseLink multi-tenancy enables the use of a single persistence unit by multiple tenants while keeping their data isolated and secure.  But to provide a SaaS platform EclipseLink also provides tenant specific extensions so that each tenant can augment JPA entities with the additional data they need to capture and maintain.\r\n\r\nIn this session we will:\r\n* Look at the challenges presented by multi-tenancy in Java EE and JPA\r\n* Explore the EclipseLink JPA multi-tenancy and extensibility  features\r\n* Introduce the EclipseLink MOXy extensibility features that enable exposing multi-tenant and extended data over REST\r\n* Explore a complete multi-tenant Java EE application that supports dynamic tenant provisioning and customization\r\n\r\nThis session will include live demos.",
    "tags" : [ { "name" : "EclipseLink" },
        { "name" : "JPA2" },
        { "name" : "javaee" }
      ],
    "title" : "JPA Multi-Tenancy & Extensibility: Blazing the Trail to JPA 2.1 in EclipseLink",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 967,
    "room" : "Room 4",
    "speaker" : "Alex Miller",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/15",
    "speakers" : [ { "speaker" : "Alex Miller",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/15"
        } ],
    "summary" : "Maybe you've heard of Clojure, one of those new-fangled JVM languages. How does anybody get any work done in a language like that? What's up with all those parentheses?\r\n\r\nIf you're coming from Java and OOP, Clojure can indeed feel disorienting. In this talk we'll demystify the basics of Clojure and dissect the source of its power. Functional programming is on the rise and Clojure is indeed a functional language, but we'll learn the real secret sauce that makes cooking with Clojure fun.\r\n\r\nWe'll look at how to translate concepts you know in Java (like domain objects, interfaces, collections, and concurrency) into their natural Clojure equivalents. And more importantly, we'll learn how these components interact to make Clojure a beautiful language for building abstractions.\r\n\r\nNo prior knowledge of Clojure or functional programming is assumed... Clojure novices welcome!",
    "tags" : [ { "name" : "Clojure" } ],
    "title" : "Cracking Clojure",
    "track" : "New Languages on the JVM",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 968,
    "room" : "Room 6",
    "speaker" : "Václav Pech",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/69",
    "speakers" : [ { "speaker" : "Václav Pech",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/69"
        },
        { "speaker" : "Maxim Mazin",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1245"
        }
      ],
    "summary" : "Let's write better Java code, faster. Can we get Java with closures, tuples or functional programming today? Will it help us build web applications? How intuitive Domain Specific Languages will it let us create and will they be type-safe?\r\n\r\nJetBrains MPS gives positive answers to all of these questions. MPS is an open-source language workbench that aims to make programming life easier and give you more problem-resolution focus. In this talk we'll give you an introductory tour to MPS. We'll create several Java language extensions, play a bit with the existing ones, show several handy DSLs, build a web application and then put all the pieces together so you can get a complete picture of what's in MPS for you and your projects.\r\nIf the promise of headache-free programming excites you, this session is for you.",
    "tags" : [ { "name" : "closures" },
        { "name" : "DSL" }
      ],
    "title" : "Are you talking my language?",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 969,
    "room" : "Room 6",
    "speaker" : "Iran Hutchinson",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1241",
    "speakers" : [ { "speaker" : "Iran Hutchinson",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1241"
        } ],
    "summary" : "•\tWith the amount of new databases entering the market to handle seemingly new problems continuing to increase, where does that leave the developer?  \r\n•\tWhen should you choose a new database?  Should you choose a new database? \r\n•\tHow do you choose one of these new databases?  \r\n•\tIs NoSQL really that important?  \r\n•\tWhat about JPA, Hibernate, and EclipseLink?  \r\n\r\nIn this session we'll delve into these topics via real world data and use cases.  We'll then diverge from data to installing open source, free, and commercial NoSQL/Big Data solutions in order to compare characteristics.  The output should be criteria to help in evaluation of these new database options and technical insight to how they work.  Lastly, we'll present a solution to the problem of \"How do I handle the next big thing in data?\".",
    "tags" : [ { "name" : "EclipseLink" },
        { "name" : "Hibernate" },
        { "name" : "NoSQL" }
      ],
    "title" : "NoSQL, Big Data ... so what?",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 970,
    "room" : "BOF 2",
    "speaker" : "Sven Peters",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/841",
    "speakers" : [ { "speaker" : "Sven Peters",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/841"
        } ],
    "summary" : "Join us for an informal meeting with members from the team at Atlassian. Come and ask us about JIRA, Confluence, GreenHopper, Bonfire, Bitbucket, Fisheye or Crucible and tell us what you are missing. Find out the Australian way of developing and marketing software.",
    "tags" : [ { "name" : "Bitbucket" },
        { "name" : "Confluence" },
        { "name" : "JIRA" }
      ],
    "title" : "Meet The Atlassians",
    "track" : "Methodology",
    "type" : "BOF"
  },
  { "experience" : "EXPERT",
    "id" : 971,
    "room" : "Room 3",
    "speaker" : "Marek Potociar",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1246",
    "speakers" : [ { "speaker" : "Marek Potociar",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1246"
        } ],
    "summary" : "JAX-RS 1.X has been a hugely successful Java API for RESTful services development and a lot of real-world experience has resulted in a number of new features being proposed. JSR 339 was created in early 2011 with the objective of exploring and scoping all these proposals. The purpose of this talk is to elaborate on all the new planned features. The most commonly requested feature for JAX-RS 2.0 is a client API. Client APIs can range from low-level, just above HttpURLConnection, to high-level, often including support for IoC and hyperlinking. Other features that will be covered in this presentation include: asynchronous processing, hypermedia, validation, interceptors, improved content negotiation, as well as better integration with other specifications such as JSR 330.",
    "tags" : [ { "name" : "javaee" },
        { "name" : "REST" },
        { "name" : "JAX-RS" }
      ],
    "title" : "JAX-RS 2.0: RESTful Java on Steroids",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 972,
    "room" : "Room 6",
    "speaker" : "Brian Oliver",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1247",
    "speakers" : [ { "speaker" : "Brian Oliver",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1247"
        } ],
    "summary" : "Whereas most objects managed in a data grid or a distributed cache are simply used to represent \"values,\" often in the style of the value/data transfer pattern, Live Objects have the ability to react when their state or environment changes. This ability allows us to simply and efficiently model finite state machines, but in a distributed manner. Distributed finite state machines are a powerful concept. They a foundation model that enables us to efficiently, elegantly and robustly implement other concepts, like Actors and reliable subscription-based solutions much like those used in Twitter. This session outlines Live Objects, how they work, how they are implemented and to use then to build a reliable subscription system, free of storage and messaging technologies.",
    "tags" : [ { "name" : "caching" },
        { "name" : "Coherence" },
        { "name" : "JSR-170" }
      ],
    "title" : "Bringing Objects to Life: The Live Object Pattern",
    "track" : "Java EE",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 973,
    "room" : "Room 3",
    "speaker" : "Vinicius Senger",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1251",
    "speakers" : [ { "speaker" : "Vinicius Senger",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1251"
        },
        { "speaker" : "Eric Bariaux",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1252"
        }
      ],
    "summary" : "Part 1:  Home is complete Java EE 6 API for home automation. With jHome you can control wall jackets, lamps, RGB LEDs, gates and much more. The reference implmentation application is using EJB's, REST, WebService, JMS, JSF and jQuery to show how you can use Java EE 6 in a totally different application context. The proposed hardware is open-source, so you do it your self! During the talk we will be showing nice and funny demos!\r\n\r\nPart 2: OpenRemote is an open source project operating in the field of Domotics.  OpenRemote develops and distributes a standard based platform that is extensible and flexible with applications to Home Automation, Energy Management and Healthcare.  This community based project integrates varied field protocols (such as KNX, X10 and Z-Wave) in a common framework and allows for easy creation of visual panels.  Open Remote supports the leading standard platforms iOS, Android and web.",
    "tags" : [ { "name" : "javase" },
        { "name" : "javaee" },
        { "name" : "Domotics" }
      ],
    "title" : "Having fun with Java and Home Automation",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 974,
    "room" : "Room 3",
    "speaker" : "Christian Kurzke",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1253",
    "speakers" : [ { "speaker" : "Christian Kurzke",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1253"
        } ],
    "summary" : "Still, more people own TVs than a smart phone, and spend on average several hours a day watching TV.\r\nDuring the last few years, TV's have become more \"Smart\" and become connected to the Internet.\r\nThere is a new, huge opportunity for Developers with the launch of the Android Market for Google TV. Anyone who can create an Android Application for Mobile Phones can now create and distribute applications for the largest screen in the house!\r\n\r\nThis talk will explain the opportunity and the best practices to optimize existing Tablet and Phone Android applications to Google TV.",
    "tags" : [ { "name" : "Domotics" },
        { "name" : "mobile" },
        { "name" : "android" }
      ],
    "title" : "Google TV: Open for Android Developers",
    "track" : "Mobile",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 975,
    "room" : "Room 4",
    "speaker" : "Justen Stepka",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1254",
    "speakers" : [ { "speaker" : "Justen Stepka",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1254"
        } ],
    "summary" : "Distributed version control (DVCS) is a transformative shift in the way that software is developed. Learn how the development team behind Bitbucket, and other Atlassian teams, have adapted their agile process to use a DVCS workflow with pull requests and forks, to improve the speed and quality of software being shipped.",
    "tags" : [ { "name" : "Atlassian" },
        { "name" : "Bitbucket" },
        { "name" : "DVCS" }
      ],
    "title" : "DVCS For Agile Teams",
    "track" : "Methodology",
    "type" : "Conference"
  },
  { "experience" : "SENIOR",
    "id" : 976,
    "room" : "Room 3",
    "speaker" : "Josh Long",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921",
    "speakers" : [ { "speaker" : "Josh Long",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/921"
        },
        { "speaker" : "Patrick Chanezon",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/870"
        }
      ],
    "summary" : "This talk will describe the Cloud Foundry Open PaaS (Platform as a Service), with its open source, multi-framework, multi-service, multi-cloud model, and will explain in depth how to use Cloud Foundry services effectively from Java/Spring applications.\r\n\r\nCloud Foundry allows developers to provision apps in Java/Spring, Ruby/Rails, Ruby/Sinatra, Javascript/Node, and leverage services like MySQL, MongoDB, Reddis, Postgres and RabbitMQ.\r\n\r\nIt can be used as a public PaaS on CloudFoundry.com and other service providers (ActiveState, AppFog), to create your own private cloud, or on your laptop using the Micro Cloud Foundry VM.\r\n\r\nThe talk will include demos of the Spring app development lifecycle with Cloud Foundry: local development with STS, local deployment to Micro Cloud Foundry for testing, deployment to CloudFoundry.com.",
    "tags" : [ { "name" : "CloudFoundry" },
        { "name" : "PAAS" },
        { "name" : "spring" }
      ],
    "title" : "Cloud Foundry and Spring, a marriage made in heaven",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 977,
    "room" : "Room 6",
    "speaker" : "Bastiaan Ceuppens",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1258",
    "speakers" : [ { "speaker" : "Bastiaan Ceuppens",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1258"
        } ],
    "summary" : "This session will give you an overview of our efforts, challenges, issues encountered and successes achieved while making Java applications run on the Windows Azure Cloud Platform. It will explain what the advantages are of using Windows Azure and how it can be used to deploy your typical Java applications on top of it. Amongst others, we will primarily discuss on how to run a JBoss clustering setup with automatic provisioning and discovery of new instances. To get you started properly, we will also explain the high level architecture of Windows Azure, and motivate why we chose it as our cloud platform to host both .NET and Java distributed applications.",
    "tags" : [ { "name" : "Microsoft" },
        { "name" : "Azure" },
        { "name" : "cloud" }
      ],
    "title" : "Serving Java on the Windows Azure Cloud Platform",
    "track" : "Architecture",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 978,
    "room" : "Room 8",
    "speaker" : "Joshua Bloch",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/314",
    "speakers" : [ { "speaker" : "Joshua Bloch",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/314"
        } ],
    "summary" : "The Java programming language has evolved significantly since its introduction in 1995. In this talk, I’ll discuss language changes from the addition of assertions in JDK 1.4 through Project Coin in Java 8, discussing what worked, what didn’t, and why. Finally, I’ll discuss ongoing efforts (Project Lambda for Java 8) and future plans, in light of the lessons learned from previous changes.",
    "tags" : [ { "name" : "javase" },
        { "name" : "JDK8" },
        { "name" : "Lambda" }
      ],
    "title" : "The Evolution of Java: Past, Present, and Future",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 979,
    "room" : "Room 8",
    "speaker" : "Joshua Bloch",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/314",
    "speakers" : [ { "speaker" : "Joshua Bloch",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/314"
        } ],
    "summary" : "In this retrospective, I'll present my candidates for the best and worst features in the Java language as it was originally released in 1995, and explain the reasoning behind my choices. Some may be obvious, but others will surprise you. When taken together, these critiques lend insight into what made the Java platform a success.",
    "tags" : [ { "name" : "javase" },
        { "name" : "JDK" }
      ],
    "title" : "Java: The Good, the Bad, and the Ugly Parts",
    "track" : "Java SE",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 980,
    "room" : "BOF 1",
    "speaker" : "Roger Brinkley",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1266",
    "speakers" : [ { "speaker" : "Roger Brinkley",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1266"
        } ],
    "summary" : "Devoxx Live Recording of the Java Spotlight Podcast. Be part of this recording November 18, 10:45am in BOF 1 room next to the info desk!",
    "tags" : [ { "name" : "javafx" },
        { "name" : "javase" },
        { "name" : "javaee" },
        { "name" : "Podcast" }
      ],
    "title" : "Live Recording of the Java Spotlight Podcast",
    "track" : "Java SE",
    "type" : "BOF"
  },
  { "experience" : "NOVICE",
    "id" : 981,
    "room" : "Room 3",
    "speaker" : "Stijn Van den Enden",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/70",
    "speakers" : [ { "speaker" : "Stijn Van den Enden",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/70"
        },
        { "speaker" : "Ward Vijfeijken",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1276"
        },
        { "speaker" : "Guy Veraghtert",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1275"
        }
      ],
    "summary" : "Since its inception, Java has been associated with the Web. As a result, a lot of frameworks are available today, which makes it hard to pick the right one. How do developers choose from such a plethora of frameworks? Often subjective criteria are used: ease of use, preference of the architect. Seldom is performance of the framework taken into account. Nonetheless, responsive applications can make the online experience effective, even enjoyable. This session presents updated results of Sujoe Bose's JavaOne 2008 presentation: most frameworks have had a major release (Spring 3, JSF 2.1); others have gotten more traction (GWT, Wicket). On top of that, the focus has shifted toward a richer user experience: Ajax, bookmarkability, ...",
    "tags" : [ { "name" : "Wicket" },
        { "name" : "GWT" },
        { "name" : "JSF2" },
        { "name" : "SpringMVC" }
      ],
    "title" : "WWW: World Wide Wait? A Performance Comparison of Java Web Frameworks",
    "track" : "Web",
    "type" : "Conference"
  },
  { "experience" : "NOVICE",
    "id" : 982,
    "room" : "Room 3",
    "speaker" : "Martijn Verburg",
    "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405",
    "speakers" : [ { "speaker" : "Martijn Verburg",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/405"
        },
        { "speaker" : "Kim Ross",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1278"
        },
        { "speaker" : "Regina ten Bruggencate",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/219"
        },
        { "speaker" : "Trisha Gee",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/1277"
        },
        { "speaker" : "Antonio Goncalves",
          "speakerUri" : "https://cfp.devoxx.com/rest/v1/events/speakers/116"
        }
      ],
    "summary" : "There's no question that our industry is male dominated.  Many organizations are working hard to get more female developers, and to create products aimed at women.  The first question that people ask is \"Why aren't there more women developers?\", followed closely by \"What can we do to attract more women?\".  This panel will consider these questions, and then possibly throw them out of the window - are these even the right questions to be asking?  Do we actually care about the answers?",
    "tags" : [ { "name" : "Duchess" } ],
    "title" : "Why We Shouldn't Target Women",
    "track" : "Methodology",
    "type" : "Conference"
  }
]