[ { "MP3URL" : "rtmp://s3.parleys.com/parleys/2162/201011301226341311052.mp3",
    "duration" : 2648.9099999999999,
    "id" : 2162,
    "isFree" : false,
    "keywords" : [ { "name" : "Process" },
        { "name" : "jBPM" },
        { "name" : "bpm" },
        { "name" : "activiti" }
      ],
    "speakers" : [ { "bio" : "Tom Baeyens is the founder and lead developer of JBoss jBPM, an open source workflow, BPM and orchestration engine. He is an employee of Red Hat and participates in the Java Community Process.",
          "fullname" : "Tom Baeyens",
          "id" : 468
        },
        { "bio" : "Joram Barrez is a Java/JEE software engineer who recently joined JBoss, a division of Red Hat, as a jBPM core developer. He is extremely passionate about anything related to BPM and workflow systems. Before JBoss, he provided jBPM consultancy for several companies on the Belgian market, so he brings a lot of practical jBPM and BPM experience to the jBPM project. Currently, he is leading the BPMN 2 effort within the jBPM project. Joram is also one of the the co-founders of the Belgium JBoss User Group (http://www.jbug.be/).",
          "fullname" : "Joram Barrez",
          "id" : 469
        }
      ],
    "summary" : "In this session we'll demonstrate these features as well as the different components of the Activiti project.",
    "thumbnail" : "http://a1.parleys.com/p/2162/thumb20101130122034084223.jpg",
    "title" : "Activiti in Action",
    "totalComments" : 1,
    "totalDownloads" : 36,
    "totalViews" : 814,
    "totalVotes" : 2,
    "totalVotesValue" : 2.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2212/201012081546250524546.mp3",
    "duration" : 4154.0900000000001,
    "id" : 2212,
    "isFree" : false,
    "keywords" : [ { "name" : "Ajax" },
        { "name" : "prototype" },
        { "name" : "jquery" },
        { "name" : "javascript" }
      ],
    "speakers" : [ { "bio" : "Nathaniel T. Schutta is a senior software engineer focussed on making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. ",
          "fullname" : "Nathaniel Schutta",
          "id" : 730
        } ],
    "summary" : "Ajax is everywhere, from the local newspaper to sites that the CEO surfs. Contrary to popular belief, it isn't rocket science, especially with the right library. In this talk, we'll explore the popular Prototype and jQuery libraries showing how they can simplify typical Ajax techniques and...",
    "thumbnail" : "http://a1.parleys.com/p/2212/thumb201012081535303134028.jpg",
    "title" : "Ajax Library Smack down: Prototype vs. jQuery - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 44,
    "totalViews" : 412,
    "totalVotes" : 6,
    "totalVotesValue" : 3.1667000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2213/201012081643226646709.mp3",
    "duration" : 4103.0100000000002,
    "id" : 2213,
    "isFree" : false,
    "keywords" : [ { "name" : "Ajax" },
        { "name" : "prototype" },
        { "name" : "jquery" },
        { "name" : "javascript" }
      ],
    "speakers" : [ { "bio" : "Nathaniel T. Schutta is a senior software engineer focussed on making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. ",
          "fullname" : "Nathaniel Schutta",
          "id" : 730
        } ],
    "summary" : "Ajax is everywhere, from the local newspaper to sites that the CEO surfs. Contrary to popular belief, it isn't rocket science, especially with the right library. In this talk, we'll explore the popular Prototype and jQuery libraries showing how they can simplify typical Ajax techniques and...",
    "thumbnail" : "http://a3.parleys.com/p/2213/thumb201012081631469298032.jpg",
    "title" : "Ajax Library Smack down: Prototype vs. jQuery - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 44,
    "totalViews" : 221,
    "totalVotes" : 2,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2089/201011230815434242143.mp3",
    "duration" : 3126.0100000000002,
    "id" : 2089,
    "isFree" : true,
    "keywords" : [ { "name" : "actors" },
        { "name" : "scala" },
        { "name" : "akka" }
      ],
    "speakers" : [ { "bio" : "Viktor Klang is R&D Director and partner at AkkaSource AB, the commercial entity behind Akka. Hailing from southern Sweden, Viktor is a passionate Scala hacker since 2007, a Java enterprise systems architect since 2003 and a programmer since 1998. He's a big fan of agile development, scalable software and elegant code. He's spent the past 7 years building a EIS, ERP, CRM and PDM system for a large international enterprise. After being involved in the Lift web framework for 2 years, he joined the Akka team in the middle of 2009 as one of the earliest committers. ",
          "fullname" : "Viktor Klang",
          "id" : 717
        } ],
    "summary" : "We believe that writing correct concurrent, fault-tolerant and scalable applications is too hard. Most of the time it's because we are using the wrong tools and the wrong level of abstraction. Akka is here to change that. Akka is using the Actor Model together with Software Transactional Memory.",
    "thumbnail" : "http://a2.parleys.com/p/2089/thumb201011230806568547583.jpg",
    "title" : "Akka: Simpler Scalability, Fault-Tolerance, Concurrency & Remoting through Actors",
    "totalComments" : 0,
    "totalDownloads" : 66,
    "totalViews" : 2476,
    "totalVotes" : 9,
    "totalVotesValue" : 3.3332999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2110/201011241651356068727.mp3",
    "duration" : 3598.0100000000002,
    "id" : 2110,
    "isFree" : false,
    "keywords" : [ { "name" : "animations" },
        { "name" : "mobile" },
        { "name" : "android" }
      ],
    "speakers" : [ { "bio" : "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java.",
          "fullname" : "Chet Haase",
          "id" : 356
        },
        { "bio" : "Romain Guy is a software engineer at Google. After spending years having fun with large UIs in Swing, Romain decided to go small and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone user interfaces as fun and exciting as desktop ones",
          "fullname" : "Romain Guy",
          "id" : 349
        }
      ],
    "summary" : "Come learn about what Android has to offer to help you create compelling visuals and animations. This talk will show you advanced effects and present you what new APIs are coming in these areas.",
    "thumbnail" : "http://a2.parleys.com/p/2110/thumb201011241638548516193.jpg",
    "title" : "Android Graphics and Animations",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 601,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2115/201011242005347888586.mp3",
    "duration" : 3780.2399999999998,
    "id" : 2115,
    "isFree" : true,
    "keywords" : [ { "name" : "android" } ],
    "speakers" : [ { "bio" : "Chet Haase is a Java Platform, Standard Edition (Java SE) client architect in the Java Desktop Group. He works with the client teams to make Java technology on the desktop more productive, useful, and successful. This means tracking desktop application development in general and making sure that Java software meets and hopefully exceeds developer requirements. His background is in graphics, both 2D and 3D, so he tend to focus more on graphics-specific issues in general, such as performance and graphical effects for GUI toolkits. He writes about Desktop Java issues such as graphics, performance, and Swing effects on blog at http://weblogs.java.net/blog/chet. Romain Guy is a French student currently working as an intern with the Swing Team at Sun Microsystems. He has 7 years of experience in Java development, as an Open Source and freelance developer. He also works as a freelance journalist for a French computing magazine, as a translator for OReilly and taugh Java in a University. Today Romain focuses on UI design and humane interaction.",
          "fullname" : "Chet  Haase & Romain Guy",
          "id" : 199
        } ],
    "summary" : "Join Romain Guy and Chet Haase from the Android UI Toolkit team at Google as they talk about approaches for developing more effective user interfaces in Android applications. From performance to widgets to layout to animations, you'll learn tons of top techniques that will make your UIs totally terr",
    "thumbnail" : "http://a1.parleys.com/p/2115/thumb201011242004122659188.jpg",
    "title" : "Android UI Development: Tips, Tricks, and Techniques",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 2281,
    "totalVotes" : 4,
    "totalVotesValue" : 3.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2158/201011291959585329423.mp3",
    "duration" : 3593.1799999999998,
    "id" : 2158,
    "isFree" : false,
    "keywords" : [ { "name" : "camel" },
        { "name" : "apache" }
      ],
    "speakers" : [ { "bio" : "Claus Ibsen is a software engineer and integration specialists from FuseSource, the open source division of Progress Software. Claus is project lead on the open source integration framework Apache Camel (http://camel.apache.org) and co-author of the Camel in Action book (http://www.manning.com/ibsen).  Claus is the most active contributor to Apache Camel and is very active in the Camel community. He hang out on the Camel mailing lists, irc-room and often blogs about Camel.  At FuseSource he leads the development of Camel and provides consulting and support to customers. Claus is frequent speaker at FuseSource community day events on subjects related to Camel.  Prior to joining Progress Software, Claus has worked with integration in all sorts for the last decade. ",
          "fullname" : "Claus Ibsen",
          "id" : 754
        } ],
    "summary" : "Apache Camel is getting more and more attraction in the open source space as an integration framework. Also Apache Camel is getting an increased amount of attention as an integration framework within closed source solution, like IBM WebSphere, Oracle, JBoss, etc..    For that reason this t...",
    "thumbnail" : "http://a1.parleys.com/p/2158/thumb201011291951426947018.jpg",
    "title" : "Apache Camel, a powerful open source integration framework",
    "totalComments" : 0,
    "totalDownloads" : 52,
    "totalViews" : 598,
    "totalVotes" : 3,
    "totalVotesValue" : 2.6667000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2164/201011301435108298670.mp3",
    "duration" : 1833.7,
    "id" : 2164,
    "isFree" : false,
    "keywords" : [ { "name" : "URL" },
        { "name" : "Faces" },
        { "name" : "jsf" }
      ],
    "speakers" : [ { "bio" : "Creator of PrettyFaces - Url Rewriting for JSF, PrettyTime  - Social-style date & time formatting for Java, and a community contributor to the JSF2 Expert Group; his latest project is ScrumShark, an open-source agile project management tool.    Beginning his career in C, C++ development for hardware signal testing automation, Lincoln soon moved on to Perl, dynamic programming languages, artificial intelligence and, more recently - web application frameworks such as Java Server Faces and Groovy on Grails for financial and small business solutions.    When he is not swimming, running, or playing Ultimate Frisbee, Lincoln is focused on improving the openness of Java, the Java Community Process(JCP), and bringing the J2EE platform to small businesses and freelancers.",
          "fullname" : "Lincoln Baxter III",
          "id" : 758
        } ],
    "summary" : "Java EE is already the perfect solution for complex business/enterprise systems, and the improvements in JavaServer Faces 2.x provide the perfect chance to reach out to the consumer and small business market; JSF is easier to use than it's ever been before, now making it accessible to busi...",
    "thumbnail" : "http://a3.parleys.com/p/2164/thumb201011301430592242385.jpg",
    "title" : "Beautiful Java EE: URL-rewriting for the next generation web-user",
    "totalComments" : 0,
    "totalDownloads" : 32,
    "totalViews" : 267,
    "totalVotes" : 1,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2160/201011301138337191840.mp3",
    "duration" : 2362.0100000000002,
    "id" : 2160,
    "isFree" : false,
    "keywords" : [ { "name" : "adobe" },
        { "name" : "hbase" },
        { "name" : "nosql" },
        { "name" : "hadoop" }
      ],
    "speakers" : [ { "bio" : "Cosmin Lehene is a computer scientist at Adobe Systems working on infrastructure services with focus on distributed storage and processing. He is a contributor to Apache HBase and Hadoop projects and is one of the main advocates of these technologies inside Adobe. In 2010 he started the http://hstack.org - a team blog about the Hadoop software stack. ",
          "fullname" : "Cosmin Lehene",
          "id" : 757
        } ],
    "summary" : "We've been working with Hadoop and HBase since 2008. In this talk we'll go through different uses cases of computational problems, such as analytics, business intelligence, machine learning on large volumes of data including logs, Flash, image and video metadata, etc. describing some of the most int",
    "thumbnail" : "http://a1.parleys.com/p/2160/thumb201011301132362942910.jpg",
    "title" : "Big Data with HBase and Hadoop at Adobe",
    "totalComments" : 0,
    "totalDownloads" : 28,
    "totalViews" : 290,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2181/201012021105031327060.mp3",
    "duration" : 2696.0100000000002,
    "id" : 2181,
    "isFree" : false,
    "keywords" : [ { "name" : "reporting" },
        { "name" : "BIRT" }
      ],
    "speakers" : [ { "bio" : "Virgil Dodson is a Developer Evangelist at Actuate Corporation (sponsor of the open source BIRT project) and blogger/forum moderator at the BIRT Exchange community site. Virgil has over 13 years experience as a software developer. For the past 6 years he has helped Java developers get started with Actuate's embedded reporting products. He holds a Bachelor of Science degree in Computer Information Systems from DeVry.",
          "fullname" : "Virgil Dodson",
          "id" : 535
        } ],
    "summary" : "Your users expectations are ever increasing the more they use todays rich Internet applications.  In this session, you will learn ways to meet those expectations using the Interactivity features available for BIRT reports. ",
    "thumbnail" : "http://a3.parleys.com/p/2181/thumb201012021058469057506.jpg",
    "title" : "BIRT in Action: Adding Interactivity Features to your BIRT Reports",
    "totalComments" : 0,
    "totalDownloads" : 20,
    "totalViews" : 468,
    "totalVotes" : 1,
    "totalVotesValue" : 2.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2148/201011290838064928643.mp3",
    "duration" : 2630.0100000000002,
    "id" : 2148,
    "isFree" : false,
    "keywords" : [ { "name" : "Ajax" },
        { "name" : "IBM" },
        { "name" : "HTML5" },
        { "name" : "Mashup" }
      ],
    "speakers" : [ { "bio" : "Mehmet Akin is a Software Developer at the IBM Dublin Software Lab in Ireland. He currently works as the UI lead developer of the Lotus Sametime Browser IM Client and SDK. He is co-author of the book Building Dynamic Ajax Applications Using Websphere Feature Pack for Web 2.0. Apart from his day-to-day job he also works as an IBM ITSO instructor, giving workshops around the globe about Web 2.0 development with the Dojo Toolkit. ",
          "fullname" : "Mehmet Akim",
          "id" : 742
        } ],
    "summary" : "Starting with client-side mashup solutions including JSONP, iframes and usage of the browser window object, server-side solutions like Apaches mod_rewrite module or IBMs Ajax Proxy as well as proprietary solutions including browser plug-ins, applets, and signed scripts are explored. ",
    "thumbnail" : "http://a2.parleys.com/p/2148/thumb20101129083205938471.jpg",
    "title" : "Building Mashups: Overview of common techniques and new HTML5 features",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 283,
    "totalVotes" : 1,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2167/201011301624234806209.mp3",
    "duration" : 3275.0100000000002,
    "id" : 2167,
    "isFree" : false,
    "keywords" : [ { "name" : "scaling" },
        { "name" : "microsoft" },
        { "name" : "azure" }
      ],
    "speakers" : [ { "bio" : "Bart Vande Ghinste joined Microsoft Belux back in December 2001 as Solution Architect, focusing on large scale solutions within Microsoft Consulting Services. Today Bart is an Enterprise Architect at the Developer and Platform Group engaging as a trusted adviser to various enterprise customers while being responsible for managing the overall architect audience within Belgium and Luxembourg. The last 10 months Bart is acting as cloud lead assisting enterprise customers and partners in understanding and implementing the Microsoft Cloud Continuum story. ",
          "fullname" : "Bart Vande Ghinste",
          "id" : 755
        } ],
    "summary" : "A proliferation of cloud service providers is happening claiming to provide infrastructure, platform and application services consumable via the cloud. What does this really mean from an IT perspective? Microsoft believes the industry is going through a significant transformation across...",
    "thumbnail" : "http://a1.parleys.com/p/2167/thumb201011301617073348134.jpg",
    "title" : "Building scalable Java applications on Windows Azure",
    "totalComments" : 0,
    "totalDownloads" : 19,
    "totalViews" : 316,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2219/201012091449047771205.mp3",
    "duration" : 5265.4700000000003,
    "id" : 2219,
    "isFree" : false,
    "keywords" : [ { "name" : "mongodb" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "no bio",
          "fullname" : "Alvin Richards",
          "id" : 782
        } ],
    "summary" : "MongoDB (from humongous) is a high-performance, open source, schema-free, non-relational, document-oriented database. We'll present the fundamental principles of MongoDB, how to set up and interact with the database, and what to consider when building applications using a document-based ...",
    "thumbnail" : "http://a1.parleys.com/p/2219/thumb201012091441343345214.jpg",
    "title" : "Building Web Applications with MongoDB - Part 1",
    "totalComments" : 1,
    "totalDownloads" : 54,
    "totalViews" : 1282,
    "totalVotes" : 3,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2220/201012091521126679817.mp3",
    "duration" : 3522.0100000000002,
    "id" : 2220,
    "isFree" : false,
    "keywords" : [ { "name" : "mongodb" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "no bio",
          "fullname" : "Alvin Richards",
          "id" : 782
        } ],
    "summary" : "MongoDB (from humongous) is a high-performance, open source, schema-free, non-relational, document-oriented database. We'll present the fundamental principles of MongoDB, how to set up and interact with the database, and what to consider when building applications using a document-based ...",
    "thumbnail" : "http://a1.parleys.com/p/2220/thumb201012091516577686244.jpg",
    "title" : "Building Web Applications with MongoDB - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 45,
    "totalViews" : 969,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2201/201012071552405338039.mp3",
    "duration" : 4737.0100000000002,
    "id" : 2201,
    "isFree" : false,
    "keywords" : [ { "name" : "twitter" },
        { "name" : "nosql" },
        { "name" : "cassandra" }
      ],
    "speakers" : [ { "bio" : "Jonathan is project chair of Apache Cassandra and co-founder of Riptano, the source for professional Cassandra support.",
          "fullname" : "Jonathan Ellis",
          "id" : 718
        } ],
    "summary" : "Cassandra by Example will teach you how to design a Cassandra data model for your application.  We will cover general principles as well as examples from porting a toy Twitter clone from SQL to Cassandra, with code samples using Hector, the Java Cassandra client. ",
    "thumbnail" : "http://a1.parleys.com/p/2201/thumb201012071541550304065.jpg",
    "title" : "Cassandra by Example - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 612,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2203/201012071646582771159.mp3",
    "duration" : 4659.0100000000002,
    "id" : 2203,
    "isFree" : false,
    "keywords" : [ { "name" : "twitter" },
        { "name" : "nosql" },
        { "name" : "cassandra" }
      ],
    "speakers" : [ { "bio" : "Jonathan is project chair of Apache Cassandra and co-founder of Riptano, the source for professional Cassandra support.",
          "fullname" : "Jonathan Ellis",
          "id" : 718
        } ],
    "summary" : "Cassandra by Example will teach you how to design a Cassandra data model for your application.  We will cover general principles as well as examples from porting a toy Twitter clone from SQL to Cassandra, with code samples using Hector, the Java Cassandra client. ",
    "thumbnail" : "http://a2.parleys.com/p/2203/thumb201012071636437158592.jpg",
    "title" : "Cassandra by Example - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 28,
    "totalViews" : 246,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2118/20101125101550088513.mp3",
    "duration" : 3162.0100000000002,
    "id" : 2118,
    "isFree" : true,
    "keywords" : [ { "name" : "tapestry" },
        { "name" : "rails" },
        { "name" : "wicket" },
        { "name" : "frameworks" },
        { "name" : "struts" },
        { "name" : "gwt" },
        { "name" : "struts2" },
        { "name" : "grails" },
        { "name" : "jvm" },
        { "name" : "jsf" }
      ],
    "speakers" : [ { "bio" : "Matt Raible has been building web applications for most of his adult life. He started tinkering with the web before Netscape 1.0 was even released. For the last 11 years, Matt has helped companies adopt open source technologies (Spring, Hibernate, Apache, Struts, Tapestry, Grails) and use them effectively. Matt has been a speaker at many conferences worldwide, including ApacheCon, JavaZone, Colorado Software Summit, No Fluff Just Stuff, and a host of others.  Matt is an author (Spring Live and Pro JSP), and an active kick-ass technology evangelist on http://raibledesigns.com. He is the founder of AppFuse, a project which allows you to get started quickly with Java frameworks, as well as a committer on the Apache Roller and Apache Struts projects.  For the last few years, Matt has served as the UI Architect for high-traffic web sites such as LinkedIn and Evite. He currently serves as the Chief Architect of Web Development at Time Warner Cable. ",
          "fullname" : "Matt Raible",
          "id" : 737
        } ],
    "summary" : "Frameworks included: Struts 2, Spring MVC, Wicket, JSF, Tapestry, GWT, Grails and Rails",
    "thumbnail" : "http://a1.parleys.com/p/2118/thumb201011250907227944394.jpg",
    "title" : "Comparing JVM Web Frameworks",
    "totalComments" : 0,
    "totalDownloads" : 119,
    "totalViews" : 10908,
    "totalVotes" : 17,
    "totalVotesValue" : 3.4706000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2173/201012011349581452812.mp3",
    "duration" : 3590.0100000000002,
    "id" : 2173,
    "isFree" : false,
    "keywords" : [ { "name" : "hudson" },
        { "name" : "Nexus" },
        { "name" : "CI" },
        { "name" : "maven" }
      ],
    "speakers" : [ { "bio" : "John is a freelance consultant specializing in Enterprise Java, Web Development, and Open Source technologies, currently based in Wellington, New Zealand. Well known in the Java community for his many published articles, John helps organizations to optimize their Java development processes and infrastructures and provides training and mentoring in open source technologies, SDLC tools, and agile development processes. John is principal consultant at Wakaleo Consulting, a company that provides consulting, training and mentoring services in Enterprise Java and Agile Development. John is the author of Java Power Tools",
          "fullname" : "John Smart",
          "id" : 761
        } ],
    "summary" : "Automating your build process with Continuous Integration is great, but why stop there? Why not go the whole nine yards and automate the deployment process as well? Staging and production deployments are typically more complicated and more involved than a simple development deployment, but...",
    "thumbnail" : "http://a3.parleys.com/p/2173/thumb20101201134530383713.jpg",
    "title" : "Continuous Deployment - automated build pipelines with Maven, Nexus and Hudson",
    "totalComments" : 0,
    "totalDownloads" : 53,
    "totalViews" : 1117,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2104/201011241103144637416.mp3",
    "duration" : 3794.8200000000002,
    "id" : 2104,
    "isFree" : false,
    "keywords" : [ { "name" : "ejb3" },
        { "name" : "CDI" },
        { "name" : "J2EE" },
        { "name" : "JPA2" },
        { "name" : "rest" },
        { "name" : "EJB31" },
        { "name" : "JavaEE6" }
      ],
    "speakers" : [ { "bio" : "Consultant and author Adam Bien (blog.adam-bien.com) is an Expert Group member for the Java EE 6, EJB 3.1, and JPA 2.0 JSRs. He has worked with Java technology since JDK 1.0 and Servlets/EJB 1.0 in several large-scale projects and is now an architect and developer in Java SE/EE/FX projects. He has edited several books about Java (FX) and J2EE / Java EE and is the author of Real World J2EE Patterns. Adam is a Java Champion and JavaOne 2009 Rock Star.",
          "fullname" : "Adam Bien",
          "id" : 732
        } ],
    "summary" : "The combination of the Convention over Configuration and Dependency Injection principles, drastically simplifies the Java EE 6 development model. This session covers the approach for building lean, but still maintainable and scalable applications with nothing but plain Java EE 6 technologi...",
    "thumbnail" : "http://a1.parleys.com/p/2104/thumb201011241146286003504.jpg",
    "title" : "Creating Lightweight Applications With Nothing But Vanilla Java EE 6",
    "totalComments" : 1,
    "totalDownloads" : 60,
    "totalViews" : 2070,
    "totalVotes" : 16,
    "totalVotesValue" : 3.3125,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2106/201011241351406048098.mp3",
    "duration" : 3294.0100000000002,
    "id" : 2106,
    "isFree" : true,
    "keywords" : [ { "name" : "Java" },
        { "name" : "findbugs" }
      ],
    "speakers" : [ { "bio" : "William Pugh received a B.S. in Computer Science from Syracuse University and received a Ph.D. in Computer Science (with a minor in Acting) from Cornell University. He is currently a professor at the University of Maryland, College Park.  William Pugh is a Packard Fellow, and invented Skip Lists, a randomized data structure that is widely taught in undergraduate data structure courses.  He has also made research contributions in the fields of incremental computation, implementation of functional and object-oriented languages, the use of partial evaluation for hard real-time systems, in techniques for analyzing and transforming scientific codes for execution on supercomputers, and in a number of issues related to the Java programming language, including the development of JSR 133 - Java Memory Model and Thread Specification Revision.  Prof. Pugh consulted for Google in 2000 - 2003 on research that resulted in US Patent 665 8423, on detecting duplicate and near-duplicate files.  Prof Pugh's current research focus is on developing tools to improve software productivity, reliability and education. Current research projects include FindBugs, a static analysis tool for Java, and Marmoset, an innovative framework for improving the learning and feedback cycle for student programming projects.  Professor Pugh spent the 2008-2009 school year on sabbatical at Google, where, among other activities, he learned how to eat fire. ",
          "fullname" : "William Pugh",
          "id" : 731
        } ],
    "summary" : "As part of this discuss the use of of static analysis in general, and FindBugs 2.0 in particular, as well as details about how FindBugs is being used at Google.",
    "thumbnail" : "http://a3.parleys.com/p/2106/thumb201011241344048006043.jpg",
    "title" : "Defective Java: Mistakes that matter",
    "totalComments" : 0,
    "totalDownloads" : 69,
    "totalViews" : 4316,
    "totalVotes" : 5,
    "totalVotesValue" : 3.3999999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2098/201011231734534773947.mp3",
    "duration" : 3265.0100000000002,
    "id" : 2098,
    "isFree" : true,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "scaling" },
        { "name" : "storage" }
      ],
    "speakers" : [ { "bio" : "George Reese is the author of several books on cloud computing and enterprise technologies. His most recent book is OReillys Cloud Application Architectures. Professionally, he is the founder and CTO of enStratus, the only infrastructure management solution supporting enterprise security and governance for the hybrid cloud. George has also led a number of Open Source projects, including several MUD libraries and the mSQL-JDBC JDBC driver. He is the primary maintainer of Dasein Cloud, a cloud abstraction API for Java.  George holds a BA from Bates College in Maine and an MBA from the Kellogg School of Management at Northwestern University. ",
          "fullname" : "George Reese",
          "id" : 726
        } ],
    "summary" : "Cloud computing is uncovering the weaknesses in the old three-tier web application model. Though server-side Java was built around this model, features of the Java programming language can help you build next-generation web systems that leverage different storage types and operate in a rapidly changing environment.",
    "thumbnail" : "http://a1.parleys.com/p/2098/thumb201011231727347626904.jpg",
    "title" : "Designing Java Systems to Operate at a Cloud Scale",
    "totalComments" : 0,
    "totalDownloads" : 25,
    "totalViews" : 523,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2147/201011290802527464808.mp3",
    "duration" : 3903.6700000000001,
    "id" : 2147,
    "isFree" : true,
    "keywords" : [ { "name" : "WebOS" },
        { "name" : "adobe" },
        { "name" : "android" },
        { "name" : "air" }
      ],
    "speakers" : [ { "bio" : "James Ward is a Technical Evangelist for Flex at Adobe and Adobe's JCP representative to JSR 286, 299, and 301. Much like his love for climbing mountains he enjoys programming because it provides endless new discoveries, elegant workarounds, summits and valleys. His adventures in climbing have taken him many places. Likewise, technology has brought him many adventures, including: Pascal and Assembly back in the early 90's; Perl, HTML, and JavaScript in the mid 90's; then Java and many of it's frameworks beginning in the late 90's. Today he primarily uses Flex to build beautiful front-ends for Java based back-ends. Prior to Adobe, James built a rich marketing and customer service portal for Pillar Data Systems.",
          "fullname" : "James Ward",
          "id" : 249
        },
        { "bio" : "Michaël Chaize is a Flash Platform Evangelist at Adobe where he focuses on Rich Internet Application and Enterprise Integration. Based in Paris, he works with large accounts that need to understand the benefits of rich user interfaces, leverage the existing back-ends to add a rich presentation layer and measure the impact on the existing IT teams. He believes that intuitive user experiences in the Enterprise are key to successful developments of effective, efficient, engaging, easy to learn and error free applications. He loves to promote concepts such as Productivity by design or User Experience oriented architectures. In his previous role, Michael worked as a Technical Sales in France and assumed the promotion of the Flash Platform in front of large audiences of developers and IT managers. Before joining Adobe, Michael founded a software company and taught RIA languages such as Flex and PHP in IT engineering schools. ",
          "fullname" : "Michael Chaize",
          "id" : 725
        }
      ],
    "summary" : "The AIR 2.5 runtime is now available on Android (and soon on Blackberries, WebOS). Using the last release of the Flex framework, you can rapidly develop rich and engaging applications connected to your JAVA back-end. During this session, you'll discover how to code and deploy a mobile app...",
    "thumbnail" : "http://a2.parleys.com/p/2147/thumb201011290758131663635.jpg",
    "title" : "Develop Mobile applications with AIR 2.5",
    "totalComments" : 0,
    "totalDownloads" : 12,
    "totalViews" : 511,
    "totalVotes" : 1,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2191/201012061622390277845.mp3",
    "duration" : 3999.0100000000002,
    "id" : 2191,
    "isFree" : false,
    "keywords" : [ { "name" : "mobile" },
        { "name" : "google" },
        { "name" : "android" }
      ],
    "speakers" : [ { "bio" : "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java.",
          "fullname" : "Chet Haase",
          "id" : 356
        },
        { "bio" : "Romain Guy is a software engineer at Google. After spending years having fun with large UIs in Swing, Romain decided to go small and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone user interfaces as fun and exciting as desktop ones",
          "fullname" : "Romain Guy",
          "id" : 349
        }
      ],
    "summary" : "Come learn about advanced APIs and techniques for Android. Learn about tools, optimizations, tips and tricks to create fancier UIs, etc.",
    "thumbnail" : "http://a2.parleys.com/p/2191/thumb201012061614048165228.jpg",
    "title" : "Dive into Android - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 57,
    "totalViews" : 3678,
    "totalVotes" : 3,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2194/201012061917162428082.mp3",
    "duration" : 4236.0100000000002,
    "id" : 2194,
    "isFree" : false,
    "keywords" : [ { "name" : "mobile" },
        { "name" : "google" },
        { "name" : "android" }
      ],
    "speakers" : [ { "bio" : "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java.",
          "fullname" : "Chet Haase",
          "id" : 356
        },
        { "bio" : "Romain Guy is a software engineer at Google. After spending years having fun with large UIs in Swing, Romain decided to go small and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone user interfaces as fun and exciting as desktop ones",
          "fullname" : "Romain Guy",
          "id" : 349
        }
      ],
    "summary" : "Come learn about advanced APIs and techniques for Android. Learn about tools, optimizations, tips and tricks to create fancier UIs, etc.",
    "thumbnail" : "http://a1.parleys.com/p/2194/thumb201012061908284325068.jpg",
    "title" : "Dive into Android - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 52,
    "totalViews" : 341,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2169/201012011031266032876.mp3",
    "duration" : 3158.0100000000002,
    "id" : 2169,
    "isFree" : true,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "dev/ops" }
      ],
    "speakers" : [ { "bio" : "Coté is analyst at RedMonk covering primarily enterprise software, specializing  in open source, cloud computing, IT management, software development, collaborative, the web, emerging technologies, new media, and  social/collaborative software. He is RedMonks IT Management Lead. His blog is available at http://www.PeopleOverProcess.com and he produces the RedMonk podcast as well as the video podcast RedMonkTV.    Before joining RedMonk, Coté worked at BMC developing the BMC Performance  Manager family of enterprise systems management products. Prior to BMC, Cote worked at a wide variety of tech companies and startups such as The Cobalt Group, Coral Technologies, and one of the first, and still thriving, online banking companies, FundsXpress. He also produces the popular code monkey podcast, DrunkAndRetired.com.    Coté was selected for the Texas Social Media Awards in 2009. Technobabble 2.0, a popular blog about analyst relations, ranked Cotés blog #14 in its ranking of the top 400 analyst blogs (in 2008, he was ranked #8 of the Top 100 analyst blogs). He was recently named the 3rd most regarded analyst in the U.S. and 5th globally by the Institute of Industry Analyst Relations. (Thanks!) He talks with and is quoted by the tech press frequently.",
          "fullname" : "Michael Cote",
          "id" : 734
        },
        { "bio" : "John Willis has worked in the IT management industry for 30 years. He started as a tape operator on an IBM mainframe while working for his high school computer club, and began his professional career at Exxon as an IT infrastructure analyst. He is the founder of four successful startups over the past 20 years and is currently the CEO of his self-funded Zabovo Corp. Willis is known internationally for his IT Management and Cloud blog. He also has two podcast series on clouds called 'Cloud Cafe' and 'Cloud Droplets'. Willis is also the co-host of Redmonk's 'IT Management Guys' podcast series.",
          "fullname" : "John M Willis",
          "id" : 465
        }
      ],
    "summary" : "In this session, Michael Coté and John Willis (the co-hosts of the popular IT Management & Cloud Podcast) will catch you up on what dev/ops is looking like and how it might help (or harm!) you. This session will give you a pragmatic overview of dev/ops and leave with a better idea of how dev/ops...",
    "thumbnail" : "http://a1.parleys.com/p/2169/thumb201012011024281796898.jpg",
    "title" : "Does dev/ops matter for me?",
    "totalComments" : 0,
    "totalDownloads" : 41,
    "totalViews" : 810,
    "totalVotes" : 6,
    "totalVotesValue" : 3.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2125/201011261114465012401.mp3",
    "duration" : 2866.7800000000002,
    "id" : 2125,
    "isFree" : false,
    "keywords" : [ { "name" : "search" },
        { "name" : "cloud" },
        { "name" : "elasticsearch" },
        { "name" : "rest" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "Shay Banon is the founder of the Compass open source project, a unique solution enabling search capabilities into any application model. He started working on mission critical real time C/C++ systems, later moving to Java (and never looked back). Within the Java world, Shay has worked on a propriety implementation of a distributed rule engine(RETE) server, your typical Java based web projects, and messaging based projects within the financial industry. Currently, Shay is a System Architect at GigaSpaces, GigaSpaces provides a single platform for end-to-end scalability of high performance and stateful distributed applications. GigaSpaces' unique approach enables developers to Write their business logic Once and then seamlessly Scale out the application linearly Anywhere.",
          "fullname" : "Shay  Banon",
          "id" : 139
        } ],
    "summary" : "This presentation will cover the basics of ElasticSearch (http://www.elasticsearch.com), an open source, distributed, RESTful, search engine. We will go over what it means to develop a distributed search engine with data grid level features, as well as cover basic elasticsearch functiona...",
    "thumbnail" : "http://a2.parleys.com/p/2125/thumb201011261108327545636.jpg",
    "title" : "ElasticSearch - You Know, for Search",
    "totalComments" : 0,
    "totalDownloads" : 17,
    "totalViews" : 111,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2174/201012011454061956189.mp3",
    "duration" : 3448.0100000000002,
    "id" : 2174,
    "isFree" : false,
    "keywords" : [ { "name" : "encrypting" },
        { "name" : "jvm" },
        { "name" : "security" }
      ],
    "speakers" : [ { "bio" : "Matthew McCullough is an energetic 14 year veteran of software development, open source education, and co-founder of Ambient Ideas, a Denver consultancy. Matthew is a member of the JCP, author of the upcoming Presentation Patterns & Anti-Patterns book, multi-year speaker on the No Fluff Just Stuff tour, author of the DZone Maven, Git & Google App Engine RefCards (3 of the most downloaded cards in DZone history). He channels his teaching energy through activities as President of the Denver Open Source Users Group",
          "fullname" : "Matthew McCullough",
          "id" : 762
        } ],
    "summary" : "In today's data-sensitive and news-sensationalizing world, don't become the next headline by an inadvertent release of private customer or company data. Attend this session to gain a working knowledge of encryption and learn techniques for leveraging Open Source APIs that make securing your data... ",
    "thumbnail" : "http://a1.parleys.com/p/2174/thumb201012011444438251188.jpg",
    "title" : "Encryption Boot Camp on the JVM ",
    "totalComments" : 0,
    "totalDownloads" : 40,
    "totalViews" : 896,
    "totalVotes" : 5,
    "totalVotesValue" : 3.6000000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2180/201012021035298651165.mp3",
    "duration" : 3058.0100000000002,
    "id" : 2180,
    "isFree" : true,
    "keywords" : [ { "name" : "jax-ws" },
        { "name" : "rest" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Stefan Tilkov is co-founder and a prinicipal consultant at innoQ, a consulting firm with offices in Germany and Switzerland. Stefan focuses on enterprise architecture consulting for Fortune 1000 companies, which currently translates to assessing SOA maturity and deriving appropriate steps for a road map towards a service-oriented enterprise.",
          "fullname" : "Stefan  Tilkov",
          "id" : 121
        } ],
    "summary" : "For years, the enterprise IT community used to believe they were the big guys, and those Web folks were just script kiddies building toy apps with PHP. But by now, the really interesting systems are those built on the Web, with non-functional requirements that make even the biggest banking...",
    "thumbnail" : "http://a2.parleys.com/p/2180/thumb201012021027576843563.jpg",
    "title" : "Enterprise IT vs. WWW",
    "totalComments" : 0,
    "totalDownloads" : 36,
    "totalViews" : 2952,
    "totalVotes" : 5,
    "totalVotesValue" : 3.7999999999999998,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2231/201012101343158357518.mp3",
    "duration" : 1838.01,
    "id" : 2231,
    "isFree" : false,
    "keywords" : [ { "name" : "OpenOffice" },
        { "name" : "microsoft" }
      ],
    "speakers" : [ { "bio" : "I am an independent Swiss software developer with extensive experience with core Java and in library and framework API design. I am project lead for http://formulacompiler.org/ and a fairly regular Mercurial contributor, as well as a proponent of literate testing (http://arrenbrecht.ch/testing/).",
          "fullname" : "Peter Arrenbrecht",
          "id" : 773
        } ],
    "summary" : "Make your application compile spreadsheets directly to parametrized, high-performance Java classes for use in your business logic using the Abacus Formula Compiler (http://formulacompiler.org/, available under GPL or commercially).    Why? In many business applications, the calculation of ...",
    "thumbnail" : "http://a3.parleys.com/p/2231/thumb20101210132309445776.jpg",
    "title" : "Excel on the JVM: Generating Fast Code from Spreadsheet Models",
    "totalComments" : 0,
    "totalDownloads" : 34,
    "totalViews" : 1257,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2112/201011241908494094387.mp3",
    "duration" : 3309.0100000000002,
    "id" : 2112,
    "isFree" : false,
    "keywords" : [ { "name" : "websphere" },
        { "name" : "lombardi" },
        { "name" : "bpm" }
      ],
    "speakers" : [ { "bio" : "Jan Van der Sypt has more than 16 years of experience in IBM technologies with focus on object orientation, SOA and BPM. He started his career in application development in Smalltalk, later on he moved to java. As a side activity, he was active in the Object Technology University as instructor for several years. He worked on the San Francisco project. For two years he travelled the world to provide technical assistance to business partners on this java-based framework. As member of the WebSphere BP Enablement team Jan continued to assist his partners throughout Europe on the newly created WebSphere software. After joining SWG again, Jan work in Software Group services for two years and became eventually technical sales for the WebSphere brand. Currently Jan is the WebSphere Specialty Architect for Belgium. ",
          "fullname" : "Jan Van der Sypt",
          "id" : 736
        } ],
    "summary" : "A business developer can play an important role in the success of BPM projects. Despite the proclaimed value, BPM projects tend to be very costly and take too long. As a business developer you have the very important task to guide the business people in the process of transposing business requiremen",
    "thumbnail" : "http://a2.parleys.com/p/2112/thumb20101124190117860451.jpg",
    "title" : "Extend your horizon as business developer: work smarter with WebSphere Lombardi Edition",
    "totalComments" : 0,
    "totalDownloads" : 17,
    "totalViews" : 61,
    "totalVotes" : 1,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2119/201011251219290824340.mp3",
    "duration" : 2591.0100000000002,
    "id" : 2119,
    "isFree" : true,
    "keywords" : [ { "name" : "performance" },
        { "name" : "VisualVM" }
      ],
    "speakers" : [ { "bio" : "Kirk Pepperdine is the Chief Technical Officer at JavaPerformanceTuning.com and has been focused on Object technologies and performance tuning for the last 15 years. Kirk is a co-author of the book ANT Developers Handbook and editor at The Server Side.",
          "fullname" : "Kirk  Pepperdine",
          "id" : 178
        } ],
    "summary" : "As developers and operations gain greater awareness of VisualVM, they often want more. The great news is as VisualVM is built on the NetBeans Rich Client Platform it can be extended in a number of different ways. In this session that is exactly what will be demonstrated. The session will show how on",
    "thumbnail" : "http://a1.parleys.com/p/2119/thumb201011251213382094110.jpg",
    "title" : "Extending VisualVM",
    "totalComments" : 0,
    "totalDownloads" : 22,
    "totalViews" : 376,
    "totalVotes" : 1,
    "totalVotesValue" : 1.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2197/20101207164026760762.mp3",
    "duration" : 3606.0300000000002,
    "id" : 2197,
    "isFree" : false,
    "keywords" : [ { "name" : "gwt" },
        { "name" : "ROO" },
        { "name" : "Spring" }
      ],
    "speakers" : [ { "bio" : "Dr Ben Alex is a Principal Software Engineer with SpringSource, and has been working professionally in software since 1995. Ben founded the Spring Security project in 2003 and led its development into a popular, open-source security framework that is used in numerous government, banking and military installations. More recently Ben founded and serves as lead of the Spring Roo and Spring Shell projects, both of which deliver significant productivity and usability benefits to those using Spring technologies.  Ben's career history also includes other roles in software development and business. From 2005 until 2008, he led the establishment and exponential growth of SpringSource's operations in Asia-Pacific. Prior to SpringSource, Ben founded and grew a successful Australian software company, Acegi Technology Pty Limited. He has been a director and advisor to businesses in diverse industries including business services, intellectual property licensing and ecommerce. ",
          "fullname" : "Ben Alex",
          "id" : 775
        },
        { "bio" : "Dr Stefan Schmidt has been a Software Engineer with SpringSource since early 2008. He is currently based in the Sydney, Australia office, where he has been a key Spring Roo developer since the project began. Stefan's work on Roo focuses on many of the most popular add-ons, including those which provide web, search and messaging features. Stefan has been developing Java enterprise applications since 2003. Prior to his work at SpringSource, Stefan has been teaching various Enterprise Java subjects at the University of Technology in Sydney. He mentored hundreds of students in the design of enterprise software architectures with focus on scalability, separation of concerns and design patterns using enterprise Java technologies.",
          "fullname" : "Stefan Schmidt",
          "id" : 776
        }
      ],
    "summary" : "Delight your customers and impress your colleagues by delivering enterprise Spring applications faster than ever before. In this session we'll introduce Spring Roo, an open source tool that makes it easy to build applications using the Java language, standards and technologies you already ...",
    "thumbnail" : "http://a3.parleys.com/p/2197/thumb201012071249330574400.jpg",
    "title" : "Extreme Productivity with Spring Roo - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 57,
    "totalViews" : 685,
    "totalVotes" : 3,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2199/201012071655124772148.mp3",
    "duration" : 5626.0500000000002,
    "id" : 2199,
    "isFree" : false,
    "keywords" : [ { "name" : "gwt" },
        { "name" : "ROO" },
        { "name" : "Spring" }
      ],
    "speakers" : [ { "bio" : "Dr Ben Alex is a Principal Software Engineer with SpringSource, and has been working professionally in software since 1995. Ben founded the Spring Security project in 2003 and led its development into a popular, open-source security framework that is used in numerous government, banking and military installations. More recently Ben founded and serves as lead of the Spring Roo and Spring Shell projects, both of which deliver significant productivity and usability benefits to those using Spring technologies.  Ben's career history also includes other roles in software development and business. From 2005 until 2008, he led the establishment and exponential growth of SpringSource's operations in Asia-Pacific. Prior to SpringSource, Ben founded and grew a successful Australian software company, Acegi Technology Pty Limited. He has been a director and advisor to businesses in diverse industries including business services, intellectual property licensing and ecommerce. ",
          "fullname" : "Ben Alex",
          "id" : 775
        },
        { "bio" : "Dr Stefan Schmidt has been a Software Engineer with SpringSource since early 2008. He is currently based in the Sydney, Australia office, where he has been a key Spring Roo developer since the project began. Stefan's work on Roo focuses on many of the most popular add-ons, including those which provide web, search and messaging features. Stefan has been developing Java enterprise applications since 2003. Prior to his work at SpringSource, Stefan has been teaching various Enterprise Java subjects at the University of Technology in Sydney. He mentored hundreds of students in the design of enterprise software architectures with focus on scalability, separation of concerns and design patterns using enterprise Java technologies.",
          "fullname" : "Stefan Schmidt",
          "id" : 776
        }
      ],
    "summary" : "Delight your customers and impress your colleagues by delivering enterprise Spring applications faster than ever before. In this session we'll introduce Spring Roo, an open source tool that makes it easy to build applications using the Java language, standards and technologies you already ...",
    "thumbnail" : "http://a3.parleys.com/p/2199/thumb201012071501317163482.jpg",
    "title" : "Extreme Productivity with Spring Roo - Part 2",
    "totalComments" : 3,
    "totalDownloads" : 47,
    "totalViews" : 577,
    "totalVotes" : 3,
    "totalVotesValue" : 1.6667000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2093/201011231233588082090.mp3",
    "duration" : 3543.7600000000002,
    "id" : 2093,
    "isFree" : false,
    "keywords" : [ { "name" : "methodology" },
        { "name" : "JEE" }
      ],
    "speakers" : [ { "bio" : "Franck De Bruijn has been active in the development of enterprise administration software for all his professional life (> 13 years). He worked for companies like Ericsson, UPS Logistics and Logica learning the ropes by passing through a variety of roles: developer, software architect, information analyst and IT manager (see also http://nl.linkedin.com/in/franckdebruijn).  For many years, Franck has studied all aspects of the development of multi-channel purpose-built enterprise administration systems. This resulted in the creation of the Festa Factory platform, which has been put into practice successfully since 2008 for 2 customers. Excited by these results, Franck now aims to bring the Festa Factory as open source product to the JAVA/JEE community. ",
          "fullname" : "Franck De Bruijn",
          "id" : 722
        } ],
    "summary" : "We are currently in the process of redeveloping the Festa Factory platform and have chosen the Devoxx conference as the launch moment. This talk will actually mark the birth of the Festa Factory platform. So, make sure you don't miss out the opportunity to witness this once-in-a-lifetime event!",
    "thumbnail" : "http://a1.parleys.com/p/2093/thumb201011231226302079692.jpg",
    "title" : "Festa Factory: Unmatched Productivity",
    "totalComments" : 0,
    "totalDownloads" : 12,
    "totalViews" : 60,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2121/201011261936054489950.mp3",
    "duration" : 2633.0100000000002,
    "id" : 2121,
    "isFree" : false,
    "keywords" : [ { "name" : "adobe" },
        { "name" : "mobile" },
        { "name" : "flash" },
        { "name" : "android" },
        { "name" : "tablet" }
      ],
    "speakers" : [ { "bio" : "Jan Van Coppenolle is a certified Flex developer and lead Flash platform innovation architect at Xplore. He's got roots in integrated product development and ended up in interface design, multimedia and online echnologies through a series of events since 1996. Currently he's involved in Flex/Flash/AIR development as a project manager, team coach, instructor, researcher and hardcore coding champion.",
          "fullname" : "Jan  Van Coppenolle",
          "id" : 46
        },
        { "bio" : "Filip Maelbrancke is a consultant with iDA MediaFoundry. He spends his time tinkering with the Flash platform, JEE and Android.",
          "fullname" : "Filip Maelbrancke",
          "id" : 740
        }
      ],
    "summary" : "With Flash Player 10.1 being rolled out on smartphones (Android, BlackBerry Tablet OS, ) and the release of AIR 2.5 for Android, mobile development using Flash Platform tools is an exciting possibility. Existing Flex skills and application code-bases can now be leveraged to create new applications ",
    "thumbnail" : "http://a3.parleys.com/p/2121/thumb201011261929543392065.jpg",
    "title" : "Flash Platform Mobile Development",
    "totalComments" : 0,
    "totalDownloads" : 12,
    "totalViews" : 484,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2161/201011301209210776474.mp3",
    "duration" : 3598.0100000000002,
    "id" : 2161,
    "isFree" : true,
    "keywords" : [ { "name" : "flex" },
        { "name" : "adobe" },
        { "name" : "flex4" }
      ],
    "speakers" : [ { "bio" : "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java.",
          "fullname" : "Chet Haase",
          "id" : 356
        } ],
    "summary" : "Flex has always been a great RIA platform. The Flex 4 release makes the platform even more powerful, enabling much more customization with the new component model, flexibility with the new effects framework, and capabilities with the new states syntax. ",
    "thumbnail" : "http://a2.parleys.com/p/2161/thumb20101130120515746570.jpg",
    "title" : "Flex 4 Fun",
    "totalComments" : 0,
    "totalDownloads" : 26,
    "totalViews" : 6085,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2122/20101125164918408572.mp3",
    "duration" : 2706.0100000000002,
    "id" : 2122,
    "isFree" : false,
    "keywords" : [ { "name" : "TDD" },
        { "name" : "methodology" }
      ],
    "speakers" : [ { "bio" : "Steve Freeman is an independent consultant specializing in Agile software development. A founder member of the London Extreme Tuesday Club, he was chair of the first XPDay and is a frequent organizer and presenter at international conferences. Steve has worked in a variety of organizations, from writing shrink-wrap software for IBM, to prototyping for major research laboratories. Steve has a Ph.D. from Cambridge University, and degrees in statistics and music. Steve is based in London, UK.  Nat Pryce has worked as a programmer, architect, trainer, and consultant in a variety of industries, including sports reportage, marketing communications, retail, telecoms, and finance. With a Ph.D. from Imperial College London, he has also worked on research projects and does occasional university teaching. An early adopter of Extreme Programming, he has written or contributed to several open source libraries that support Test Driven Development. He was one of the founding organizers of the London XPDay and regularly presents at international conferences. Nat is based in London, UK.  Steve and Nat Pryce were joint winners of the 2006 Agile Alliance Gordon Pask award, and co-authored Growing Object Oriented Software, Guided by Tests (Addison-Wesley) ",
          "fullname" : "Steve Freeman",
          "id" : 738
        } ],
    "summary" : "Our experience is that putting testing at the front of our development process, and paying attention to what we learn from them, flushes out architectural issues such as concurrency and distribution. The result is systems that are easier both to maintain and to support. We can also avoid some of com",
    "thumbnail" : "http://a1.parleys.com/p/2122/thumb201011251642378557337.jpg",
    "title" : "Fractal TDD - Using tests to drive system design",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 247,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2146/201011290724439872501.mp3",
    "duration" : 2691.4899999999998,
    "id" : 2146,
    "isFree" : false,
    "keywords" : [ { "name" : "DevOps" },
        { "name" : "cloud" },
        { "name" : "agile" }
      ],
    "speakers" : [ { "bio" : "Kris Buytaert is a long time Linux and Open Source Consultant doing Linux and Open Source projects in Belgium , Europe and the rest of the universe. He is currently working for Inuits  Kris is the Co-Author of Virtualization with Xen ,used to be the maintainer of the openMosix HOWTO and author of different technical publications. He is a frequent speaker at different international conferences.    He spends most of his time working on Linux Clustering (both High Availability, Scalability and HPC), Virtualisation and Large Infrastructure Management projects hence trying to build infrastructures that can survive the 10th floor test, better known today as the cloud.  His blog titled Everything is a Freaking DNS Problem can be found at http://www.krisbuytaert.be/blog/",
          "fullname" : "Kris Buytaert",
          "id" : 751
        } ],
    "summary" : "Some call this phenomenon devops, others agile system administration truth is that agile techniques used in development have an impact on the way operations organizes it work. Similar, operations and sysadmins are becoming programmers because of the virtualization and automation trend wher...",
    "thumbnail" : "http://a2.parleys.com/p/2146/thumb201011290720163961977.jpg",
    "title" : "From Dev/Ops to DevOps. Amazing the difference one character can make.",
    "totalComments" : 1,
    "totalDownloads" : 24,
    "totalViews" : 258,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2143/201011290518560096701.mp3",
    "duration" : 3365.2800000000002,
    "id" : 2143,
    "isFree" : false,
    "keywords" : [ { "name" : "gui" },
        { "name" : "design" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration.",
          "fullname" : "Jasper Potts",
          "id" : 308
        },
        { "bio" : "Richard Bair is an application developer with over 7 years experience in writing SQL database front ends. Four of those years were devoted to writing Java applications based on Swing and JDBC. He is currently tasked with working on the back-end components in JDNC for communicating with various data stores such as RDBMS systems, web services, and EJB servers, as well as working on Swing components and general JDNC project management. He joined Sun Microsystems in November of 2004 as a member of the Swing team, working full time on the JDNC project. ",
          "fullname" : "Richard  Bair",
          "id" : 78
        }
      ],
    "summary" : "Successor to the popular Extreme GUI Makeover presentations, Java rockstars Jasper Potts and Richard Bair take a boring enterprise UI and completely rebuild it in JavaFX to be faster, slicker, and incredibly more usable. Todays customers demand rich, usable, productive GUIs. JavaFX exce...",
    "thumbnail" : "http://a1.parleys.com/p/2143/thumb201011290514102591003.jpg",
    "title" : "From Shabby to Chic",
    "totalComments" : 0,
    "totalDownloads" : 14,
    "totalViews" : 94,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2184/201012021346331912366.mp3",
    "duration" : 3645.0100000000002,
    "id" : 2184,
    "isFree" : true,
    "keywords" : [ { "name" : "multicore" },
        { "name" : "scala" },
        { "name" : "collections" }
      ],
    "speakers" : [ { "bio" : "Martin Odersky is a professor at EPFL in Lausanne, Switzerland. His research interests focus on programming languages, more specifically languages for object-oriented and functional programming. His research thesis is that the two paradigms are just two sides of the same coin and should be unified as much as possible. To prove this he has experimented with a number of language designs, from Pizza to GJ to Functional Nets. He has also influenced the development of Java as a co-designer of Java generics and as the original author of the current javac reference compiler. His current work centers around the Scala programming language, which unifies FP and OOP while staying completely interoperable with Java and .NET.",
          "fullname" : "Martin  Odersky",
          "id" : 42
        } ],
    "summary" : "Multicore processors are on every desk now. How are we going to make use of the extra power they provide? Some think that actors or transactional memory will save the day by making concurrent programming easier and safer. Even though these are welcome, I am skeptical about their ultimate s...",
    "thumbnail" : "http://a3.parleys.com/p/2184/thumb201012021338126007157.jpg",
    "title" : "Future-proofing collections: from mutable to persistent to parallel",
    "totalComments" : 0,
    "totalDownloads" : 78,
    "totalViews" : 8109,
    "totalVotes" : 5,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2149/201011291007177003114.mp3",
    "duration" : 3405.0100000000002,
    "id" : 2149,
    "isFree" : true,
    "keywords" : [ { "name" : "methodology" },
        { "name" : "productive" },
        { "name" : "GTD" }
      ],
    "speakers" : [ { "bio" : "Kito D. Mann is an enterprise architect who has developed applications with a wide variety of technologies on several different platforms. He has been working with Java since its debut in 1995, and has written several articles on Java-related products and technologies. Kito has consulted with Fortune 500 clients, including Prudential Financial and J. P. Morgan Chase and Company, and was recently the chief architect of an educational application service provider. He is also the author of JavaServer Faces in Action (Manning) and the founder of JSFCentral.com, a site devoted to the JavaServer Faces community.",
          "fullname" : "Kito  Mann",
          "id" : 167
        } ],
    "summary" : "If you talk to the most well-known developers, whether theyre people within your organization or internationally recognized experts, youll find something in common: theyre productive. Usually, it isnt just dumb luck. More often than not, theyve focused on becoming more productive.",
    "thumbnail" : "http://a2.parleys.com/p/2149/thumb201011290958573817727.jpg",
    "title" : "Getting Things Done for Programmers",
    "totalComments" : 0,
    "totalDownloads" : 50,
    "totalViews" : 740,
    "totalVotes" : 5,
    "totalVotesValue" : 3.7999999999999998,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2085/201011222038151706104.mp3",
    "duration" : 3697.9899999999998,
    "id" : 2085,
    "isFree" : false,
    "keywords" : [ { "name" : "gwt" },
        { "name" : "gwt20" },
        { "name" : "web2.0" }
      ],
    "speakers" : [ { "bio" : "Graeme Rocher is a software engineer, consultant and dynamic language expert who serves as Head of Grails Development at SpringSource (http://www.springsource.com). Graeme is project lead of the open source Grails web application framework (http:// grails.org) and co-author of The Definitive Guide to Grails (Apress - http://apress.com/ book/view/1590599950). In Graeme's current role as Head of Grails Development at SpringSource, the professional open source services company behind the Spring framework, Graeme leads the development of the Grails web framework and provides consulting, training and support to SpringSource's clients. Graeme is a frequent speaker at industry conferences on subjects related to Groovy, Grails and dynamic languages in Java. Prior to joining SpringSource Graeme co-founded G2One - the Groovy/Grails Company - who were later acquired by SpringSource. ",
          "fullname" : "Greame Rocher",
          "id" : 714
        } ],
    "summary" : "Google Web Toolkit (GWT) 2.0 is out and it's a major upgrade from 1.x. Google is using GWT 2.0 for two prominent Google applications: Wave and AdSense. This session will show you how to take advantage of new GWT 2.0 features to implement rich internet applications.",
    "thumbnail" : "http://a3.parleys.com/p/2085/thumb201011221958375863671.jpg",
    "title" : "Google Web Toolkit, Take 2: Implementing Awesome Rich Internet Applications ",
    "totalComments" : 0,
    "totalDownloads" : 26,
    "totalViews" : 333,
    "totalVotes" : 5,
    "totalVotesValue" : 1.25,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2109/201011241631359386228.mp3",
    "duration" : 3489.0100000000002,
    "id" : 2109,
    "isFree" : true,
    "keywords" : [ { "name" : "grails" },
        { "name" : "groovy" }
      ],
    "speakers" : [ { "bio" : "Graeme Rocher is a software engineer, consultant and dynamic language expert who serves as Head of Grails Development at SpringSource (http://www.springsource.com). Graeme is project lead of the open source Grails web application framework (http:// grails.org) and co-author of The Definitive Guide to Grails (Apress - http://apress.com/ book/view/1590599950). In Graeme's current role as Head of Grails Development at SpringSource, the professional open source services company behind the Spring framework, Graeme leads the development of the Grails web framework and provides consulting, training and support to SpringSource's clients. Graeme is a frequent speaker at industry conferences on subjects related to Groovy, Grails and dynamic languages in Java. Prior to joining SpringSource Graeme co-founded G2One - the Groovy/Grails Company - who were later acquired by SpringSource. ",
          "fullname" : "Greame Rocher",
          "id" : 714
        } ],
    "summary" : "Grails provides a dynamic and agile development framework for web applications that is based on the most stable and productive open source libraries, including the Spring framework.",
    "thumbnail" : "http://a2.parleys.com/p/2109/thumb201011241623587683223.jpg",
    "title" : "Grails 1.3 Update",
    "totalComments" : 0,
    "totalDownloads" : 20,
    "totalViews" : 459,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2209/201012081129173766686.mp3",
    "duration" : 6060.8599999999997,
    "id" : 2209,
    "isFree" : false,
    "keywords" : [ { "name" : "Gaelyk" },
        { "name" : "gae" },
        { "name" : "AST" },
        { "name" : "groovy" }
      ],
    "speakers" : [ { "bio" : "Guillaume Laforge est le chef de projet de Groovy, un langage dynamique pour la JVM. Il est également VP Technology de la société G2One, Inc. qui propose des services professionnels autour de Groovy et Grails (formation, support, conseil).  Guillaume est le Spec Lead de JSR-241, le Java Specification Request qui standardise le langage Groovy au sein du Java Community Process. Enfin, Guillaume est le co-auteur du livre Groovy in Action aux éditions Manning.",
          "fullname" : "Guillaume Laforge",
          "id" : 547
        } ],
    "summary" : "Guillaume Laforge, the Groovy project lead, will guide you through all the latest and greatest innovations in the language: new AST transformations, new APIs, and more, to make you a more productive Java developer. Some glimpses of what the future holds for Groovy will also be unveiled. Th...",
    "thumbnail" : "http://a1.parleys.com/p/2209/thumb201012081120057385526.jpg",
    "title" : "Groovy update, ecosystem, and skyrocketing to the cloud with App Engine and Gaelyk! - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 30,
    "totalViews" : 257,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2211/201012090930153226090.mp3",
    "duration" : 4378.0200000000004,
    "id" : 2211,
    "isFree" : false,
    "keywords" : [ { "name" : "Gaelyk" },
        { "name" : "gae" },
        { "name" : "AST" },
        { "name" : "groovy" }
      ],
    "speakers" : [ { "bio" : "Guillaume Laforge est le chef de projet de Groovy, un langage dynamique pour la JVM. Il est également VP Technology de la société G2One, Inc. qui propose des services professionnels autour de Groovy et Grails (formation, support, conseil).  Guillaume est le Spec Lead de JSR-241, le Java Specification Request qui standardise le langage Groovy au sein du Java Community Process. Enfin, Guillaume est le co-auteur du livre Groovy in Action aux éditions Manning.",
          "fullname" : "Guillaume Laforge",
          "id" : 547
        } ],
    "summary" : "Guillaume Laforge, the Groovy project lead, will guide you through all the latest and greatest innovations in the language: new AST transformations, new APIs, and more, to make you a more productive Java developer. Some glimpses of what the future holds for Groovy will also be unveiled. Th...",
    "thumbnail" : "http://a3.parleys.com/p/2211/thumb201012081244422698636.jpg",
    "title" : "Groovy update, ecosystem, and skyrocketing to the cloud with App Engine and Gaelyk! - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 118,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2221/201012091557508922596.mp3",
    "duration" : 1862.01,
    "id" : 2221,
    "isFree" : false,
    "keywords" : [ { "name" : "grails" },
        { "name" : "groovy" },
        { "name" : "eclipse" }
      ],
    "speakers" : [ { "bio" : "Christian joined SpringSource, the company behind the Spring Framework, in 2008 as a Senior Software Engineer. He is a member of the Tools Team based in Vancouver and is responsible for the various tool offerings of SpringSource. Since 2004 Christian is leading the well known Spring IDE open source project that provides development tools for the Spring Portfolio based on Eclipse. Christian has been developing Java enterprise applications since 1997. During this time, Christian designed complex software architectures with a focus on multitiered, web-based, client-server applications using enterprise Java technologies and the Spring Framework. Prior to joining SpringSource, Christian worked as consultant and project manager for one of the leading global technology consulting firms in the financial sector in central Europe. Christian has presented on a variety of enterprise Java topics at conferences such as JAX, W-JAX, SpringOne and The Spring Experience.",
          "fullname" : "Christian  Dupuis",
          "id" : 23
        } ],
    "summary" : "Come and see the latest developments in Groovy and Grails tooling for Eclipse.  We'll look at the great Groovy editing experience based around a sophisticated inferencing engine, and also how support is now in place for many of the standard Eclipse features that developers are so used to w...",
    "thumbnail" : "http://a3.parleys.com/p/2221/thumb201012091555150566758.jpg",
    "title" : "Groovy/Grails Development in Eclipse",
    "totalComments" : 0,
    "totalDownloads" : 39,
    "totalViews" : 1217,
    "totalVotes" : 2,
    "totalVotesValue" : 2.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2099/201011231759200923257.mp3",
    "duration" : 3081.7600000000002,
    "id" : 2099,
    "isFree" : false,
    "keywords" : [ { "name" : "Infinispan" },
        { "name" : "grid" },
        { "name" : "nosql" },
        { "name" : "JBoss" }
      ],
    "speakers" : [ { "bio" : "Manik Surtani is a core R&D engineer at JBoss, a division of Red Hat. He is the founder of the Infinispan project, which he currently leads, and also leads the JBoss Cache project.    His interests lie in cloud and distributed computing, autonomous systems and highly available computing. He has a background in artificial intelligence and neural networks, a field he left behind when he moved from academic circles to the commercial world. Since then, he's been working with Java-related technologies, first for a startup focusing on knowledge management and information exchange, and later for a large London-based consultancy as a tech lead focused on e-commerce applications on large Java EE and peer-to-peer technology.    Surtani is a strong proponent of open source development methodologies, ethos, and collaborative processes, and has been involved in open source since his first forays into computing.",
          "fullname" : "Manik Surtani",
          "id" : 728
        } ],
    "summary" : "Infinispan is a highly scalable open source data grid platform, and has originally been used to alleviate stress on RDBMSs.  Increasingly, it is also used as a NoSQL data store, especially on ephemeral cloud nodes where reliability of disk is not guaranteed.  This talk, by Infinispan found...",
    "thumbnail" : "http://a1.parleys.com/p/2099/thumb201011231800435469990.jpg",
    "title" : "Hacking Infinispan: the new open source data grid meets NoSQL",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 330,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2101/201011231928361773186.mp3",
    "duration" : 3318.0100000000002,
    "id" : 2101,
    "isFree" : true,
    "keywords" : [ { "name" : "hbase" },
        { "name" : "pig" },
        { "name" : "nosql" },
        { "name" : "twitter" },
        { "name" : "cassandra" },
        { "name" : "hadoop" }
      ],
    "speakers" : [ { "bio" : "Dmitriy Ryaboy is currently the Tech Lead for Internal Analytics at Twitter. He is a committer on the Pig project. Previously, Dmitriy worked at Lawrence Berkeley National Laboratory and at Ask.com. Dmitriy holds a bachelor's degree in Computer Science from UC Berkeley and a master's in Very Large Information Systems from Carnegie Mellon University; he interned at Cloudera. You can follow Dmitriy on Twitter, where he goes by @squarecog. ",
          "fullname" : "Dmitriy Ryaboy",
          "id" : 724
        } ],
    "summary" : "I will discuss our experiences using Hadoop, HBase, Cassandra, and Pig to scale Twitter's analytics platform. This talk will focus on the practical aspects of working at scale  the architecture, what works, what doesn't, and the software we've open-sourced to make things easier for others.",
    "thumbnail" : "http://a1.parleys.com/p/2101/thumb201011231920390875428.jpg",
    "title" : "Hadoop and NoSQL at Twitter",
    "totalComments" : 0,
    "totalDownloads" : 69,
    "totalViews" : 12685,
    "totalVotes" : 6,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2229/201012101337494591356.mp3",
    "duration" : 4422.0100000000002,
    "id" : 2229,
    "isFree" : false,
    "keywords" : [ { "name" : "MapReduce" },
        { "name" : "hdfs" },
        { "name" : "nosql" },
        { "name" : "hadoop" },
        { "name" : "hive" }
      ],
    "speakers" : [ { "bio" : "Tom White has been an Apache Hadoop committer since February 2007, and is a member of the Apache Software Foundation. He is the author of Hadoop: The Definitive Guide published by O'Reilly. Previously he worked as an independent consultant specializing in Hadoop, and before that was co-founder and Lead Developer at Kizoom, a UK mobile application startup.  Tom has a Bachelor's degree in Mathematics from the University of Cambridge, and a Master's degree in History and Philosophy of Science from the Universities of Leeds, UK, and Florence, Italy. ",
          "fullname" : "Tom White",
          "id" : 787
        } ],
    "summary" : "This technical tutorial will go over the fundamentals of Hadoop: its distributed filesystem (HDFS) and processing engine (MapReduce), as well as looking at higher-level tools for data analytics (Pig and Hive). Plenty of code examples will be provided throughout. The following areas will be...",
    "thumbnail" : "http://a2.parleys.com/p/2229/thumb201012101234296058190.jpg",
    "title" : "Hadoop Fundamentals: HDFS, MapReduce, Pig, and Hive - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 51,
    "totalViews" : 2485,
    "totalVotes" : 3,
    "totalVotesValue" : 3.3332999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2232/201012101408571052175.mp3",
    "duration" : 3128.0100000000002,
    "id" : 2232,
    "isFree" : false,
    "keywords" : [ { "name" : "MapReduce" },
        { "name" : "nosql" },
        { "name" : "hdfs" },
        { "name" : "hadoop" },
        { "name" : "hive" }
      ],
    "speakers" : [ { "bio" : "Tom White has been an Apache Hadoop committer since February 2007, and is a member of the Apache Software Foundation. He is the author of Hadoop: The Definitive Guide published by O'Reilly. Previously he worked as an independent consultant specializing in Hadoop, and before that was co-founder and Lead Developer at Kizoom, a UK mobile application startup.  Tom has a Bachelor's degree in Mathematics from the University of Cambridge, and a Master's degree in History and Philosophy of Science from the Universities of Leeds, UK, and Florence, Italy. ",
          "fullname" : "Tom White",
          "id" : 786
        } ],
    "summary" : "This technical tutorial will go over the fundamentals of Hadoop: its distributed filesystem (HDFS) and processing engine (MapReduce), as well as looking at higher-level tools for data analytics (Pig and Hive). Plenty of code examples will be provided throughout. The following areas will be...",
    "thumbnail" : "http://a2.parleys.com/p/2232/thumb201012101401098902737.jpg",
    "title" : "Hadoop Fundamentals: HDFS, MapReduce, Pig, and Hive - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 40,
    "totalViews" : 1576,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2123/201011291449377942238.mp3",
    "duration" : 2438.0100000000002,
    "id" : 2123,
    "isFree" : false,
    "keywords" : [ { "name" : "hbase" },
        { "name" : "nosql" },
        { "name" : "hadoop" },
        { "name" : "hive" }
      ],
    "speakers" : [ { "bio" : "Jonathan Gray is a software engineer and open source advocate at Facebook. Jonathan has been an HBase committer for several years, getting his start with HBase at his previous startup Streamy which ran solely on a Hadoop/HBase data stack. At Facebook, Jonathan works with different engineering teams on using, contributing, and releasing open source software related to big data and infrastructure, working with technologies like Hadoop, HBase, Hive, Scribe, and Thrift. ",
          "fullname" : "Jonathan Gray",
          "id" : 739
        } ],
    "summary" : "This talk will discuss real world production use cases of Hadoop, HBase, and Hive. The characteristics of each system will be explained in the context of how they can be used together to build large scale data infrastructure that blurs the line between realtime applications and data warehouses.",
    "thumbnail" : "http://a3.parleys.com/p/2123/thumb201011291444051373964.jpg",
    "title" : "Hadoop, HBase, and Hive in Production",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 1483,
    "totalVotes" : 1,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2145/201011290640572917966.mp3",
    "duration" : 3670.02,
    "id" : 2145,
    "isFree" : false,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "hbase" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "Michael is an HBase committer and member of the  Hadoop management committee.  He works at StumbleUpon.",
          "fullname" : "Michael Stack",
          "id" : 749
        } ],
    "summary" : "This talk will be an overview of HBase, update of the current project status and future work, and a discussion of HBase in production.  Drawing from real world use cases, it will cover what makes HBase different from other NoSQL projects, when it might make sense to use HBase, and how HBas...",
    "thumbnail" : "http://a3.parleys.com/p/2145/thumb201011290636260199579.jpg",
    "title" : "HBase Today",
    "totalComments" : 0,
    "totalDownloads" : 14,
    "totalViews" : 928,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2144/201011290556012388879.mp3",
    "duration" : 3410.0100000000002,
    "id" : 2144,
    "isFree" : false,
    "keywords" : [ { "name" : "JavaEE" },
        { "name" : "HK2" },
        { "name" : "JavaEE6" },
        { "name" : "glassfish" },
        { "name" : "weblogic" }
      ],
    "speakers" : [ { "bio" : "Jérôme Dochez is the GlassFish Architect. He's a Senior Staff Engineer at Sun Microsystems located in Santa Clara, California (USA). Jerome has been working in J2EE technologies since 2000. He was the architect for the Java AVK, then technical lead for deployment and web services. He also provided the Mac OS X support of the GlassFish project. Before J2EE, still in the Java Software organization, he participated to the JavaBeans first specification (with Eduardo Pelegri Llopart) and moved on to create the Java Plug-in. Today, Jerome is the GlassFish architect and overall technical lead. He is looking at the future of the implementation as well as driving the stability of the next release of GlassFish. He still participates to the JSR109 implementation as coding remains a fun part of the job.",
          "fullname" : "Jérôme Dochez",
          "id" : 328
        } ],
    "summary" : "HK2 is an open source initiative from Oracle aimed at helping develop modular software. It is the heart of Oracle GlassFish Server Release 3 and soon will be the heart of Oracle WebLogic Server as well. This session provides an overview of HK2 basics, including the module management isolat...",
    "thumbnail" : "http://a1.parleys.com/p/2144/thumb201011290551137411985.jpg",
    "title" : "HK2: Oracle WebLogic Server, Oracle GlassFish Server, and Beyond",
    "totalComments" : 0,
    "totalDownloads" : 17,
    "totalViews" : 240,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2155/201011291422321447068.mp3",
    "duration" : 3358.0100000000002,
    "id" : 2155,
    "isFree" : true,
    "keywords" : [ { "name" : "prototype" },
        { "name" : "HTML5" },
        { "name" : "jquery" },
        { "name" : "web2.0" }
      ],
    "speakers" : [ { "bio" : "Nathaniel T. Schutta is a senior software engineer focussed on making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. ",
          "fullname" : "Nathaniel Schutta",
          "id" : 730
        } ],
    "summary" : "For the last few years, the web has been all a-twitter about web 2.0 (and even the occasional reference to web 3.0.) Yes, the days of static web applications are officially over and while libraries like jQuery and Prototype make it easier to build modern applications, ultimately they are papering ov",
    "thumbnail" : "http://a1.parleys.com/p/2155/thumb201011291544512404055.jpg",
    "title" : "HTML5 Fact and Fiction",
    "totalComments" : 0,
    "totalDownloads" : 76,
    "totalViews" : 2305,
    "totalVotes" : 10,
    "totalVotesValue" : 3.3999999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2088/201011230154080064125.mp3",
    "duration" : 3214.0500000000002,
    "id" : 2088,
    "isFree" : false,
    "keywords" : [ { "name" : "w3c" },
        { "name" : "HTML5" },
        { "name" : "websockets" },
        { "name" : "XHR" }
      ],
    "speakers" : [ { "bio" : "Jonas Jacobi, co-founder and CEO of Kaazing, is an entrepreneur and visionary with a mission to simplify Web application development and deployment. Prior to co-founding Kaazing, he worked for Oracle for eight years as a Java EE evangelist and product manager responsible for the product management of JavaServer Faces, Oracle ADF Faces, and Oracle ADF Faces Rich Client in the Oracle JDeveloper team. As co-founder and CEO of Kaazing, Jonas oversees all aspects of Kaazing's operations and mission to become a leader in Web infrastructure. He is co-author of the best-selling book, \"Pro JSF and Ajax: Building Rich Internet Components,\" (Apress).",
          "fullname" : "Jonas Jacobi",
          "id" : 361
        } ],
    "summary" : "W3Cs HTML5 standard has rapidly gained momentum as 2010s hottest technology with help from companies, such as Google, Apple, and Microsoft. Developers and businesses alike are all trying to catch and align themselves with this new standard. Out of all the ideas and features in this new s...",
    "thumbnail" : "http://a1.parleys.com/p/2088/thumb201011230150103945422.jpg",
    "title" : "HTML5 Websockets: A New World of Limitless, Live, and Wickedly Cool Web Applications",
    "totalComments" : 0,
    "totalDownloads" : 44,
    "totalViews" : 291,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2165/20101130152540716106.mp3",
    "duration" : 3454.0100000000002,
    "id" : 2165,
    "isFree" : false,
    "keywords" : [ { "name" : "design" },
        { "name" : "methodology" }
      ],
    "speakers" : [ { "bio" : "Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 5 books spanning a variety of technologies. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at  nford@thoughtworks.com.",
          "fullname" : "Neal Ford",
          "id" : 323
        } ],
    "summary" : "This session describes the current thinking about emergent design, discovering design in code. The hazard of Big Design Up Front in software is that you don't yet know what you don't know, and design decisions made too early are just speculations without facts. Emergent design techniques allow you t",
    "thumbnail" : "http://a1.parleys.com/p/2165/thumb201011301517366773589.jpg",
    "title" : "Implementing Emergent Design ",
    "totalComments" : 0,
    "totalDownloads" : 63,
    "totalViews" : 790,
    "totalVotes" : 5,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2185/201012021431041378236.mp3",
    "duration" : 2770.0100000000002,
    "id" : 2185,
    "isFree" : true,
    "keywords" : [ { "name" : "performance" },
        { "name" : "Spring" }
      ],
    "speakers" : [ { "bio" : "Costin Leau, a SpringSource consultant, has been working with Java EE since2000. Costin spends the majority of his time on product development for anumber of Spring and Spring related projects, including Spring-OSGi, Spring's JPAsupport, Pitchfork, and the Spring Modules project, which he leads. In addition,Costin is involved in client consulting and training engagements.While a generalist, Costin has a strong interest in data access and aspect orientedprogramming. Costin is one of the most active Spring Framework Forumcontributors, with more than 3600 posts by early 2007.",
          "fullname" : "Costin  Leau",
          "id" : 3
        } ],
    "summary" : "A pragmatic look on how to achieve easy gains in a Spring application through caching. This session will analyze the usual bottlenecks found in common application stacks and ways to address them. Various caching patterns will be discussed, with focus not just on performance but also scalab...",
    "thumbnail" : "http://a2.parleys.com/p/2185/thumb201012021424542415555.jpg",
    "title" : "Improve the performance of your Spring app",
    "totalComments" : 1,
    "totalDownloads" : 52,
    "totalViews" : 2067,
    "totalVotes" : 3,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2078/201011221430099765344.mp3",
    "duration" : 1420.72,
    "id" : 2078,
    "isFree" : false,
    "keywords" : [ { "name" : "mylyn" },
        { "name" : "IDE" },
        { "name" : "eclipse" }
      ],
    "speakers" : [ { "bio" : "Oliver Gierke is Software Architect at Synyx GmbH & Co. KG located in Karsruhe, Germany. The company focuses on using and developing OpenSource software to provide consulting services and custom development to customers.  Oliver has been into JavaEE development since 2004 and focuses on architecture management, developer productivity and agile methods. He ocassionally writes for German JavaMagazin, speaks at technical events and is project lead of the Hades OpenSource project.",
          "fullname" : "Oliver Gierke",
          "id" : 467
        } ],
    "summary" : "The Mylyn plugin is contained in a lot of Eclipse distributions but quite undiscovered amongst developers nevertheless. Having that said there is an enormous amount of productivity gain to be discovered in this area to free developers from technical and organizational bonds and thus make e...",
    "thumbnail" : "http://a2.parleys.com/p/2078/thumb201011221516130548866.jpg",
    "title" : "Increasing developer productivity with Mylyn",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 225,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2230/201012101248505026806.mp3",
    "duration" : 1813.3,
    "id" : 2230,
    "isFree" : false,
    "keywords" : [ { "name" : "Mahout" },
        { "name" : "analysis" },
        { "name" : "apache" }
      ],
    "speakers" : [ { "bio" : "Isabel Drost is member of the Apache Software Foundation. She is organiser of the Apache Hadoop Get Together in Berlin, was co-organiser of the NoSQL meetup as well as the Berlin Buzzwords 2010 scalability conference. She co-founded Apache Mahout and is active Mahout committer. Isabel is actively engaged with communities of various Apache projects, e.g. Lucene and Hadoop. She is regular speaker at renown conferences on topics related to free software development, scalability, Lucene, Hadoop and Mahout.",
          "fullname" : "Isabel Drost",
          "id" : 789
        } ],
    "summary" : "Today it is easy and comparably cheap to buy hardware capable of storing terrabytes of data. Now we need the tools to put this data to good use: Discovering trends from streamed user generated content, automatic learning approaches supplementing market research processes or recommending it...",
    "thumbnail" : "http://a3.parleys.com/p/2230/thumb201012101245343486303.jpg",
    "title" : "Intelligent data analysis - Apache Mahout",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 1167,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2189/201012061158166179075.mp3",
    "duration" : 4232.2200000000003,
    "id" : 2189,
    "isFree" : false,
    "keywords" : [ { "name" : "wicket" } ],
    "speakers" : [ { "bio" : "Martijn Dashorst is a senior software engineer for Topicus B.V.. He is a committer on the Wicket project and works on many Wicket related projects. When he doesn't work with or on Wicket, he likes to spend time with his girlfriend and two cats.",
          "fullname" : "Martijn Dashorst",
          "id" : 772
        } ],
    "summary" : "Learn how to use Apache Wicket to create web applications on your own from the masters. This hands-on lab will provide a quick introduction to the Wicket framework and we'll start with coding right away. At the basis for this course lies the Wicket in Action book, written by the course lea...",
    "thumbnail" : "http://a3.parleys.com/p/2189/thumb201012061207079805514.jpg",
    "title" : "Introducing Wicket - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 53,
    "totalViews" : 905,
    "totalVotes" : 3,
    "totalVotesValue" : 1.6667000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2190/201012061303415387693.mp3",
    "duration" : 5513.0100000000002,
    "id" : 2190,
    "isFree" : false,
    "keywords" : [ { "name" : "wicket" } ],
    "speakers" : [ { "bio" : "Martijn Dashorst is a senior software engineer for Topicus B.V.. He is a committer on the Wicket project and works on many Wicket related projects. When he doesn't work with or on Wicket, he likes to spend time with his girlfriend and two cats.",
          "fullname" : "Martijn Dashorst",
          "id" : 772
        } ],
    "summary" : "Learn how to use Apache Wicket to create web applications on your own from the masters. This hands-on lab will provide a quick introduction to the Wicket framework and we'll start with coding right away. At the basis for this course lies the Wicket in Action book, written by the course lea...",
    "thumbnail" : "http://a1.parleys.com/p/2190/thumb201012061251363436744.jpg",
    "title" : "Introducing Wicket - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 48,
    "totalViews" : 317,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2082/201011221828279942650.mp3",
    "duration" : 3954.3099999999999,
    "id" : 2082,
    "isFree" : false,
    "keywords" : [ { "name" : "OLTP" },
        { "name" : "nosql" },
        { "name" : "cassandra" }
      ],
    "speakers" : [ { "bio" : "Jonathan is project chair of Apache Cassandra and co-founder of Riptano, the source for professional Cassandra support.",
          "fullname" : "Jonathan Ellis",
          "id" : 718
        } ],
    "summary" : "Cassandra is the leading technology for scalable OLTP applications.  Cassandra seamlessly and transparently scales from one machine to hundreds, and has unmatched support for operating across multiple data centers.  Cassandra is designed from the ground up for high availabilty, and has no ...",
    "thumbnail" : "http://a1.parleys.com/p/2082/thumb201011221751461641066.jpg",
    "title" : "Introduction to Cassandra",
    "totalComments" : 0,
    "totalDownloads" : 39,
    "totalViews" : 936,
    "totalVotes" : 1,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2218/201012091444003481604.mp3",
    "duration" : 5022.0100000000002,
    "id" : 2218,
    "isFree" : false,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "hbase" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "Michael is an HBase committer and member of the  Hadoop management committee.  He works at StumbleUpon.",
          "fullname" : "Michael Stack",
          "id" : 749
        },
        { "bio" : "Jonathan Gray is a software engineer and open source advocate at Facebook. Jonathan has been an HBase committer for several years, getting his start with HBase at his previous startup Streamy which ran solely on a Hadoop/HBase data stack. At Facebook, Jonathan works with different engineering teams on using, contributing, and releasing open source software related to big data and infrastructure, working with technologies like Hadoop, HBase, Hive, Scribe, and Thrift. ",
          "fullname" : "Jonathan Gray",
          "id" : 739
        }
      ],
    "summary" : "This class will be taught by two HBase committers. We'll cover the following topics:            o When is HBase appropriate?            o HBase Architecture            o HBase Data Model            o Schema Modelling            o APIs including MapReduce Integration            o Installing...",
    "thumbnail" : "http://a2.parleys.com/p/2218/thumb20101209143248049826.jpg",
    "title" : "Introduction to HBase - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 37,
    "totalViews" : 1586,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2222/201012091613540342788.mp3",
    "duration" : 2460.0100000000002,
    "id" : 2222,
    "isFree" : false,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "hbase" },
        { "name" : "nosql" }
      ],
    "speakers" : [ { "bio" : "Michael is an HBase committer and member of the  Hadoop management committee.  He works at StumbleUpon.",
          "fullname" : "Michael Stack",
          "id" : 749
        },
        { "bio" : "Jonathan Gray is a software engineer and open source advocate at Facebook. Jonathan has been an HBase committer for several years, getting his start with HBase at his previous startup Streamy which ran solely on a Hadoop/HBase data stack. At Facebook, Jonathan works with different engineering teams on using, contributing, and releasing open source software related to big data and infrastructure, working with technologies like Hadoop, HBase, Hive, Scribe, and Thrift. ",
          "fullname" : "Jonathan Gray",
          "id" : 739
        }
      ],
    "summary" : "This class will be taught by two HBase committers. We'll cover the following topics:            o When is HBase appropriate?            o HBase Architecture            o HBase Data Model            o Schema Modelling            o APIs including MapReduce Integration            o Installing...",
    "thumbnail" : "http://a3.parleys.com/p/2222/thumb201012091608388919946.jpg",
    "title" : "Introduction to HBase - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 37,
    "totalViews" : 1411,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2205/201012071830231352654.mp3",
    "duration" : 2090.4899999999998,
    "id" : 2205,
    "isFree" : false,
    "keywords" : [ { "name" : "OAuth" },
        { "name" : "authentication" }
      ],
    "speakers" : [ { "bio" : "Lukasz Moren is a Research Assistant in Software Developer role in the School of Computing Science at Newcastle University. He is also finishing his MSc studies in Computing Science (Information Systems specialisation) at Military University of Technology in Warsaw, Poland. His final year project is concerned with building scalable Web applications using the Java enterprise architecture. During his studies he was an Erasmus Exchange Student at University of Oulu in Finland.    Apart from his studies Lukasz worked in industry as a JaveEE developer for a Polish insurance company from RSA Group. Before joining Newcastle University he was employed as IBM Technical Consultant. He was a successful participant of Google Summer of Code 2009 working for JBoss on design and implementation of alternative solutions for using Hibernate Search in clustered environments. His interests include cloud computing, distributed systems, web services, identity management and security and privacy.    Lukasz Moren is currently working with Prof. Aad van Moorsel on the SMART project funded by JISC. The project aims to develop an online data access management system based on the User-Managed Access (UMA) Web protocol, a newly proposed technology that expands OAuth V2.0. He is an active participant of UMA Work Group that standardises the UMA protocol.",
          "fullname" : "Lukasz Moren",
          "id" : 779
        } ],
    "summary" : "Web 2.0 technologies have made it possible to migrate traditional desktop applications to the Web, resulting in a rich and dynamic user experience and in expanded functionality. Similarly, RESTful Web services have become a commonly used model for exposing services and their APIs on the We...",
    "thumbnail" : "http://a3.parleys.com/p/2205/thumb201012071934142224794.png",
    "title" : "Introduction to UMA/j – User Managed Access framework",
    "totalComments" : 0,
    "totalDownloads" : 15,
    "totalViews" : 110,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2079/201011222048143266716.mp3",
    "duration" : 4684.0100000000002,
    "id" : 2079,
    "isFree" : false,
    "keywords" : [ { "name" : "adobe" },
        { "name" : "xml" },
        { "name" : "pdf" },
        { "name" : "itext" }
      ],
    "speakers" : [ { "bio" : "Bruno Lowagie is the original developer and one of the current maintainers of iText. He lives in Belgium with his wife and two sons",
          "fullname" : "Bruno Lowagie",
          "id" : 720
        } ],
    "summary" : "This year's Conference Guide is created using iText, a Java-PDF library.  In the first part of the session, we'll examine the guide, and we'll make an inventory of all the possible technical problems that have to be countered if you want to create the guide in an automated way.  We'll have...",
    "thumbnail" : "http://a1.parleys.com/p/2079/thumb201011222042519939757.jpg",
    "title" : "iText in Action, release of the second edition - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 147,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2207/201012081008278331214.mp3",
    "duration" : 4568.4899999999998,
    "id" : 2207,
    "isFree" : false,
    "keywords" : [ { "name" : "adobe" },
        { "name" : "xml" },
        { "name" : "pdf" }
      ],
    "speakers" : [ { "bio" : "Bruno Lowagie is the original developer and one of the current maintainers of iText. He lives in Belgium with his wife and two sons",
          "fullname" : "Bruno Lowagie",
          "id" : 720
        } ],
    "summary" : "This year's Conference Guide is created using iText, a Java-PDF library.  In the first part of the session, we'll examine the guide, and we'll make an inventory of all the possible technical problems that have to be countered if you want to create the guide in an automated way.  We'll have...",
    "thumbnail" : "http://a1.parleys.com/p/2207/thumb201012081002535409062.jpg",
    "title" : "iText in Action, release of the second edition - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 20,
    "totalViews" : 115,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2226/201012100958121231634.mp3",
    "duration" : 1550.01,
    "id" : 2226,
    "isFree" : false,
    "keywords" : [ { "name" : "installer" },
        { "name" : "IzPack" }
      ],
    "speakers" : [ { "bio" : "Julien Ponge is a long-time opensource craftman. He created the IzPack installer framework and has participated in several other projects, including the GlassFish application server in cooperation with Sun Microsystems. Holding a PhD in computer science from UNSW Sydney and UBP Clermont-Ferrand, he is currently an associate professor in computer science at INSA de Lyon and a researcher as part of the Amazones INRIA group. Speaking both industrial and academic languages, he is highly motivated in further developing synergies between those worlds. ",
          "fullname" : "Julien Ponge",
          "id" : 790
        } ],
    "summary" : "End-users who just received a copy of your next great product have high expectations. And they are right so. Don't get their first experience with your hard work screwed by an arcane installation and configuration process!    IzPack is a one-stop solution for packaging, distributing and de...",
    "thumbnail" : "http://a3.parleys.com/p/2226/thumb201012100955582857618.jpg",
    "title" : "IzPack: because you and your end users have installation issues",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 1520,
    "totalVotes" : 5,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2187/201012030941362705563.mp3",
    "duration" : 6236.0100000000002,
    "id" : 2187,
    "isFree" : false,
    "keywords" : [ { "name" : "CDI" },
        { "name" : "JPA2" },
        { "name" : "servlet" },
        { "name" : "EJB31" },
        { "name" : "JavaEE6" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Architecte senior, Antonio Goncalves intervient chez ses clients comme consultant et formateur. Ancien consultant Weblogic chez BEA Systems, il s'est spécialisé depuis 1998 dans l'architecture logicielle et les technologies Java. Antonio est l'auteur du livre Java EE 5 aux éditions Eyrolles, et de Beginning Java EE 6 Platform With GlassFish 3 chez Apress. Il est membre du JCP et intervient sur les JSR 316 (Java EE 6), JSR 317 (JPA 2.0) et JSR 318 (EJB 3.1). Il enseigne également la plate-forme Java EE au Conservatoire National des Arts et Métiers. Il est rédacteur technique pour les sites DevX et developpez.com. Antonio est co-fondateur et co-responsable du Paris Java User Group.",
          "fullname" : "Antonio Goncalves",
          "id" : 301
        },
        { "bio" : "Alexis Moussine-Pouchkine aime le bon vin et les architectures Java. Chez Sun Microsystems, il tient le rôle d'ambassadeur du projet GlassFish, serveur d'application Java EE de nouvelle génération. Ceci lui permet de rencontrer lors de réunions ou de conférences de nombreux développeurs Java et autres utilisateurs de technologies libres. Il blogue régulièrement sur Bistro! (http://blogs.sun.com/alexismp/) TheAquarium (http://blogs.sun.com/theaquarium/) et participe à plusieurs communautés open source, traduit en français des ouvrages techniques autour de Java ou XML et possède une vie en dehors de Java",
          "fullname" : "Alexis Moussine-Pouchkine",
          "id" : 316
        }
      ],
    "summary" : "Last year, Antonio & Alexis presented Java EE 6 in a room full of admirers of this new specification (Java EE 6 was out after Devoxx, mid-december 2009). This time Antonio and Alexis are back with more advanced features on Java EE 6 which is even more powerful than they initially thought! ...",
    "thumbnail" : "http://a3.parleys.com/p/2187/thumb201012030927171051376.jpg",
    "title" : "Java EE 6 Tutorial. Reloaded! - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 62,
    "totalViews" : 1959,
    "totalVotes" : 7,
    "totalVotesValue" : 3.1429,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2188/201012031059408297430.mp3",
    "duration" : 3703.0100000000002,
    "id" : 2188,
    "isFree" : false,
    "keywords" : [ { "name" : "CDI" },
        { "name" : "JPA2" },
        { "name" : "servlet" },
        { "name" : "EJB31" },
        { "name" : "JavaEE6" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Architecte senior, Antonio Goncalves intervient chez ses clients comme consultant et formateur. Ancien consultant Weblogic chez BEA Systems, il s'est spécialisé depuis 1998 dans l'architecture logicielle et les technologies Java. Antonio est l'auteur du livre Java EE 5 aux éditions Eyrolles, et de Beginning Java EE 6 Platform With GlassFish 3 chez Apress. Il est membre du JCP et intervient sur les JSR 316 (Java EE 6), JSR 317 (JPA 2.0) et JSR 318 (EJB 3.1). Il enseigne également la plate-forme Java EE au Conservatoire National des Arts et Métiers. Il est rédacteur technique pour les sites DevX et developpez.com. Antonio est co-fondateur et co-responsable du Paris Java User Group.",
          "fullname" : "Antonio Goncalves",
          "id" : 301
        },
        { "bio" : "Alexis Moussine-Pouchkine aime le bon vin et les architectures Java. Chez Sun Microsystems, il tient le rôle d'ambassadeur du projet GlassFish, serveur d'application Java EE de nouvelle génération. Ceci lui permet de rencontrer lors de réunions ou de conférences de nombreux développeurs Java et autres utilisateurs de technologies libres. Il blogue régulièrement sur Bistro! (http://blogs.sun.com/alexismp/) TheAquarium (http://blogs.sun.com/theaquarium/) et participe à plusieurs communautés open source, traduit en français des ouvrages techniques autour de Java ou XML et possède une vie en dehors de Java",
          "fullname" : "Alexis Moussine-Pouchkine",
          "id" : 316
        }
      ],
    "summary" : "Last year, Antonio & Alexis presented Java EE 6 in a room full of admirers of this new specification (Java EE 6 was out after Devoxx, mid-december 2009). This time Antonio and Alexis are back with more advanced features on Java EE 6 which is even more powerful than they initially thought! ...",
    "thumbnail" : "http://a1.parleys.com/p/2188/thumb201012031051182361044.jpg",
    "title" : "Java EE 6 Tutorial. Reloaded! - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 54,
    "totalViews" : 781,
    "totalVotes" : 1,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2224/201012091648433315227.mp3",
    "duration" : 1846.05,
    "id" : 2224,
    "isFree" : false,
    "keywords" : [ { "name" : "CDI" },
        { "name" : "JPA2" },
        { "name" : "jsf2" },
        { "name" : "JavaEE6" },
        { "name" : "glassfish" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Ludovic Champenois is a Senior Architect at Sun Microsystems, and has been with Sun and Java for the last 10 years. He is one of the tech lead and architect on Sun's Application Server and is responsible to ensure best in class developer experience for Java EE programmers with Sun Application Server and tools. (NetBeans, Studio Enterprise and Studio Creator). Ludovic is also heavily involved in leading Sun's open source initiative (Projects GlassFish, jMaki, Phobos).",
          "fullname" : "Ludovic  Champenois",
          "id" : 191
        } ],
    "summary" : "If you are a Java EE 6 user, your choices for Tooling have never been better. Maybe you have been using a specific tool forever (NetBeans, Eclipse, IntelliJ), and do not have the time of the energy to learn a new one? Join this talk to see the latest developments in the following IDEs arou...",
    "thumbnail" : "http://a2.parleys.com/p/2224/thumb201012091747005783025.jpg",
    "title" : "Java EE 6: Tooling Status: what am I missing?",
    "totalComments" : 0,
    "totalDownloads" : 42,
    "totalViews" : 1104,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2179/201012020800337019111.mp3",
    "duration" : 3799.0100000000002,
    "id" : 2179,
    "isFree" : false,
    "keywords" : [ { "name" : "JavaEE" },
        { "name" : "JPA2" },
        { "name" : "JavaEE6" }
      ],
    "speakers" : [ { "bio" : "Linda DeMichiel is a senior architect in the Java EE Platform group at Sun Microsystems and the chief architect for Enterprise JavaBeans 3.0 and the Java Persistence API. As the Specification Lead for JSR-220, she was responsible for launching and leading the initiatives for Enterprise JavaBeans 3.0 and the Java Persistence API under the Java Community Process.  She has over 20 years of experience in the areas of databases, object persistence, distributed computing, and OO in both industry and research. Before assuming responsibility for EJB, she led the team that implemented Sun's first object/relational persistence product, and worked earlier at IBM on object/relational extensions to both DB2 and the SQL99 standard. She holds a Ph.D. in Computer Science from Stanford University.",
          "fullname" : "Linda  Demichiel",
          "id" : 96
        } ],
    "summary" : "The Java Persistence API is the standard API for object-relational mapping for Java EE and Java SE.  In response to requests from the community, it has been expanded in release 2.0 to include a number of significant new features. ",
    "thumbnail" : "http://a3.parleys.com/p/2179/thumb201012020752049031642.jpg",
    "title" : "Java Persistence 2.0",
    "totalComments" : 0,
    "totalDownloads" : 38,
    "totalViews" : 313,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2168/201012010903351876215.mp3",
    "duration" : 3729.2399999999998,
    "id" : 2168,
    "isFree" : true,
    "keywords" : [ { "name" : "Java" },
        { "name" : "javase" },
        { "name" : "puzzlers" }
      ],
    "speakers" : [ { "bio" : "William Pugh received a B.S. in Computer Science from Syracuse University and received a Ph.D. in Computer Science (with a minor in Acting) from Cornell University. He is currently a professor at the University of Maryland, College Park.  William Pugh is a Packard Fellow, and invented Skip Lists, a randomized data structure that is widely taught in undergraduate data structure courses.  He has also made research contributions in the fields of incremental computation, implementation of functional and object-oriented languages, the use of partial evaluation for hard real-time systems, in techniques for analyzing and transforming scientific codes for execution on supercomputers, and in a number of issues related to the Java programming language, including the development of JSR 133 - Java Memory Model and Thread Specification Revision.  Prof. Pugh consulted for Google in 2000 - 2003 on research that resulted in US Patent 665 8423, on detecting duplicate and near-duplicate files.  Prof Pugh's current research focus is on developing tools to improve software productivity, reliability and education. Current research projects include FindBugs, a static analysis tool for Java, and Marmoset, an innovative framework for improving the learning and feedback cycle for student programming projects.  Professor Pugh spent the 2008-2009 school year on sabbatical at Google, where, among other activities, he learned how to eat fire. ",
          "fullname" : "William Pugh",
          "id" : 731
        },
        { "bio" : "Joshua Bloch is a Principal Engineer at Google. He was previously a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He is the author of the Jolt Award-winning book Effective Java. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia.",
          "fullname" : "Joshua  Bloch",
          "id" : 114
        }
      ],
    "summary" : "How can they do it? How can Josh Bloch and Bill Pugh keep coming up with such great programming puzzlers year after year? They' can't! In this, the eighth installment of the perennial crowd pleaser, Click and Hack the Type-It brothers are truly scraping the bottom of the barrel. But some of the dreg",
    "thumbnail" : "http://a1.parleys.com/p/2168/thumb201012010855026405370.jpg",
    "title" : "Java Puzzlers - Scraping the Bottom of the Barrel",
    "totalComments" : 0,
    "totalDownloads" : 83,
    "totalViews" : 5295,
    "totalVotes" : 15,
    "totalVotesValue" : 3.9333,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2116/201011242147372593159.mp3",
    "duration" : 3224.52,
    "id" : 2116,
    "isFree" : true,
    "keywords" : [ { "name" : "2010" },
        { "name" : "javase7" },
        { "name" : "devoxx" },
        { "name" : "closures" },
        { "name" : "modules" },
        { "name" : "keynote" },
        { "name" : "javase" },
        { "name" : "JDK7" },
        { "name" : "JDK8" }
      ],
    "speakers" : [ { "bio" : "Mark Reinhold is a Principal Engineer at Sun Microsystems, where he works on the Java Platform, Standard Edition, and the OpenJDK Project. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. He was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6. He currently leads the engineering team for the OpenJDK Project and also serves as chair of the OpenJDK Governance Board. Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology.",
          "fullname" : "Mark  Reinhold",
          "id" : 27
        } ],
    "summary" : "During this keynote you'll get an overview of the state of Java SE 7 and beyond.",
    "thumbnail" : "http://a2.parleys.com/p/2116/thumb201011242333503398965.jpg",
    "title" : "Java SE: The Road Ahead",
    "totalComments" : 0,
    "totalDownloads" : 58,
    "totalViews" : 2727,
    "totalVotes" : 5,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2214/201012091033293598131.mp3",
    "duration" : 4749.0100000000002,
    "id" : 2214,
    "isFree" : false,
    "keywords" : [ { "name" : "RIA" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration.",
          "fullname" : "Jasper Potts",
          "id" : 308
        },
        { "bio" : "Richard Bair is an application developer with over 7 years experience in writing SQL database front ends. Four of those years were devoted to writing Java applications based on Swing and JDBC. He is currently tasked with working on the back-end components in JDNC for communicating with various data stores such as RDBMS systems, web services, and EJB servers, as well as working on Swing components and general JDNC project management. He joined Sun Microsystems in November of 2004 as a member of the Swing team, working full time on the JDNC project. ",
          "fullname" : "Richard  Bair",
          "id" : 78
        }
      ],
    "summary" : "JavaFX experts Jasper Potts and Richard Bair start with the basics in this introduction to JavaFX spanning the scenegraph, UI controls, animations, graphics, media, storage, web services, and other core APIs that make up the JavaFX platform. JavaFX was built by application developers for a...",
    "thumbnail" : "http://a1.parleys.com/p/2214/thumb201012091022574651583.jpg",
    "title" : "JavaFX 101 - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 18,
    "totalViews" : 895,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2215/20101209123732622197.mp3",
    "duration" : 5420.0100000000002,
    "id" : 2215,
    "isFree" : false,
    "keywords" : [ { "name" : "RIA" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration.",
          "fullname" : "Jasper Potts",
          "id" : 308
        },
        { "bio" : "Richard Bair is an application developer with over 7 years experience in writing SQL database front ends. Four of those years were devoted to writing Java applications based on Swing and JDBC. He is currently tasked with working on the back-end components in JDNC for communicating with various data stores such as RDBMS systems, web services, and EJB servers, as well as working on Swing components and general JDNC project management. He joined Sun Microsystems in November of 2004 as a member of the Swing team, working full time on the JDNC project. ",
          "fullname" : "Richard  Bair",
          "id" : 78
        }
      ],
    "summary" : "JavaFX experts Jasper Potts and Richard Bair start with the basics in this introduction to JavaFX spanning the scenegraph, UI controls, animations, graphics, media, storage, web services, and other core APIs that make up the JavaFX platform. JavaFX was built by application developers for a...",
    "thumbnail" : "http://a1.parleys.com/p/2215/thumb201012091224448718057.jpg",
    "title" : "JavaFX 101 - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 14,
    "totalViews" : 257,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2183/201012021135517237237.mp3",
    "duration" : 2907.0100000000002,
    "id" : 2183,
    "isFree" : false,
    "keywords" : [ { "name" : "jvm" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Open-source developer and agile manager, Stephen Chin is founder of numerous open-source projects including WidgetFX and JFXtras and Director of Software Engineering at Inovis in Emeryville, CA. He has been working with Java desktop and enterprise technologies for over a decade, and has a passion for improving development technologies and process. Stephen's interest in Java technologies has lead him to start a Java and JavaFX focused blog that is targeted at early technology adopters. He's also the co-author of the Pro JavaFX Platform book.",
          "fullname" : "Stephen Chin",
          "id" : 521
        } ],
    "summary" : "JavaFX Script is going away, but the JavaFX Platform is getting a new face with pure Java APIs. In this session, you will see how you can leverage the new JavaFX 2.0 APIs from a host of different JVM languages, including JRuby, Clojure, Groovy, and Scala.",
    "thumbnail" : "http://a3.parleys.com/p/2183/thumb201012021128190455245.jpg",
    "title" : "JavaFX Your Way: Building JavaFX Applications with Alternative Languages",
    "totalComments" : 0,
    "totalDownloads" : 16,
    "totalViews" : 339,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2182/201012021112343499793.mp3",
    "duration" : 3476.9200000000001,
    "id" : 2182,
    "isFree" : true,
    "keywords" : [ { "name" : "JavaPosse" },
        { "name" : "podcast" }
      ],
    "speakers" : [ { "bio" : "JavaPosse.com Member",
          "fullname" : "Joe Nuxoll",
          "id" : 478
        },
        { "bio" : "JavaPosse.com Member",
          "fullname" : "Dick Wall",
          "id" : 476
        },
        { "bio" : "Bob Lee is a Google software engineer in Mountain View, CA. 'I code, I write, and I speak. I make babies (one so far). I take pictures.' Bob Lee is the founder of the Guice framework and involved with the Java Web Beans specification (JSR-299).",
          "fullname" : "Carl  Quinn",
          "id" : 108
        }
      ],
    "summary" : "Live recording of the JavaPosse session",
    "thumbnail" : "http://a2.parleys.com/p/2182/thumb201012021104055052217.jpg",
    "title" : "JavaPosse Live",
    "totalComments" : 0,
    "totalDownloads" : 34,
    "totalViews" : 423,
    "totalVotes" : 2,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2096/201011231635253611379.mp3",
    "duration" : 3552.6900000000001,
    "id" : 2096,
    "isFree" : true,
    "keywords" : [ { "name" : "Servlet3" },
        { "name" : "rest" },
        { "name" : "EJB31" },
        { "name" : "JavaEE6" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Paul Sandoz is the co-spec lead and implementation lead for JSR 311: Java API for RESTful Web Services. Previous to this Paul has participated in the W3C, ISO and ITU-T standards organizations and contributed to the Glassfish Web services stack on performance related technologies and improvements, namely the standardization, implementation, integration and interoperability of Fast Infoset. ",
          "fullname" : "Paul  Sandoz",
          "id" : 86
        } ],
    "summary" : "First part will focus on how JAX-RS integrates with Java EE 6. Specifically how JAX-RS may be utilized with Servlet 3.0, CDI 1.0 and EJB 3.1. Live coding demonstrations will be presented. Developers will learn how to use JAX-RS with Java EE 6.",
    "thumbnail" : "http://a1.parleys.com/p/2096/thumb20101123164924589408.jpg",
    "title" : "JAX-RS, Java EE 6, and the future",
    "totalComments" : 0,
    "totalDownloads" : 36,
    "totalViews" : 2475,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2192/201012061621062083951.mp3",
    "duration" : 1911.0899999999999,
    "id" : 2192,
    "isFree" : false,
    "keywords" : [ { "name" : "design" },
        { "name" : "methodology" }
      ],
    "speakers" : [ { "bio" : "I am an independent Swiss software developer with extensive experience with core Java and in library and framework API design. I am project lead for http://formulacompiler.org/ and a fairly regular Mercurial contributor, as well as a proponent of literate testing (http://arrenbrecht.ch/testing/).",
          "fullname" : "Peter Arrenbrecht",
          "id" : 773
        } ],
    "summary" : "Everyone writing a library function is designing an API. But do we always take the necessary care? Literate testing is an approach that gently guides you towards that care. You will create usable APIs, with better documentation and the most important tests: code examples. Design becomes a ...",
    "thumbnail" : "http://a3.parleys.com/p/2192/thumb20101206161959991441.jpg",
    "title" : "Literate Testing: Justifying APIs Makes Them Better",
    "totalComments" : 0,
    "totalDownloads" : 39,
    "totalViews" : 212,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "duration" : 0.0,
    "id" : 2069,
    "isFree" : false,
    "keywords" : [ { "name" : "2010" },
        { "name" : "devoxx" },
        { "name" : "LIVE" }
      ],
    "speakers" : [  ],
    "summary" : "Live streaming of the Devoxx 2010 Discussion Panel on Friday",
    "thumbnail" : "http://a3.parleys.com/p/2069/thumb201011131808521039001.png",
    "title" : "LIVE Friday Discussion Panel",
    "totalComments" : 0,
    "totalDownloads" : 0,
    "totalViews" : 355,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "LIVE"
  },
  { "duration" : 0.0,
    "id" : 2068,
    "isFree" : false,
    "keywords" : [ { "name" : "2010" },
        { "name" : "devoxx" },
        { "name" : "LIVE" }
      ],
    "speakers" : [  ],
    "summary" : "Live streaming of the Devoxx 2010 Keynote on Thursday",
    "thumbnail" : "http://a3.parleys.com/p/2068/thumb201011131759348253788.png",
    "title" : "LIVE Thursday Keynote",
    "totalComments" : 0,
    "totalDownloads" : 0,
    "totalViews" : 314,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "LIVE"
  },
  { "duration" : 0.0,
    "id" : 2067,
    "isFree" : false,
    "keywords" : [ { "name" : "2010" },
        { "name" : "devoxx" },
        { "name" : "LIVE" }
      ],
    "speakers" : [  ],
    "summary" : "Live streaming of the Devoxx 2010 Keynotes on Wednesday",
    "thumbnail" : "http://a1.parleys.com/p/2067/thumb201011131748309383774.png",
    "title" : "LIVE Wednesday Keynotes",
    "totalComments" : 0,
    "totalDownloads" : 0,
    "totalViews" : 1171,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "LIVE"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2097/20101123165441673685.mp3",
    "duration" : 3486.7600000000002,
    "id" : 2097,
    "isFree" : false,
    "keywords" : [ { "name" : "http" },
        { "name" : "jms" },
        { "name" : "adobe" },
        { "name" : "flash" },
        { "name" : "websockets" }
      ],
    "speakers" : [ { "bio" : "Michaël Chaize is a Flash Platform Evangelist at Adobe where he focuses on Rich Internet Application and Enterprise Integration. Based in Paris, he works with large accounts that need to understand the benefits of rich user interfaces, leverage the existing back-ends to add a rich presentation layer and measure the impact on the existing IT teams. He believes that intuitive user experiences in the Enterprise are key to successful developments of effective, efficient, engaging, easy to learn and error free applications. He loves to promote concepts such as Productivity by design or User Experience oriented architectures. In his previous role, Michael worked as a Technical Sales in France and assumed the promotion of the Flash Platform in front of large audiences of developers and IT managers. Before joining Adobe, Michael founded a software company and taught RIA languages such as Flex and PHP in IT engineering schools. ",
          "fullname" : "Michael Chaize",
          "id" : 725
        } ],
    "summary" : "Using a combination of Java, JMS, and Flash, data can be visualized in real time on a client. Real-time visualizations can be in dashboards, heat maps, charts, and numerous other interactive controls. Intended for developers looking to create applications with real-time data visualizations, this ses",
    "thumbnail" : "http://a3.parleys.com/p/2097/thumb201011231944231196649.jpg",
    "title" : "Making Real-Time Data Come Alive",
    "totalComments" : 0,
    "totalDownloads" : 15,
    "totalViews" : 122,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2157/201011291832314106971.mp3",
    "duration" : 2588.6599999999999,
    "id" : 2157,
    "isFree" : false,
    "keywords" : [ { "name" : "WebOS" },
        { "name" : "blackberry" },
        { "name" : "iphone" },
        { "name" : "Symbian" },
        { "name" : "android" }
      ],
    "speakers" : [ { "bio" : "Max Katz is a Senior Systems Engineer and Lead RIA Strategist at Exadel. He has been helping customers jump-start their RIA development as well as providing mentoring, consulting, and training. Max is a recognized subject matter expert in the JSF developer community. He has provided JSF/RichFaces training for the past 6 years, presented at many conferences, and written several published articles on JSF-related topics. Max leads Exadels RIA strategy, and oversees a number of open source projects such as Exadel JavaFX Plug-in for Eclipse and Fiji. Max writes about RIA technologies in his blog, http://mkblog.exadel.com, and can be found on Twitter at http://twitter.com/maxkatz. He is an author of Practical RichFaces book (Apress). Max holds a BS in computer science from the University of California, Davis.",
          "fullname" : "Max Katz",
          "id" : 753
        } ],
    "summary" : "There has been a dramatic increase in the number of smart phones and tablet-like devices. This has forced organizations to meet a new requirement that their applications have to work with mobile devices. At same the number and variety of platforms for mobile applications has also increased...",
    "thumbnail" : "http://a1.parleys.com/p/2157/thumb201011291857202873889.jpg",
    "title" : "Mobile Development Choices: Native Apps vs. Web Apps",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 152,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2156/201011291655554745190.mp3",
    "duration" : 2366.0100000000002,
    "id" : 2156,
    "isFree" : false,
    "keywords" : [ { "name" : "Spring" } ],
    "speakers" : [ { "bio" : "Josh Long is the Spring developer advocate. Josh is the lead author on Apress Spring Recipes, 2nd Edition, and a SpringSource committer and contributor. When he's not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. His interests include scalability, BPM, grid processing, mobile computing and so-called smart systems. He blogs at blog.springsource.org or joshlong.com. ",
          "fullname" : "Josh Long",
          "id" : 741
        } ],
    "summary" : "Topics and projects covered will include handling data in cloud and large scale environments, web application support for mobile devices, integration with popular social media services, and secure access to payment services for web commerce applications. Additionally this session will cover the new ",
    "thumbnail" : "http://a2.parleys.com/p/2156/thumb201011291650331968594.jpg",
    "title" : "Modern Application Development with Spring Incorporating Social, Mobile and Cloud",
    "totalComments" : 0,
    "totalDownloads" : 32,
    "totalViews" : 283,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2159/201011301106573907030.mp3",
    "duration" : 1939.01,
    "id" : 2159,
    "isFree" : false,
    "keywords" : [ { "name" : "hudson" },
        { "name" : "CI" },
        { "name" : "agile" },
        { "name" : "bamboo" }
      ],
    "speakers" : [ { "bio" : "Chris Mountford is a Senior Software Engineer at Atlassian, working on JIRA, the issue tracker. He has been developing Java web applications for 11 years but it all started back in 1981 on a Commodore Vic 20 as a video-game-obsessed 8 year old. ",
          "fullname" : "Chris Mountford",
          "id" : 756
        } ],
    "summary" : "As the number of features, tests, supported platforms and the number of developers and customers grows, there comes a time when you need serious engineering in your build if you want any hope of staying Agile.",
    "thumbnail" : "http://a1.parleys.com/p/2159/thumb20101130110151526220.jpg",
    "title" : "Monster Builds and How to Tame Them",
    "totalComments" : 0,
    "totalDownloads" : 40,
    "totalViews" : 157,
    "totalVotes" : 3,
    "totalVotesValue" : 3.3332999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2151/201011291156539547402.mp3",
    "duration" : 2689.0100000000002,
    "id" : 2151,
    "isFree" : true,
    "keywords" : [ { "name" : "JDK" } ],
    "speakers" : [ { "bio" : "Dalibor Topic works as a Java F/OSS Ambassador for Sun Microsystems in Hamburg, Germany. His open source and free software credentials go back to co-maintaining the Kaffe VM, and hacking on GNU Classpath to provide a fully open source runtime for applications written in the Java programming language.  With the advent of OpenJDK, his focus shifted to growing the OpenJDK Community, getting open source Java into the core of GNU/Linux distributions, bringing new ports into the OpenJDK Project, and core Java modularity.",
          "fullname" : "Dalibor Topic",
          "id" : 341
        } ],
    "summary" : "This session will look at the composition and growth of the OpenJDK community and the associated open source projects. We'll take a look at who's writing code for OpenJDK, who's using it, and how successful the project has been in attracting a community of developers interested in contributing to an",
    "thumbnail" : "http://a1.parleys.com/p/2151/thumb201011291107509209276.jpg",
    "title" : "OpenJDK  by Dalibor Topic",
    "totalComments" : 0,
    "totalDownloads" : 34,
    "totalViews" : 528,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2140/201011282315466028336.mp3",
    "duration" : 3643.5,
    "id" : 2140,
    "isFree" : false,
    "keywords" : [ { "name" : "authorization" },
        { "name" : "OpenAM" },
        { "name" : "authentication" },
        { "name" : "AuthZ" }
      ],
    "speakers" : [ { "bio" : "Allan Foster is a founding member of ForgeRock, bringing skills in the entire Identity management space. He has proven skills in Access Management, Federation, and Portal Architectures. Allan is based in Portland, Oregon in the USA, and has worked with the ForgeRock products, as well as prior version of the products for several years. Allan brings 25 years of experience in the development, internet, and Identity management spaces to ForgeRock. Allan's career has reached from Apple Computer inc, to Netscape, AOL, Guru Associates, and Sun Microsystems before joining the team at ForgeRock.",
          "fullname" : "Allan Foster",
          "id" : 748
        } ],
    "summary" : "As web applications become the norm for application delivery mechanisms, there is more and more demand for managing access control at the application framework level.  As is immediately obvious, managing this access control becomes an overwhelming  overhead for the actual application,  and...",
    "thumbnail" : "http://a2.parleys.com/p/2140/thumb201011282321288261062.jpg",
    "title" : "Opensource Authentication and Authorization",
    "totalComments" : 0,
    "totalDownloads" : 24,
    "totalViews" : 238,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2103/201011241012593986410.mp3",
    "duration" : 1942.01,
    "id" : 2103,
    "isFree" : true,
    "keywords" : [ { "name" : "tuning" },
        { "name" : "performance" }
      ],
    "speakers" : [ { "bio" : "Joshua Bloch is a Principal Engineer at Google. He was previously a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He is the author of the Jolt Award-winning book Effective Java. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia.",
          "fullname" : "Joshua  Bloch",
          "id" : 114
        } ],
    "summary" : "Not too long ago, it was reasonably straightforward to predict the performance of computer programs. But as the performance of the underlying systems improved, their performance models got worse; in other words, our ability to predict, or even measure, the performance of a program eroded. In",
    "thumbnail" : "http://a2.parleys.com/p/2103/thumb201011241008441038257.jpg",
    "title" : "Performance Anxiety",
    "totalComments" : 0,
    "totalDownloads" : 174,
    "totalViews" : 17487,
    "totalVotes" : 18,
    "totalVotesValue" : 3.72223333333333,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2152/201011291154130257095.mp3",
    "duration" : 3237.1100000000001,
    "id" : 2152,
    "isFree" : true,
    "keywords" : [ { "name" : "RIA" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration.",
          "fullname" : "Jasper Potts",
          "id" : 308
        },
        { "bio" : "Richard Bair is an application developer with over 7 years experience in writing SQL database front ends. Four of those years were devoted to writing Java applications based on Swing and JDBC. He is currently tasked with working on the back-end components in JDNC for communicating with various data stores such as RDBMS systems, web services, and EJB servers, as well as working on Swing components and general JDNC project management. He joined Sun Microsystems in November of 2004 as a member of the Swing team, working full time on the JDNC project. ",
          "fullname" : "Richard  Bair",
          "id" : 78
        }
      ],
    "summary" : "Based on Gaming JavaFX, the fun and popular talk from Devoxx '09 showing how to use JavaFX to build fun, interesting, and attractive casual games using physics, graphics, animations, and the power of the JavaFX platform. Watch as Jasper Potts and Richard Bair show how JavaFX makes creati...",
    "thumbnail" : "http://a2.parleys.com/p/2152/thumb201011291150231739123.jpg",
    "title" : "Physically Attractive",
    "totalComments" : 0,
    "totalDownloads" : 13,
    "totalViews" : 720,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2105/201011241239205756884.mp3",
    "duration" : 3489.9699999999998,
    "id" : 2105,
    "isFree" : false,
    "keywords" : [ { "name" : "cloud" },
        { "name" : "Morlocks" },
        { "name" : "agile" }
      ],
    "speakers" : [ { "bio" : "Coté is analyst at RedMonk covering primarily enterprise software, specializing  in open source, cloud computing, IT management, software development, collaborative, the web, emerging technologies, new media, and  social/collaborative software. He is RedMonks IT Management Lead. His blog is available at http://www.PeopleOverProcess.com and he produces the RedMonk podcast as well as the video podcast RedMonkTV.    Before joining RedMonk, Coté worked at BMC developing the BMC Performance  Manager family of enterprise systems management products. Prior to BMC, Cote worked at a wide variety of tech companies and startups such as The Cobalt Group, Coral Technologies, and one of the first, and still thriving, online banking companies, FundsXpress. He also produces the popular code monkey podcast, DrunkAndRetired.com.    Coté was selected for the Texas Social Media Awards in 2009. Technobabble 2.0, a popular blog about analyst relations, ranked Cotés blog #14 in its ranking of the top 400 analyst blogs (in 2008, he was ranked #8 of the Top 100 analyst blogs). He was recently named the 3rd most regarded analyst in the U.S. and 5th globally by the Institute of Industry Analyst Relations. (Thanks!) He talks with and is quoted by the tech press frequently.",
          "fullname" : "Michael Cote",
          "id" : 734
        } ],
    "summary" : "As a software developer, what does cloud computing really, pragmatically mean for you? Technologies used by public web companies and now cloud computing are looking to offer a new way to deliver applications by addressing deployment and provisioning concerns. Agile software development has...",
    "thumbnail" : "http://a2.parleys.com/p/2105/thumb201011260957091992377.jpg",
    "title" : "Pragmatic Cloud Computing, or, Dealing with Morlocks, or, Agile Infrastructure",
    "totalComments" : 0,
    "totalDownloads" : 19,
    "totalViews" : 149,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2217/201012091307047568894.mp3",
    "duration" : 5445.5900000000001,
    "id" : 2217,
    "isFree" : false,
    "keywords" : [ { "name" : "methodology" } ],
    "speakers" : [ { "bio" : "Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 5 books spanning a variety of technologies. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at  nford@thoughtworks.com.",
          "fullname" : "Neal Ford",
          "id" : 323
        } ],
    "summary" : "The Productive Programmer consists of two parts: mechanics & practice. In the mechanics section, I identify 4 principles of productivity: acceleration, focus, automation, and canonicality. This session defines the principles and describes their use, but the primary focus of this workshop i...",
    "thumbnail" : "http://a1.parleys.com/p/2217/thumb20101209125836087968.jpg",
    "title" : "Productive Programmer - Part 1",
    "totalComments" : 2,
    "totalDownloads" : 74,
    "totalViews" : 1598,
    "totalVotes" : 4,
    "totalVotesValue" : 3.25,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2216/201012091222566894479.mp3",
    "duration" : 4040.1300000000001,
    "id" : 2216,
    "isFree" : false,
    "keywords" : [ { "name" : "methodology" } ],
    "speakers" : [ { "bio" : "Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 5 books spanning a variety of technologies. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at  nford@thoughtworks.com.",
          "fullname" : "Neal Ford",
          "id" : 323
        } ],
    "summary" : "The Productive Programmer consists of two parts: mechanics & practice. In the mechanics section, I identify 4 principles of productivity: acceleration, focus, automation, and canonicality. This session defines the principles and describes their use, but the primary focus of this workshop i...",
    "thumbnail" : "http://a1.parleys.com/p/2216/thumb201012091215252878034.jpg",
    "title" : "Productive Programmer - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 69,
    "totalViews" : 964,
    "totalVotes" : 2,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2166/20101130155238601540.mp3",
    "duration" : 1719.97,
    "id" : 2166,
    "isFree" : false,
    "keywords" : [ { "name" : "gwt" },
        { "name" : "xml" },
        { "name" : "HTML" }
      ],
    "speakers" : [ { "bio" : "In software business since 1985, designed a large number of successful solutions for various needs and customers. Found his second mother tongue in Java in 1995 and never looked back. In last few years found his niche in software for the mobile people and the interconnection of mobile application with the rest of the world. Despite of the number of projects finished, still gets excited when someone says gee, it just works",
          "fullname" : "Pavel Lahoda",
          "id" : 759
        } ],
    "summary" : "UI is typically created by declaring its elements in XML or HTML and hooking them into Java code later. While both XML and declarative style has its followers, it also carries its own bag of problems (such as fragile dependancy on String-based bindings, excessive typing of angle brackets k...",
    "thumbnail" : "http://a2.parleys.com/p/2166/thumb201011301548223728672.jpg",
    "title" : "Programatic UI - how to build UI and avoid acute chevronitis",
    "totalComments" : 0,
    "totalDownloads" : 28,
    "totalViews" : 148,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2090/201011230915029043055.mp3",
    "duration" : 3450.0100000000002,
    "id" : 2090,
    "isFree" : false,
    "keywords" : [ { "name" : "javase7" },
        { "name" : "project coin" },
        { "name" : "JDK7" }
      ],
    "speakers" : [ { "bio" : "My main focus is on type-system area of javac/javafxc compilers, improving generics/wildcards support (actively improving JLS coverage in that area), improving javac error messages and enhancing interoperability between JavaFX and Java ",
          "fullname" : "Maurizio Cimadamore",
          "id" : 715
        },
        { "bio" : "Joe is currently the lead engineer of Project Coin, the effort to select and implement a set of small Java language changes for JDK 7. He also serves as a member of the JDK 7 release team. Concurrently, Joe continues to be the release manager, lead engineer, and quality lead for OpenJDK 6, an open source implementation of the Java SE 6 platform.A longtime member of the JDK engineering group, Joe was previously specification lead for JSR 269, the Pluggable Annotation Processing API, which delivered a standardized annotation processing API and mirror-based language model into JDK 6 to supersede the earlier apt tool from JDK 5. Joe assisted in implementing the JDK 5 language changes with work spanning core reflection, javac hacking, and general library support.  Joe holds a master's degree in computer science from UC Berkeley and a master's degree in applied math from Stanford University.",
          "fullname" : "Joseph Darcy",
          "id" : 502
        }
      ],
    "summary" : "This talk will discuss recommend uses of the new features and demonstrate IDE support. Additionally, selection considerations, implementation concerns, testing methodologies, and language feature interactions will also be discussed.",
    "thumbnail" : "http://a2.parleys.com/p/2090/thumb20101123090501493786.jpg",
    "title" : "Project Coin: Small Language Changes in JDK 7",
    "totalComments" : 0,
    "totalDownloads" : 37,
    "totalViews" : 655,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2170/201012011151133743179.mp3",
    "duration" : 3458.0300000000002,
    "id" : 2170,
    "isFree" : true,
    "keywords" : [ { "name" : "Lambda" },
        { "name" : "closures" },
        { "name" : "javase" }
      ],
    "speakers" : [ { "bio" : "Brian Goetz has been a professional software developer for more than twenty years. Brian is the author of the very successful 'Java Concurrency in Practice', and has written over 75 articles on Java development. He is one of the primary members of the Java Community Process JSR 166 Expert Group (Concurrency Utilities), and has served on numerous other JCP Expert Groups. Brian is a Sr. Staff Engineer at Sun Microsystems.",
          "fullname" : "Brian  Goetz",
          "id" : 24
        } ],
    "summary" : "OpenJDK's Project Lambda is exploring Java language features designed to increase the productivity of developers working with novel parallel APIs such as the Fork/Join Framework. But in fact, the features being explored will work in conjunction with any API, and strong idioms will be neede...",
    "thumbnail" : "http://a2.parleys.com/p/2170/thumb201012011146294071658.jpg",
    "title" : "Project Lambda: To Multicore and Beyond",
    "totalComments" : 0,
    "totalDownloads" : 45,
    "totalViews" : 642,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2136/201011261643160104049.mp3",
    "duration" : 3143.2399999999998,
    "id" : 2136,
    "isFree" : true,
    "keywords" : [ { "name" : "JPA" },
        { "name" : "jvm" },
        { "name" : "lombok" }
      ],
    "speakers" : [ { "bio" : "Roel Spilker is a technology evangelist at TOPdesk. He's been a professional java programmer and teacher since 1999. Roel has been a fan of compile-time checking. His first open source project to leverage the compiler was the SPI project which simplifies the usage of the Service Provider API. Together with Reinier Zwitserloot he is the inventor of Project Lombok, a compiler/IDE plugin to bring the java programming language into the next decennium.",
          "fullname" : "Roel  Spilker",
          "id" : 513
        },
        { "bio" : "Reinier Zwitserloot is the founder and lead developer of Tipit.to, a web service that enables tipjars on the web. He's been interested in programming language evolution ever since he started working with Java professionally 10 years ago. As a result, together with Roel Spilker he is the inventor of Project Lombok, a compiler/IDE plugin to bring the java programming language into the next decennium.",
          "fullname" : "Reinier  Zwitserloot",
          "id" : 514
        }
      ],
    "summary" : "If there's too much code,  and it don't look good  Who you gonna call?  Boilerplate busters!    In this presentation, the developers of lombok, Reinier Zwitserloot and Roel Spilker, will show the audience what lombok is about, and how you can use it to eliminate boilerplate from your java ...",
    "thumbnail" : "http://a1.parleys.com/p/2136/thumb201011291459158205429.jpg",
    "title" : "Project Lombok: Boilerplate busters",
    "totalComments" : 0,
    "totalDownloads" : 43,
    "totalViews" : 752,
    "totalVotes" : 1,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2086/201011222036221483821.mp3",
    "duration" : 2432.2199999999998,
    "id" : 2086,
    "isFree" : false,
    "keywords" : [ { "name" : "linkedin" },
        { "name" : "nosql" },
        { "name" : "cassandra" },
        { "name" : "Voldemort" }
      ],
    "speakers" : [ { "bio" : "Alex Feinberg is a Senior Software Engineer in the Search, Network and Analytics Team at LinkedIn, working on Project Voldemort. In the past he's done systems programming in the contexts of large scale operations automation, ad serving systems and email security.",
          "fullname" : "Alex Feinberg",
          "id" : 719
        } ],
    "summary" : "Project Voldemort is an open source key/value storage solution inspired by Amazon's Dynamo paper. This talk will cover the features, basic usage, design, uses cases (at LinkedIn and elsewhere) and application design patterns for building products that use Voldemort. Will also present the h...",
    "thumbnail" : "http://a3.parleys.com/p/2086/thumb201011222033296789535.jpg",
    "title" : "Project Voldemort - Reliable distributed storage",
    "totalComments" : 0,
    "totalDownloads" : 26,
    "totalViews" : 143,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2111/201011241837565356805.mp3",
    "duration" : 3545.77,
    "id" : 2111,
    "isFree" : true,
    "keywords" : [ { "name" : "reflection" },
        { "name" : "javase" }
      ],
    "speakers" : [ { "bio" : "Dr. Heinz Kabutz is a Java guru living in Crete. He consults, holds courses, programs, and writes a weekly newsletter in which he shares some rather unconventional insights about Java. Things that push the envelope; make Java do things you thought it could not; dirty tricks and such. In other words, stuff you do not usually find in Java periodicals or newsletters.",
          "fullname" : "Heinz    Kabutz",
          "id" : 172
        } ],
    "summary" : "In this presentation, we will look at some advanced uses of reflection to delegate method calls automatically, to determine where we are being called from and to create new enum values dynamically for unit test purposes, including modifying the switch statements on-the-fly.  We will look a...",
    "thumbnail" : "http://a3.parleys.com/p/2111/thumb201011241840379491811.jpg",
    "title" : "Reflection Madness",
    "totalComments" : 0,
    "totalDownloads" : 48,
    "totalViews" : 747,
    "totalVotes" : 2,
    "totalVotesValue" : 3.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2225/201012091736236825718.mp3",
    "duration" : 1833.53,
    "id" : 2225,
    "isFree" : false,
    "keywords" : [ { "name" : "TDD" },
        { "name" : "rest" }
      ],
    "speakers" : [ { "bio" : "Working for Caelum since 2008 as consultant, developer and instructor. Already talked on important events in Brazil, and participate on several open source projects, such as VRaptor and Restfulie. Also writes technical articles for the Brazilian magazine Mundo Java. Nowadays also develops in Ruby and Rails. Loves to learn new stuffs everyday and share these new knowledges with others.",
          "fullname" : "Adriano Almeida",
          "id" : 785
        } ],
    "summary" : "Restfulie has attained attention in its Java and Ruby releases due to making the use of hypermedia and content negotiation a key point of its functionalities.    The presentation will show from scratch how to code resources on the server side and access them by exchanging resource represen...",
    "thumbnail" : "http://a3.parleys.com/p/2225/thumb20101209171724944558.jpg",
    "title" : "Restfulie: quit pretending, use the web for real",
    "totalComments" : 0,
    "totalDownloads" : 26,
    "totalViews" : 1020,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2227/201012101043232537080.mp3",
    "duration" : 1906.01,
    "id" : 2227,
    "isFree" : false,
    "keywords" : [ { "name" : "rest" },
        { "name" : "scalable" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Marc Portier is co-founder and managing partner of Outerthought, a Belgian software company on the crossroads and the forefront of open source and Java-based internet development. Marc has been professionally involved with Java since the early days, using it as the code and framework for all aspects of the web-application experience.  Outerthought produces the Open Source Content Management system Daisy CMS\", and covers support, custom development, consulting and advise around it. They have now developed Kauri\", a technical innovative web-application framework (open source) that leverages the combined advantages of the RIA (ajax) and ROA (ReST) approaches.",
          "fullname" : "Marc Portier",
          "id" : 560
        } ],
    "summary" : "The 'new web' is about user-centric UIs, about improved state management, and about fast prototyping of flexible web applications. However, non-functional requirements for web-centric ventures are also about providing scalability and availability without much extra cost. Scaling out to the...",
    "thumbnail" : "http://a2.parleys.com/p/2227/thumb20101210103058050884.jpg",
    "title" : "Scalable and RESTful web applications: at the crossroads of Kauri and Lily",
    "totalComments" : 0,
    "totalDownloads" : 42,
    "totalViews" : 1218,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2202/20101207160733024345.mp3",
    "duration" : 5377.8199999999997,
    "id" : 2202,
    "isFree" : false,
    "keywords" : [ { "name" : "JSR299" },
        { "name" : "CDI" },
        { "name" : "bpm" },
        { "name" : "EJB31" },
        { "name" : "seam" },
        { "name" : "jsf" }
      ],
    "speakers" : [ { "bio" : "Pete Muir is a core developer on JBoss Seam, an application framework for enterprise Java, and on JBoss RichFaces, a rich component library for JSF.  He is currently employeed by Red Hat Inc. working on JBoss open source projects.",
          "fullname" : "Peter  Muir",
          "id" : 38
        },
        { "bio" : "Dan Allen is a passionate Java EE software developer, consultant, and author of Seam in Action with over eight years of development experience using technologies that include Java frameworks (Seam, JSF, EJB3, Hibernate, Spring, Struts), testing frameworks (JUnit, TestNG), JavaScript and DOM scripting, CSS and page layouts, Maven 2, Ant, Groovy, and many others.  After graduating from Cornell University with a degree in Materials Science and Engineering in 2000, Dan became captivated by the world of free and open source software, which gave him his debut in software development. He soon discovered the combination of Linux and the Java EE platform to be the ideal blend on which to build his professional career, with his interests equally divided between the two platforms.  Dan is also a dedicated open source advocate, a committer on the Seam project, an active participant in the Seam community, and a Java blogger. You can keep up with Dan's development experiences by subscribing to his blog at http://mojavelinux.com.",
          "fullname" : "Dan Allen",
          "id" : 351
        }
      ],
    "summary" : "Seam is a powerful open source development platform for building rich Internet applications in Java EE, now rebuilt on JSR-299: Contexts and Dependency Injection for Java EE. JSR-299 is an elegant set of new services that include dependency injection, contextual lifecycle management, confi...",
    "thumbnail" : "http://a1.parleys.com/p/2202/thumb201012071856176611461.jpg",
    "title" : "Seam 3: State of the Union - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 409,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2204/201012071826157087512.mp3",
    "duration" : 4195.96,
    "id" : 2204,
    "isFree" : false,
    "keywords" : [ { "name" : "JSR299" },
        { "name" : "CDI" },
        { "name" : "bpm" },
        { "name" : "EJB31" },
        { "name" : "seam" },
        { "name" : "jsf" }
      ],
    "speakers" : [ { "bio" : "Pete Muir is a core developer on JBoss Seam, an application framework for enterprise Java, and on JBoss RichFaces, a rich component library for JSF.  He is currently employeed by Red Hat Inc. working on JBoss open source projects.",
          "fullname" : "Peter  Muir",
          "id" : 38
        },
        { "bio" : "Dan Allen is a passionate Java EE software developer, consultant, and author of Seam in Action with over eight years of development experience using technologies that include Java frameworks (Seam, JSF, EJB3, Hibernate, Spring, Struts), testing frameworks (JUnit, TestNG), JavaScript and DOM scripting, CSS and page layouts, Maven 2, Ant, Groovy, and many others.  After graduating from Cornell University with a degree in Materials Science and Engineering in 2000, Dan became captivated by the world of free and open source software, which gave him his debut in software development. He soon discovered the combination of Linux and the Java EE platform to be the ideal blend on which to build his professional career, with his interests equally divided between the two platforms.  Dan is also a dedicated open source advocate, a committer on the Seam project, an active participant in the Seam community, and a Java blogger. You can keep up with Dan's development experiences by subscribing to his blog at http://mojavelinux.com.",
          "fullname" : "Dan Allen",
          "id" : 351
        }
      ],
    "summary" : "Seam is a powerful open source development platform for building rich Internet applications in Java EE, now rebuilt on JSR-299: Contexts and Dependency Injection for Java EE. JSR-299 is an elegant set of new services that include dependency injection, contextual lifecycle management, confi...",
    "thumbnail" : "http://a1.parleys.com/p/2204/thumb201012080914349376760.jpg",
    "title" : "Seam 3: State of the Union - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 20,
    "totalViews" : 208,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2177/201012011711078653156.mp3",
    "duration" : 2042.01,
    "id" : 2177,
    "isFree" : false,
    "keywords" : [ { "name" : "jax-ws" },
        { "name" : "soa" },
        { "name" : "rest" }
      ],
    "speakers" : [ { "bio" : "Pending",
          "fullname" : "Yves Vanbeethoven",
          "id" : 763
        } ],
    "summary" : "Service Oriented Architecture (SOA) have been a hot topic for years. But what value can it still bring today? Here is Accentures view on current and future technology trends in the market and how we bring these technologies to life with our clients.",
    "thumbnail" : "http://a3.parleys.com/p/2177/thumb201012011706339674833.jpg",
    "title" : "SOA in practice ",
    "totalComments" : 0,
    "totalDownloads" : 27,
    "totalViews" : 216,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2223/201012091625123637269.mp3",
    "duration" : 2021.4100000000001,
    "id" : 2223,
    "isFree" : false,
    "keywords" : [ { "name" : "Ajax" },
        { "name" : "SOLoist" },
        { "name" : "UML" }
      ],
    "speakers" : [ { "bio" : "Dr. Dragan Milicev is Associate Professor and Chairman of the Software Engineering Department at the University of Belgrade, Faculty of Electrical Engineering (www.etf.rs). He is specialized in software engineering, model-driven development, UML, object-oriented programming, software architecture and design, and information systems. He has published papers in some of the most prestigious scientific and professional journals and magazines (including IEEE Transactions on Software Engineering), contributing to the theory and practice of model-driven development and UML. He is also a member of the program committees of two most prestigious international conferences on model-based engineering (MODELS and ECMFA). ",
          "fullname" : "Dragan Milicev",
          "id" : 783
        } ],
    "summary" : "A new Java-based framework for rapid development of enterprise Web applications is presented. We will:  -address some of the main issues that hamper software development in commonly used approaches: level of abstraction and accidental complexity  -show how UML models with executable sema...",
    "thumbnail" : "http://a3.parleys.com/p/2223/thumb201012091622281933366.jpg",
    "title" : "SOLoist: A Java-Based Framework for Model-Driven Development of Enterprise Web Applications with Executable UML",
    "totalComments" : 0,
    "totalDownloads" : 24,
    "totalViews" : 894,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2108/201011241522128827572.mp3",
    "duration" : 3866.02,
    "id" : 2108,
    "isFree" : true,
    "keywords" : [ { "name" : "servlet" },
        { "name" : "jsf2" },
        { "name" : "Spring" },
        { "name" : "JavaEE6" }
      ],
    "speakers" : [ { "bio" : "Juergen Hoeller is the co-founder of the Spring Framework project. Juergen has been the most active Spring developer since the open source project began from Rod's Interface21 framework back in February 2003. Juergen and Rod together continue to provide the direction for Spring. Juergen has earned great respect in the Spring and J2EE communities for his energy, the quality of his code, his incredible attention to detail, and his huge contribution in Spring forums and mailing lists. Juergen is an experienced consultant, with outstanding expertise in web applications, transaction management, O/R mapping technologies, and lightweight remoting. He has specialized in J2EE since early 2000, having held technology leader positions in various projects ranging from enterprise application integration to web-based data visualization. Juergen is co-author of J2EE without EJB.",
          "fullname" : "Juergen  Hoeller",
          "id" : 31
        } ],
    "summary" : "Spring 3.1 (scheduled for GA in Q4 2010) continues Spring's mission with a focus on next-generation web applications. The key themes include conversation management and comprehensive support for Servlet 3.0 and JSF 2.0.  This talk presents Spring 3 as a modern annotation-oriented application framework in the world of Java EE 6 and RIA. General component model trends will be discussed along with selected Spring 3.1 feature highlights in the web space.",
    "thumbnail" : "http://a3.parleys.com/p/2108/thumb201011241542275371626.jpg",
    "title" : "Spring 3.1 - Themes and Trends",
    "totalComments" : 0,
    "totalDownloads" : 58,
    "totalViews" : 3519,
    "totalVotes" : 2,
    "totalVotesValue" : 3.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2175/201012011423153639936.mp3",
    "duration" : 1917.01,
    "id" : 2175,
    "isFree" : false,
    "keywords" : [ { "name" : "ROO" },
        { "name" : "Spring" }
      ],
    "speakers" : [ { "bio" : "Christian joined SpringSource, the company behind the Spring Framework, in 2008 as a Senior Software Engineer. He is a member of the Tools Team based in Vancouver and is responsible for the various tool offerings of SpringSource. Since 2004 Christian is leading the well known Spring IDE open source project that provides development tools for the Spring Portfolio based on Eclipse. Christian has been developing Java enterprise applications since 1997. During this time, Christian designed complex software architectures with a focus on multitiered, web-based, client-server applications using enterprise Java technologies and the Spring Framework. Prior to joining SpringSource, Christian worked as consultant and project manager for one of the leading global technology consulting firms in the financial sector in central Europe. Christian has presented on a variety of enterprise Java topics at conferences such as JAX, W-JAX, SpringOne and The Spring Experience.",
          "fullname" : "Christian  Dupuis",
          "id" : 23
        } ],
    "summary" : "Spring started off to greatly increase the developer productivity; and as you all know successfully delivered on that promise. But there is more SpringSource can do to make your life as a developer more productive. In this session, we will demo current state-of-art developer tools for Spri...",
    "thumbnail" : "http://a1.parleys.com/p/2175/thumb201012011419180326705.jpg",
    "title" : "Spring Developer Tools to push your Productivity",
    "totalComments" : 0,
    "totalDownloads" : 36,
    "totalViews" : 240,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2153/201011291227445484802.mp3",
    "duration" : 2538.0100000000002,
    "id" : 2153,
    "isFree" : false,
    "keywords" : [ { "name" : "TDD" },
        { "name" : "rest" },
        { "name" : "jax-rs" }
      ],
    "speakers" : [ { "bio" : "Jan Algermissen is founder and principal consultant at NORD Software Consulting. NORD provides integration architecture management consulting to major publishing, legal and industrial companies. Jan's primary focus is the application of Web architecture to enterprise IT. Jan has been consulting and developing distributed systems for over 15 years and has been an expert for Web architecture for the last 8 years. Jan is author of numerous articles on REST and RESTful Web services and member of the JAX-RS (JSR 311) expert group and the Microsoft WCF HTTP advisory board.",
          "fullname" : "Jan Algermissen",
          "id" : 752
        } ],
    "summary" : "Testing is an aspect of developing RESTful Web services that is still underrepresented in public discussions. Nevertheless it is an important topic in distributed system development in order to ensure implementation quality and manage system changes over time. ",
    "thumbnail" : "http://a2.parleys.com/p/2153/thumb201011291224271613201.jpg",
    "title" : "Testing RESTful Web Services",
    "totalComments" : 0,
    "totalDownloads" : 38,
    "totalViews" : 299,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2095/201011231604568287946.mp3",
    "duration" : 3057.0100000000002,
    "id" : 2095,
    "isFree" : false,
    "keywords" : [ { "name" : "ehcache" },
        { "name" : "caching" },
        { "name" : "terracotta" }
      ],
    "speakers" : [ { "bio" : "Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology. ",
          "fullname" : "Greg Luck",
          "id" : 727
        } ],
    "summary" : "In this talk we will start with a performance problem and lead you through solving it with caching, discovering a long the way the problems of distributed caching and their solution. This will equip you with the tools to analyze a performance situation and to see whether a cache will help and what type of cache to apply.",
    "thumbnail" : "http://a2.parleys.com/p/2095/thumb201011231558127178171.jpg",
    "title" : "The essence of Caching ",
    "totalComments" : 0,
    "totalDownloads" : 49,
    "totalViews" : 441,
    "totalVotes" : 3,
    "totalVotesValue" : 3.3332999999999999,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2094/201011231425323563258.mp3",
    "duration" : 3698.8499999999999,
    "id" : 2094,
    "isFree" : true,
    "keywords" : [ { "name" : "2010" },
        { "name" : "JUG" },
        { "name" : "devoxx" },
        { "name" : "jcp" },
        { "name" : "keynote" },
        { "name" : "javase" }
      ],
    "speakers" : [ { "bio" : "Bill Venners is president of Artima Software, Inc. and editor-in- chief of Artima Developer. He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platforms architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Bill has been active in the Jini Community since its inception. He led the Jini Community ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services.",
          "fullname" : "Bill  Venners",
          "id" : 4
        },
        { "bio" : "Joshua Bloch is a Principal Engineer at Google. He was previously a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He is the author of the Jolt Award-winning book Effective Java. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia.",
          "fullname" : "Joshua  Bloch",
          "id" : 114
        },
        { "bio" : "Stephan Colebourne has worked with Java since version 1.0, and contributed to open source software since 2000. My work includes Joda-Time, JSR 310 (Date and Time API) and Apache Jakarta Commons. I was elected a Java Champion in 2007.",
          "fullname" : "Stephen  Colebourne",
          "id" : 99
        },
        { "bio" : "Mark Reinhold is a Principal Engineer at Sun Microsystems, where he works on the Java Platform, Standard Edition, and the OpenJDK Project. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. He was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6. He currently leads the engineering team for the OpenJDK Project and also serves as chair of the OpenJDK Governance Board. Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology.",
          "fullname" : "Mark  Reinhold",
          "id" : 27
        },
        { "bio" : "Architecte senior, Antonio Goncalves intervient chez ses clients comme consultant et formateur. Ancien consultant Weblogic chez BEA Systems, il s'est spécialisé depuis 1998 dans l'architecture logicielle et les technologies Java. Antonio est l'auteur du livre Java EE 5 aux éditions Eyrolles, et de Beginning Java EE 6 Platform With GlassFish 3 chez Apress. Il est membre du JCP et intervient sur les JSR 316 (Java EE 6), JSR 317 (JPA 2.0) et JSR 318 (EJB 3.1). Il enseigne également la plate-forme Java EE au Conservatoire National des Arts et Métiers. Il est rédacteur technique pour les sites DevX et developpez.com. Antonio est co-fondateur et co-responsable du Paris Java User Group.",
          "fullname" : "Antonio Goncalves",
          "id" : 301
        },
        { "bio" : "Juergen Hoeller is the co-founder of the Spring Framework project. Juergen has been the most active Spring developer since the open source project began from Rod's Interface21 framework back in February 2003. Juergen and Rod together continue to provide the direction for Spring. Juergen has earned great respect in the Spring and J2EE communities for his energy, the quality of his code, his incredible attention to detail, and his huge contribution in Spring forums and mailing lists. Juergen is an experienced consultant, with outstanding expertise in web applications, transaction management, O/R mapping technologies, and lightweight remoting. He has specialized in J2EE since early 2000, having held technology leader positions in various projects ranging from enterprise application integration to web-based data visualization. Juergen is co-author of J2EE without EJB.",
          "fullname" : "Juergen  Hoeller",
          "id" : 31
        }
      ],
    "summary" : "Lets discuss the future of Java, the language, platform, eco-system, community with input from Oracle, Google, SpringSource, a JCP member, a JUG leader and functional language expert.  The discussion panel will be moderated by our JavaPosse friends: Dick Wall and Joe Nuxoll.",
    "thumbnail" : "http://a1.parleys.com/p/2094/thumb201011231909211504601.jpg",
    "title" : "The Future of Java Discussion Panel",
    "totalComments" : 1,
    "totalDownloads" : 88,
    "totalViews" : 9412,
    "totalVotes" : 19,
    "totalVotesValue" : 4.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2126/201011261141436047190.mp3",
    "duration" : 3590.0100000000002,
    "id" : 2126,
    "isFree" : true,
    "keywords" : [ { "name" : "2010" },
        { "name" : "cloud" },
        { "name" : "devoxx" },
        { "name" : "Java EE" },
        { "name" : "keynote" },
        { "name" : "JavaEE6" }
      ],
    "speakers" : [ { "bio" : "Jerome Dochez is an experienced speaker with more than 11 years of speaking presence at JavaOne, 3 years at Jazoon et various Sun Tech Days events.  He is the GlassFish architect, who successfully lead the modularization effort of the monolithic GlassFish V2 implementation into more than 200 individually reusable OSGi bundles.  Despite being an architect, Jerome still spends most of his days writing code. ",
          "fullname" : "Jerome Dochez",
          "id" : 729
        },
        { "bio" : "Paul Sandoz is the co-spec lead and implementation lead for JSR 311: Java API for RESTful Web Services. Previous to this Paul has participated in the W3C, ISO and ITU-T standards organizations and contributed to the Glassfish Web services stack on performance related technologies and improvements, namely the standardization, implementation, integration and interoperability of Fast Infoset. ",
          "fullname" : "Paul  Sandoz",
          "id" : 86
        },
        { "bio" : "Linda DeMichiel is a senior architect in the Java EE Platform group at Sun Microsystems and the chief architect for Enterprise JavaBeans 3.0 and the Java Persistence API. As the Specification Lead for JSR-220, she was responsible for launching and leading the initiatives for Enterprise JavaBeans 3.0 and the Java Persistence API under the Java Community Process.  She has over 20 years of experience in the areas of databases, object persistence, distributed computing, and OO in both industry and research. Before assuming responsibility for EJB, she led the team that implemented Sun's first object/relational persistence product, and worked earlier at IBM on object/relational extensions to both DB2 and the SQL99 standard. She holds a Ph.D. in Computer Science from Stanford University.",
          "fullname" : "Linda  Demichiel",
          "id" : 96
        }
      ],
    "summary" : "The Future Roadmap of Java EE",
    "thumbnail" : "http://a3.parleys.com/p/2126/thumb201011261133079726830.jpg",
    "title" : "The Future Roadmap of Java EE",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 3871,
    "totalVotes" : 4,
    "totalVotesValue" : 2.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2091/201011231155569994515.mp3",
    "duration" : 3221.0100000000002,
    "id" : 2091,
    "isFree" : false,
    "keywords" : [ { "name" : "JPA" },
        { "name" : "Criteria API" },
        { "name" : "JPA2" },
        { "name" : "Persistance" },
        { "name" : "hibernate" }
      ],
    "speakers" : [ { "bio" : "Linda DeMichiel is a senior architect in the Java EE Platform group at Sun Microsystems and the chief architect for Enterprise JavaBeans 3.0 and the Java Persistence API. As the Specification Lead for JSR-220, she was responsible for launching and leading the initiatives for Enterprise JavaBeans 3.0 and the Java Persistence API under the Java Community Process.  She has over 20 years of experience in the areas of databases, object persistence, distributed computing, and OO in both industry and research. Before assuming responsibility for EJB, she led the team that implemented Sun's first object/relational persistence product, and worked earlier at IBM on object/relational extensions to both DB2 and the SQL99 standard. She holds a Ph.D. in Computer Science from Stanford University.",
          "fullname" : "Linda  Demichiel",
          "id" : 96
        } ],
    "summary" : "The new Criteria API is one of the most significant additions to JPA in the JPA 2.0 release. This API enables the writing of both static and dynamic object-based queries, and provides all of the functionality of the Java Persistence query language and more. ",
    "thumbnail" : "http://a2.parleys.com/p/2091/thumb201011231948245128083.jpg",
    "title" : "The Java Persistence Criteria API",
    "totalComments" : 0,
    "totalDownloads" : 29,
    "totalViews" : 287,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2233/201012101506137957350.mp3",
    "duration" : 5392.21,
    "id" : 2233,
    "isFree" : false,
    "keywords" : [ { "name" : "flex" },
        { "name" : "adobe" },
        { "name" : "mobile" },
        { "name" : "air" }
      ],
    "speakers" : [ { "bio" : "James Ward is a Technical Evangelist for Flex at Adobe and Adobe's JCP representative to JSR 286, 299, and 301. Much like his love for climbing mountains he enjoys programming because it provides endless new discoveries, elegant workarounds, summits and valleys. His adventures in climbing have taken him many places. Likewise, technology has brought him many adventures, including: Pascal and Assembly back in the early 90's; Perl, HTML, and JavaScript in the mid 90's; then Java and many of it's frameworks beginning in the late 90's. Today he primarily uses Flex to build beautiful front-ends for Java based back-ends. Prior to Adobe, James built a rich marketing and customer service portal for Pillar Data Systems.",
          "fullname" : "James Ward",
          "id" : 249
        },
        { "bio" : "Michaël Chaize is a Flash Platform Evangelist at Adobe where he focuses on Rich Internet Application and Enterprise Integration. Based in Paris, he works with large accounts that need to understand the benefits of rich user interfaces, leverage the existing back-ends to add a rich presentation layer and measure the impact on the existing IT teams. He believes that intuitive user experiences in the Enterprise are key to successful developments of effective, efficient, engaging, easy to learn and error free applications. He loves to promote concepts such as Productivity by design or User Experience oriented architectures. In his previous role, Michael worked as a Technical Sales in France and assumed the promotion of the Flash Platform in front of large audiences of developers and IT managers. Before joining Adobe, Michael founded a software company and taught RIA languages such as Flex and PHP in IT engineering schools. ",
          "fullname" : "Michael Chaize",
          "id" : 725
        }
      ],
    "summary" : "During this session, well discover the new Flex 4 framework associated with Flash Builder 4 (Eclipse plug-in to develop Flex apps) and how your rich front-end can exchange objects with your JAVA server. If you wish to develop Desktop applications, then youll be interested by the new feat...",
    "thumbnail" : "http://a3.parleys.com/p/2233/thumb201012101459180386429.jpg",
    "title" : "The latest innovations of the Adobe Flash Platform for Java developers - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 20,
    "totalViews" : 1255,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2234/201012101650533981490.mp3",
    "duration" : 4510.0100000000002,
    "id" : 2234,
    "isFree" : false,
    "keywords" : [ { "name" : "flex" },
        { "name" : "adobe" },
        { "name" : "mobile" },
        { "name" : "air" }
      ],
    "speakers" : [ { "bio" : "James Ward is a Technical Evangelist for Flex at Adobe and Adobe's JCP representative to JSR 286, 299, and 301. Much like his love for climbing mountains he enjoys programming because it provides endless new discoveries, elegant workarounds, summits and valleys. His adventures in climbing have taken him many places. Likewise, technology has brought him many adventures, including: Pascal and Assembly back in the early 90's; Perl, HTML, and JavaScript in the mid 90's; then Java and many of it's frameworks beginning in the late 90's. Today he primarily uses Flex to build beautiful front-ends for Java based back-ends. Prior to Adobe, James built a rich marketing and customer service portal for Pillar Data Systems.",
          "fullname" : "James Ward",
          "id" : 249
        },
        { "bio" : "Michaël Chaize is a Flash Platform Evangelist at Adobe where he focuses on Rich Internet Application and Enterprise Integration. Based in Paris, he works with large accounts that need to understand the benefits of rich user interfaces, leverage the existing back-ends to add a rich presentation layer and measure the impact on the existing IT teams. He believes that intuitive user experiences in the Enterprise are key to successful developments of effective, efficient, engaging, easy to learn and error free applications. He loves to promote concepts such as Productivity by design or User Experience oriented architectures. In his previous role, Michael worked as a Technical Sales in France and assumed the promotion of the Flash Platform in front of large audiences of developers and IT managers. Before joining Adobe, Michael founded a software company and taught RIA languages such as Flex and PHP in IT engineering schools. ",
          "fullname" : "Michael Chaize",
          "id" : 725
        }
      ],
    "summary" : "During this session, well discover the new Flex 4 framework associated with Flash Builder 4 (Eclipse plug-in to develop Flex apps) and how your rich front-end can exchange objects with your JAVA server. If you wish to develop Desktop applications, then youll be interested by the new feat...",
    "thumbnail" : "http://a3.parleys.com/p/2234/thumb201012101644464611632.jpg",
    "title" : "The latest innovations of the Adobe Flash Platform for Java developers - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 18,
    "totalViews" : 1222,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2163/201011301326101895213.mp3",
    "duration" : 2768.0100000000002,
    "id" : 2163,
    "isFree" : false,
    "keywords" : [ { "name" : "jigsaw" } ],
    "speakers" : [ { "bio" : "Mark Reinhold is a Principal Engineer at Sun Microsystems, where he works on the Java Platform, Standard Edition, and the OpenJDK Project. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. He was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6. He currently leads the engineering team for the OpenJDK Project and also serves as chair of the OpenJDK Governance Board. Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology.",
          "fullname" : "Mark  Reinhold",
          "id" : 27
        } ],
    "summary" : "Update on the Java Jigsaw project.",
    "thumbnail" : "http://a2.parleys.com/p/2163/thumb201011301318378168840.jpg",
    "title" : "The Modular Java Platform",
    "totalComments" : 1,
    "totalDownloads" : 41,
    "totalViews" : 275,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2150/201011291105463669920.mp3",
    "duration" : 3306.02,
    "id" : 2150,
    "isFree" : false,
    "keywords" : [ { "name" : "Fantom" },
        { "name" : "clojure" },
        { "name" : "scala" },
        { "name" : "jvm" },
        { "name" : "groovy" }
      ],
    "speakers" : [ { "bio" : "Stephan Colebourne has worked with Java since version 1.0, and contributed to open source software since 2000. My work includes Joda-Time, JSR 310 (Date and Time API) and Apache Jakarta Commons. I was elected a Java Champion in 2007.",
          "fullname" : "Stephen  Colebourne",
          "id" : 99
        } ],
    "summary" : "The Java language has been with us for 15 years and has been remarkably successful. Yet in the past 5 years, many alphageeks have started looking for the so-called next big language.   * What will that language look like? * What features are essential? * Does that language exist to...",
    "thumbnail" : "http://a2.parleys.com/p/2150/thumb201011291100358938925.jpg",
    "title" : "The Next Big JVM Language",
    "totalComments" : 0,
    "totalDownloads" : 41,
    "totalViews" : 346,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s3.parleys.com/parleys/2102/201011232040533914846.mp3",
    "duration" : 3865.6799999999998,
    "id" : 2102,
    "isFree" : false,
    "keywords" : [ { "name" : "JSR299" },
        { "name" : "Weld" },
        { "name" : "CDI" },
        { "name" : "seam" }
      ],
    "speakers" : [ { "bio" : "Dan Allen is a passionate Java EE software developer, consultant, and author of Seam in Action with over eight years of development experience using technologies that include Java frameworks (Seam, JSF, EJB3, Hibernate, Spring, Struts), testing frameworks (JUnit, TestNG), JavaScript and DOM scripting, CSS and page layouts, Maven 2, Ant, Groovy, and many others.  After graduating from Cornell University with a degree in Materials Science and Engineering in 2000, Dan became captivated by the world of free and open source software, which gave him his debut in software development. He soon discovered the combination of Linux and the Java EE platform to be the ideal blend on which to build his professional career, with his interests equally divided between the two platforms.  Dan is also a dedicated open source advocate, a committer on the Seam project, an active participant in the Seam community, and a Java blogger. You can keep up with Dan's development experiences by subscribing to his blog at http://mojavelinux.com.",
          "fullname" : "Dan Allen",
          "id" : 351
        } ],
    "summary" : "This talk introduces JSR-299: Contexts and Dependency Injection for the Java EE platform (CDI), the new Java standard for dependency injection and contextual lifecycle management. The talk covers the core programming model, explains its relationship to EJB 3.1 and JSF 2.0, and clarifies ho...",
    "thumbnail" : "http://a2.parleys.com/p/2102/thumb201011240931084937.jpg",
    "title" : "The roots of Java EE 6: JSR-299 (CDI) and Weld extensions",
    "totalComments" : 0,
    "totalDownloads" : 42,
    "totalViews" : 434,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2172/201012011232591007183.mp3",
    "duration" : 3050.0300000000002,
    "id" : 2172,
    "isFree" : true,
    "keywords" : [ { "name" : "nosql" },
        { "name" : "hadoop" }
      ],
    "speakers" : [ { "bio" : null,
          "fullname" : "Peter White",
          "id" : 281
        } ],
    "summary" : "Apache Hadoop is a part of a growing ecosystem of projects for large-scale data analysis. This talk will present the main components of Hadoop and related tools and how they work together.",
    "thumbnail" : "http://a1.parleys.com/p/2172/thumb201012011228578667100.jpg",
    "title" : "The State of Hadoop",
    "totalComments" : 0,
    "totalDownloads" : 33,
    "totalViews" : 571,
    "totalVotes" : 1,
    "totalVotesValue" : 2.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2176/201012011517384234779.mp3",
    "duration" : 3186.0,
    "id" : 2176,
    "isFree" : true,
    "keywords" : [ { "name" : "prototype" },
        { "name" : "2010" },
        { "name" : "devoxx" },
        { "name" : "HTML5" },
        { "name" : "microsoft" },
        { "name" : "keynote" },
        { "name" : "javascript" },
        { "name" : "safari" },
        { "name" : "jquery" },
        { "name" : "firefox" }
      ],
    "speakers" : [ { "bio" : "Ben Galbraith is the director of developer relations at Palm and the co-founder of Ajaxian.com. Ben has long juggled interests in both business and tech, having written his first computer program at six years old, started his first business at ten, and entered the IT workforce at twelve. He has delivered hundreds of technical presentations world-wide, produced several technical conferences, and co-authored over a half-dozen books. He has enjoyed a variety of business and technical roles throughout his career, including CEO, CIO, CTO, and Chief Software Architect roles in medical, publishing, media, manufacturing, advertising, software and internet industries. He lives in Palo Alto with his wife and five children.",
          "fullname" : "Ben Galbraith",
          "id" : 765
        },
        { "bio" : "Dion Almaer now works at Google on the Gears project and the Google out reach program. He is an architect, mentor, pragmatic, and evangelist of technologies such as J2EE, JDO, AOP, and Groovy. He is the Editor-in-Chief of TheServerSide.com J2EE Community and enjoys working in the community. He is a member of the Java Community Process, where he participates on various expert groups.",
          "fullname" : "Dion  Almaer",
          "id" : 63
        }
      ],
    "summary" : "The State of the Web keynote",
    "thumbnail" : "http://a1.parleys.com/p/2176/thumb201012021340118632176.png",
    "title" : "The State of the Web",
    "totalComments" : 0,
    "totalDownloads" : 70,
    "totalViews" : 2576,
    "totalVotes" : 19,
    "totalVotesValue" : 3.5789684210526298,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2178/20101201203113057148.mp3",
    "duration" : 2987.0100000000002,
    "id" : 2178,
    "isFree" : false,
    "keywords" : [ { "name" : "agile" },
        { "name" : "methodology" },
        { "name" : "collaboration" }
      ],
    "speakers" : [ { "bio" : "Franky Redant has been involved in internet companies from the early days of the Internet in Belgium, since 1993. He co-founded the first web-building company in Belgium called The Reference. For the ten years following he evolved from system engineer and developer to project and program manager to finally COO and CIO of one of the largest internet businesses in Belgium at that time.    During that time he also co-founded several other companies involving an internet news service, a search-engine and portal project and a software application vendor building a suite of applications to enable the mobile web. He also co-founded Nonillion, a software service company focusing on front-end and back-end software development for webplatforms (CRM, webservices etc.) where he was COO and CIO again. He also lead the Bulgarian sister company Nonillion Bulgaria as a CEO.    In 2010 Franky founded Fyronic, where he helps organizations to become more effective and efficient using web 2.0 and Enterprise 2.0 concepts and tools. With his background in Operations, Quality Assurance and IT and his experience with how knowledge workers collaborate and innovate in a company environment combined with his knowledge of web 2.0, social media and Enterprise 2.0, Franky coaches organizations to become Agile Enterprises (=Agile, Collaborative, Innovative, Intelligent), a requirement in todays business environment.",
          "fullname" : "Franky Redant",
          "id" : 766
        } ],
    "summary" : "The speech will give an (short) overview of: * What is  Enterprise 2.0 & social media (for the enterprise)? * What are Enterprise 2.0 tools & platforms ? * How does Cegeka use these tools in their Agile software development? * What are the benefits of using these new collaboration platforms ? ",
    "thumbnail" : "http://a2.parleys.com/p/2178/thumb201012012159577542915.jpg",
    "title" : "The Use of Collaboration Tools within the Cegeka Agile Teams",
    "totalComments" : 0,
    "totalDownloads" : 17,
    "totalViews" : 176,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2186/201012021539508103830.mp3",
    "duration" : 2872.0100000000002,
    "id" : 2186,
    "isFree" : false,
    "keywords" : [ { "name" : "JPA" },
        { "name" : "sql" },
        { "name" : "scalable" }
      ],
    "speakers" : [ { "bio" : "Uri has been with GigaSpaces for 3 and half years, first serving as a customer solutions architect and later on as product manager, his current role. He is responsible for gathering and articulating product requirements, driving product releases and conducting product marketing activities to customers and prospects. He often speaks at industry conferences and GigaSpaces user events. Uri has an accumulated nearly 10 years experience in architecting, implementing, tuning and deploying large-scale enterprise systems. His main areas of expertise are enterprise Java, distributed computing and, naturally, GigaSpaces. In his spare time, Uri enjoys hanging out with his 2 young daughters, perhaps the only two people in the world who really understand him ",
          "fullname" : "Uri Cohen",
          "id" : 767
        } ],
    "summary" : "This session will focus on the various data and querying models available in todays distributed data stores landscape. In this session, we will review what models and APIs are available and discuss the capabilities each of them provides, the applicable use cases and what it means for your...",
    "thumbnail" : "http://a2.parleys.com/p/2186/thumb201012021543079002155.jpg",
    "title" : "To scale or not to scale: Key/Value, Document, SQL, JPA – What’s right for my app?",
    "totalComments" : 0,
    "totalDownloads" : 47,
    "totalViews" : 299,
    "totalVotes" : 6,
    "totalVotesValue" : 3.5,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2228/201012101110389031492.mp3",
    "duration" : 1785.45,
    "id" : 2228,
    "isFree" : false,
    "keywords" : [ { "name" : "RIA" },
        { "name" : "rest" },
        { "name" : "JavaFX" }
      ],
    "speakers" : [ { "bio" : "Johan Vos started to work with Java in 1995. He worked on the Java Linux port with the Blackdown team. He has been doing Java consulting and development for a number of customers in completely different areas. Over the years, he has been active in a number of Java-based community projects, e.g. OSGi, the Glassfish project and JFXtras.org.  With LodgON, the company he co-founded, he is mainly working on Java solutions for social networking software.   Since he can't make a choice between embedded development and enterprise development, his main focus is on end-to-end Java, combining the strengths of back-end systems and embedded devices. His favourite technologies are currently Java EE / Glassfish at the backend and JavaFX at the frond-end.",
          "fullname" : "Johan Vos",
          "id" : 788
        } ],
    "summary" : "Rich Internet Applications provide additional value when they can interact with back-end systems, rather than being standalone applications.    Different types of interactions with back-end systems are possible, depending on the nature of the front-end application (RIA) and the back-end sy...",
    "thumbnail" : "http://a2.parleys.com/p/2228/thumb201012101108242865869.jpg",
    "title" : "Using RedFX to connect JavaFX clients and Java Enterprise systems",
    "totalComments" : 0,
    "totalDownloads" : 17,
    "totalViews" : 860,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2087/201011230050332697392.mp3",
    "duration" : 3297.3200000000002,
    "id" : 2087,
    "isFree" : false,
    "keywords" : [ { "name" : "RIA" },
        { "name" : "gwt" },
        { "name" : "vaadin" },
        { "name" : "javascript" }
      ],
    "speakers" : [ { "bio" : "Joonas Lehtinen is one of the core developers of Vaadin, a Java-based framework for building business-oriented Rich Internet Applications (RIAs). Joonas has been developing applications for the web since 1995 with a strong focus on Ajax and Java. He is the founder and CEO of Vaadin Ltd.",
          "fullname" : "Joonas Lehtinen",
          "id" : 721
        } ],
    "summary" : "Get introduced to Vaadin open source web framework by its founder. The framework provides a desktop-like user experience on the web without writing any HTML, XML or JavaScript. The user interface is written completely in Java and run at the server-side. Applications are deployed as Servlet...",
    "thumbnail" : "http://a2.parleys.com/p/2087/thumb201011230157001363290.jpg",
    "title" : "Vaadin - Rich Web Applications in Java without Plug-ins or JavaScript",
    "totalComments" : 1,
    "totalDownloads" : 38,
    "totalViews" : 834,
    "totalVotes" : 11,
    "totalVotesValue" : 3.5455000000000001,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2171/201012011231004438332.mp3",
    "duration" : 1853.72,
    "id" : 2171,
    "isFree" : false,
    "keywords" : [ { "name" : "JDK" },
        { "name" : "performance" },
        { "name" : "VisualVM" }
      ],
    "speakers" : [ { "bio" : "Jaroslav has got a MSc. degree in IT. He has started his professional IT career more than 10 years ago in 2008 working as a trainee in Norwegian leading BI and warehousing consultancy company, IC Group Norway. After the trial period he was given a position of junior developer and took care of analysis and implementation of smaller projects. After returning back to his home country he set up a developer workshop company (7 people) specialized mainly in DB oriented applications. Technologies varied from MS Access to J2EE application deployed on JBoss.  Basically, the company went bankrupt and he moved on. The next step was cca. 4 years spent in a company specialized on DMS solutions. He cycled between senior developer, analyst, architect and team lead positions so he had a chance to wear each hat. In the end he had the feeling he wanted to do something more tekkie and left for Sun Microsystems. Since 2006 he's been employed by Sun Microsystems as a senior software developer. He's taken part in various projects like NetBeans Profiler, VisualVM (jvisualvm) and JavaFX Editor support. He was driving his own projects like NetBeans JMeter integration and completely self standing project BTrace - together with its bindings for VisualVM and NetBeans.    This experience gives him insight to the whole line of software development - from requirements gathering and analysis, through design and implementation to performance management and application maintenance.",
          "fullname" : "Jaroslav Bachorik",
          "id" : 760
        } ],
    "summary" : "VisualVM is a visual tool integrating several commandline JDK tools and lightweight profiling capabilities. Designed for both production and development time use, it further enhances the capability of monitoring and performance analysis for the Java SE platform. ",
    "thumbnail" : "http://a3.parleys.com/p/2171/thumb201012011227206965114.jpg",
    "title" : "VisualVM - multiplatform versatile monitoring solution",
    "totalComments" : 0,
    "totalDownloads" : 35,
    "totalViews" : 223,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2128/201011261251007433594.mp3",
    "duration" : 3667.75,
    "id" : 2128,
    "isFree" : false,
    "keywords" : [ { "name" : "bayeux" },
        { "name" : "atomsphere" },
        { "name" : "jsf" },
        { "name" : "websockets" },
        { "name" : "glassfish" },
        { "name" : "comet" }
      ],
    "speakers" : [ { "bio" : "Apache guy and principal software engineer at Oracle. Matthias is a member of Oracle's ADF Faces group, where his current focus is the integration of the server-side-push technologies.",
          "fullname" : "Matthias Wessendorf",
          "id" : 743
        } ],
    "summary" : "To enable Sever-Side-Push in Web-Applications a lot of hacks (aka Comet/Bayeux) have been done in the past. While Comet allows to stream data to the client there are still limitations since you need a second request to talk to the server. The WebSocket spec fixes that by introducing a bi-d...",
    "thumbnail" : "http://a2.parleys.com/p/2128/thumb201011261414584108427.jpg",
    "title" : "WebSockets meet JavaServer Faces",
    "totalComments" : 0,
    "totalDownloads" : 34,
    "totalViews" : 386,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2107/20101124134046335814.mp3",
    "duration" : 1737.1900000000001,
    "id" : 2107,
    "isFree" : false,
    "keywords" : [ { "name" : "2010" },
        { "name" : "devoxx" },
        { "name" : "android" },
        { "name" : "keynote" },
        { "name" : "ipad" },
        { "name" : "parleys" }
      ],
    "speakers" : [ { "bio" : "Stephan Janssen is a serial entrepreneur that has founded several successful organizations such as the Belgian Java User Group (BeJUG) in 1996, JCS Int. in 1998, JavaPolis in 2002 and now Parleys.com in 2006. He has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries.  He was selected by BEA Systems as the first European (independent) BEA Technical Director. He has also been recognized by the Server Side as one of the 54 Who is Who in Enterprise Java 2004. Sun has recognized in 2005 his efforts for the Java Community and has engaged him in the Java Champion project. He has spoken at numerous Java and JUG conferences around the world.",
          "fullname" : "Stephan Janssen",
          "id" : 735
        } ],
    "summary" : "Welcome and intro to the Devoxx 2010 conference.",
    "thumbnail" : "http://a1.parleys.com/p/2107/thumb201011241544551392639.jpg",
    "title" : "Welcome and Intro",
    "totalComments" : 0,
    "totalDownloads" : 15,
    "totalViews" : 399,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2208/20101208110505101116.mp3",
    "duration" : 6320.0100000000002,
    "id" : 2208,
    "isFree" : false,
    "keywords" : [ { "name" : "JPA" },
        { "name" : "JPA2" },
        { "name" : "hibernate" }
      ],
    "speakers" : [ { "bio" : "After graduating from Supelec (French Grande Ecole\"), Emmanuel has spent a few years in the retail industry where he started to be involved in the ORM space. He joined the Hibernate team 4 years ago and is now a core developer at JBoss, a division of Red Hat. Emmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate core implementing the Java Persistence(tm) specification, as well as Hibernate Search and Validator. Emmanuel is a member of the EJB 3.0 expert group and the JSR 303: Bean Validation expert group. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and JAX.",
          "fullname" : "Emmanuel  Bernard",
          "id" : 60
        } ],
    "summary" : "If you want to know what new feature of Hibernate you are missing, come and join us. Java Persistence 2 is closing the gap and standardizes even more persistence related features.  What does this mean in the context of the Hibernate project? Generally speaking, what's new in Hibernate?...",
    "thumbnail" : "http://a2.parleys.com/p/2208/thumb201012081051494466873.jpg",
    "title" : "What's new in Hibernate: a JPA 2 perspective - Part 1",
    "totalComments" : 0,
    "totalDownloads" : 57,
    "totalViews" : 804,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s1.parleys.com/parleys/2210/201012081152445268268.mp3",
    "duration" : 3161.0100000000002,
    "id" : 2210,
    "isFree" : false,
    "keywords" : [ { "name" : "JPA" },
        { "name" : "JPA2" },
        { "name" : "hibernate" }
      ],
    "speakers" : [ { "bio" : "After graduating from Supelec (French Grande Ecole\"), Emmanuel has spent a few years in the retail industry where he started to be involved in the ORM space. He joined the Hibernate team 4 years ago and is now a core developer at JBoss, a division of Red Hat. Emmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate core implementing the Java Persistence(tm) specification, as well as Hibernate Search and Validator. Emmanuel is a member of the EJB 3.0 expert group and the JSR 303: Bean Validation expert group. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and JAX.",
          "fullname" : "Emmanuel  Bernard",
          "id" : 60
        } ],
    "summary" : "If you want to know what new feature of Hibernate you are missing, come and join us. Java Persistence 2 is closing the gap and standardizes even more persistence related features.  What does this mean in the context of the Hibernate project? Generally speaking, what's new in Hibernate?...",
    "thumbnail" : "http://a1.parleys.com/p/2210/thumb201012081145310592086.jpg",
    "title" : "What's new in Hibernate: a JPA 2 perspective - Part 2",
    "totalComments" : 0,
    "totalDownloads" : 49,
    "totalViews" : 408,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  },
  { "MP3URL" : "rtmp://s2.parleys.com/parleys/2100/201011231907153146423.mp3",
    "duration" : 3533.5100000000002,
    "id" : 2100,
    "isFree" : false,
    "keywords" : [ { "name" : "REPL" },
        { "name" : "scala" }
      ],
    "speakers" : [ { "bio" : "JavaPosse.com Member",
          "fullname" : "Dick Wall",
          "id" : 476
        },
        { "bio" : "Bill Venners is president of Artima Software, Inc. and editor-in- chief of Artima Developer. He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platforms architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Bill has been active in the Jini Community since its inception. He led the Jini Community ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services.",
          "fullname" : "Bill  Venners",
          "id" : 4
        }
      ],
    "summary" : "Scala fuses object-oriented and functional programming concepts into an elegant, statically typed programming language for the Java Platform. In 2010, Scala received a major upgrade in the Scala 2.8 release. This talk will give an overview of what's new in Scala 2.8, covering topics such a...",
    "thumbnail" : "http://a2.parleys.com/p/2100/thumb20101123190258643992.jpg",
    "title" : "What's New in Scala 2.8?",
    "totalComments" : 0,
    "totalDownloads" : 41,
    "totalViews" : 1502,
    "totalVotes" : 0,
    "totalVotesValue" : 0.0,
    "type" : "VIDEO_AND_SLIDES"
  }
]
